Repository: dotnet/winforms
Catalog: src/System.Windows.Forms.Analyzers.CSharp/src/Resources/xlf/*.*.xlf
Languages: sr

# AddDesignerSerializationVisibilityCodeFixTitle
source: Add DesignerSerializationVisibilityAttribute to property
sr: Ajouter DesignerSerializationVisibilityAttribute à une propriété

# GdiplusFontFamilyNotFound
source: Font '{0}' cannot be found.
sr: Impossible de trouver la police '{0}'.

# GdiplusNotTrueTypeFont
source: Only TrueType fonts are supported. '{0}' is not a TrueType font.
sr: Seules les polices TrueType sont prises en charge. '{0}' n'est pas une police TrueType.

# InvalidArgumentValueFontConverter
source: Value of '{0}' is not valid for font size unit.
sr: La valeur de «{0}» n’est pas valide pour l’unité de taille de police.

# TextParseFailedFormat
source: Text "{0}" cannot be parsed. The expected text format is "{1}".
sr: Impossible d'analyser le texte "{0}". Le format du texte attendu est "{1}".

# WFO0001Message
source: Only projects with 'OutputType={0}' supported
sr: Seuls les projets avec «OutputType={0}» pris en charge

# WFO0001Title
source: Unsupported project type
sr: Type de projet non pris en charge

# WFO0002Message
source: ArgumentException: Project property '{0}' cannot be set to '{1}'
sr: ArgumentException : la propriété de projet «{0}» ne peut pas être définie sur «{1}»

# WFO0002MessageWithReason
source: ArgumentException: Project property '{0}' cannot be set to '{1}'. Reason: {2}.
sr: ArgumentException : la propriété de projet « {0} » ne peut pas être définie sur « {1} ». Raison : {2}.

# WFO0002Title
source: Unsupported property value
sr: Valeur de propriété non prise en charge

# WFO1000AnalyzerDescription
source: A property should determine its property content serialization with the DesignerSerializationVisibilityAttribute, DefaultValueAttribute or the ShouldSerializeProperty method.
sr: Une propriété doit déterminer la sérialisation du contenu de sa propriété avec la méthode DesignerSerializationVisibilityAttribute, DefaultValueAttribute ou ShouldSerializeProperty.

# WFO1000AnalyzerMessageFormat
source: Property '{0}' does not configure the code serialization for its property content
sr: La propriété « {0} » ne configure pas la sérialisation du code pour son contenu de propriété

# WFO1000AnalyzerTitle
source: Missing code serialization configuration for property content
sr: Configuration de sérialisation de code manquante pour le contenu de la propriété

# WFO2001AnalyzerDescription
source: Avoid passing a `Func<T>` to `InvokeAsync` where `T` is a `Task` or `ValueTask`, unless your intention is for the delegate to simply be kicked off as an unsupervised task. Instead, use `Func<CancellationToken, ValueTask>` or `Func<CancellationToken, ValueTask<T>>`, so that the delegate passed to `InvokeAsync` can be awaited, allowing exceptions to be properly handled.
sr: Évitez de passer un `Func<T>` à `InvokeAsync` où `T` est une `Task` ou `ValueTask`, sauf si votre intention est que le délégué soit simplement lancé en tant que tâche non supervisée. Utilisez plutôt `Func<CancellationToken, ValueTask>` ou `Func<CancellationToken, ValueTask<T>>`, afin que le délégué passé à ’InvokeAsync’ puisse être attendu, ce qui permet de gérer correctement les exceptions.

# WFO2001AnalyzerMessageFormat
source: Task is being passed to InvokeAsync without a cancellation token
sr: La tâche est passée à InvokeAsync sans jeton d’annulation

# WFO2001AnalyzerTitle
source: Task is being passed to InvokeAsync without a cancellation token
sr: La tâche est passée à InvokeAsync sans jeton d’annulation
