Repository: dotnet/winforms
Catalog: src/System.Windows.Forms.Design/src/Resources/xlf/*.*.xlf
Languages: sr

# SerializerResourceExceptionInvariant
source: Error reading resources from the resource file for the default culture: {0}
sr: Ошибка чтения ресурсов из файла ресурсов для культуры по умолчанию: {0}

# SerializerTypeAbstract
source: The designer must create an instance of type '{0}' but it cannot because the type is declared as abstract.
sr: Проектировщик должен создать экземпляр типа '{0}', однако это невозможно, поскольку тип объявлен как абстрактный.

# SerializerTypeNotFound
source: Could not find type '{0}'. Please make sure that the assembly that contains this type is referenced. If this type is a part of your development project, make sure that the project has been successfully built using settings for your current platform or Any CPU.
sr: Не удалось найти тип "{0}". Проверьте, что есть ссылка на сборку, содержащую этот тип. Если этот тип является частью разрабатываемого проекта, убедитесь в том, что проект успешно откомпилирован с использованием параметров для вашей текущей платформы или для любого процессора.

# SerializerUndeclaredName
source: The variable '{0}' is either undeclared or was never assigned.
sr: Переменная '{0}' либо не объявлена, либо ей не было присвоено значение.

# ShortcutKeys_InvalidKey
source: (Unknown)
sr: (Неизвестный)

# SizeModeDescription
source: Changes the sizing mode of the Image displayed in the PictureBox
sr: Меняет режим изменения размера изображения, отображаемого в поле PictureBox

# SizeModeDisplayName
source: Size Mode:
sr: Режим изменения размера:

# StandardMenuAbout
source: &About...
sr: &О программе...

# StandardMenuContents
source: &Contents
sr: &Содержание

# StandardMenuCopy
source: &Copy
sr: &Копировать

# StandardMenuCreateDesc
source: Create Standard Menu
sr: Создание стандартного меню

# StandardMenuCustomize
source: &Customize
sr: &Настройки

# StandardMenuCut
source: Cu&t
sr: Вырезат&ь

# StandardMenuEdit
source: &Edit
sr: &Правка

# StandardMenuExit
source: E&xit
sr: Вы&ход

# StandardMenuFile
source: &File
sr: &Файл

# StandardMenuHelp
source: &Help
sr: &Справка

# StandardMenuIndex
source: &Index
sr: &Индекс

# StandardMenuNew
source: &New
sr: Со&здать

# StandardMenuOpen
source: &Open
sr: &Открыть

# StandardMenuOptions
source: &Options
sr: &Параметры

# StandardMenuPaste
source: &Paste
sr: Вст&авка

# StandardMenuPrint
source: &Print
sr: &Печать

# StandardMenuPrintPreview
source: Print Pre&view
sr: Предварительный прос&мотр

# StandardMenuRedo
source: &Redo
sr: &Отмена действия

# StandardMenuSave
source: &Save
sr: Со&хранить

# StandardMenuSaveAs
source: Save &As
sr: Сохранить &как

# StandardMenuSearch
source: &Search
sr: &Поиск

# StandardMenuSelectAll
source: Select &All
sr: Выделить &все

# StandardMenuTools
source: &Tools
sr: Сер&вис

# StandardMenuUndo
source: &Undo
sr: &Отмена действия

# StandardToolCut
source: C&ut
sr: В&ырезать

# StandardToolHelp
source: He&lp
sr: Спр&авка

# StringPropertyComment
source: Looks up a localized string similar to {0}.
sr: Ищет локализованную строку, похожую на {0}.

# StringPropertyTruncatedComment
source: {0} [rest of string was truncated]";
sr: {0} [остаток строки усечен]";

# TabControlAdd
source: Add Tab
sr: Добавить вкладку

# TabControlAddTab
source: Add tab to '{0}'
sr: Добавить вкладку в '{0}'

# TabControlInvalidTabPageType
source: Cannot add '{0}' to TabControl. Only TabPages can be directly added to TabControls.
sr: Невозможно добавить {0} к TabControl. К TabControls могут напрямую добавляться только TabPage.

# TabControlRemove
source: Remove Tab
sr: Удалить вкладку

# TabControlRemoveTab
source: Remove tab '{0}' from '{1}'
sr: Удалить вкладку "{0}" из "{1}"

# TableLayoutPanelDesignerAbsoluteMenu
source: A&bsolute
sr: А&бсолютный

# TableLayoutPanelDesignerAddColumn
source: &Add Column
sr: Добави&ть столбец

# TableLayoutPanelDesignerAddColumnUndoUnit
source: Add Column on {0}
sr: Добавить столбец в {0}

# TableLayoutPanelDesignerAddMenu
source: &Add
sr: До&бавить

# TableLayoutPanelDesignerAddRow
source: Add Ro&w
sr: Добав&ить строку

# TableLayoutPanelDesignerAddRowUndoUnit
source: Add Row on {0}
sr: Добавить строку в {0}

# TableLayoutPanelDesignerAutoSizeMenu
source: A&utoSize
sr: Автора&змер

# TableLayoutPanelDesignerChangeSizeTypeUndoUnit
source: Change SizeType on {0}
sr: Изменить SizeType в {0}

# TableLayoutPanelDesignerClearAnchor
source: Clearing Anchor property of {0} for {1}
sr: Очистка свойства Anchor из {0} для {1}

# TableLayoutPanelDesignerClearDock
source: Clearing Dock property of {0} for {1}
sr: Очистка свойства Dock из {0} для {1}

# TableLayoutPanelDesignerColMenu
source: &Column
sr: &Столбец

# TableLayoutPanelDesignerContextMenuCopy
source: C&opy TableLayoutPanel
sr: Коп&ировать TableLayoutPanel

# TableLayoutPanelDesignerContextMenuCut
source: &Cut TableLayoutPanel
sr: В&ырезать TableLayoutPanel

# TableLayoutPanelDesignerContextMenuDelete
source: &Delete TableLayoutPanel
sr: &Удалить TableLayoutPanel

# TableLayoutPanelDesignerControlsSwapped
source: {0} swapped with {1}
sr: {0} заменяется на {1}

# TableLayoutPanelDesignerDeleteMenu
source: &Delete
sr: &Удалить

# TableLayoutPanelDesignerEditRowAndCol
source: &Edit Rows and Columns...
sr: &Правка строк и столбцов...

# TableLayoutPanelDesignerInsertMenu
source: &Insert
sr: &Вставка

# TableLayoutPanelDesignerInvalidColumnRowCount
source: {0} must be greater than zero.
sr: Значение {0} должно быть больше нуля.

# TableLayoutPanelDesignerPercentageMenu
source: &Percentage
sr: Проце&нт

# TableLayoutPanelDesignerRemoveColumn
source: Remove Last Colu&mn
sr: Удалить последний сто&лбец

# TableLayoutPanelDesignerRemoveColumnUndoUnit
source: Remove Column on {0}
sr: Удалить столбец в {0}

# TableLayoutPanelDesignerRemoveRow
source: Remo&ve Last Row
sr: Удалит&ь последнюю строку

# TableLayoutPanelDesignerRemoveRowUndoUnit
source: Remove Row on {0}
sr: Удалить строку в {0}

# TableLayoutPanelDesignerRowMenu
source: &Row
sr: &Строка

# TableLayoutPanelFullDesc
source: Additional Rows or Columns cannot be created. TableLayoutPanel is full and GrowStyle is 'FixedSize'.
sr: Не удается создать дополнительные элементы Rows или Columns. TableLayoutPanel заполнена, а для параметра GrowStyle задано значение FixedSize.

# TableLayoutPanelRowColResize
source: Resizing {0} within {1}
sr: Изменение размера {0} в {1}

# TableLayoutPanelSpanDesc
source: TableLayoutPanel cannot expand to contain the control, because the panel's GrowStyle property is set to 'FixedSize'.
sr: TableLayoutPanel нельзя расширить, чтобы включить данный элемент, поскольку для свойства GrowStyle данной панели задано значение FixedSize.

# ToolStripActionList_Dock
source: Dock:
sr: Закрепить:

# ToolStripActionList_DockDesc
source: Changes the Dock property
sr: Изменяет свойство Dock

# ToolStripActionList_GripStyle
source: GripStyle:
sr: Стиль захвата:

# ToolStripActionList_GripStyleDesc
source: Changes the GripStyle property
sr: Изменяет свойство GripStyle

# ToolStripActionList_Layout
source: Layout && Appearance
sr: Раскладка и внешний вид

# ToolStripActionList_RenderModeDesc
source: Changes the RenderMode property
sr: Изменяет свойство RenderMode

# ToolStripAddingItem
source: Adding {0} Item
sr: Добавление элемента {0}

# ToolStripAllowItemReorderAndAllowDropCannotBeSetToTrue
source: AllowItemReorder and AllowDrop cannot both be true.
sr: AllowItemReorder и AllowDrop не могут одновременно иметь значение true.

# ToolStripContainerActionList_Bottom
source: Bottom
sr: По нижнему краю

# ToolStripContainerActionList_BottomDesc
source: Toggles the participation of BottomToolStripPanel in runtime dragging of ToolStrip.
sr: Включает и выключает участие BottomToolStripPanel в перетаскивании ToolStrip во время выполнения.

# ToolStripContainerActionList_Left
source: Left
sr: По левому краю

# ToolStripContainerActionList_LeftDesc
source: Toggles the participation of LeftToolStripPanel in runtime dragging of ToolStrip.
sr: Включает и выключает участие LeftToolStripPanel в перетаскивании ToolStrip во время выполнения.

# ToolStripContainerActionList_Right
source: Right
sr: По правому краю

# ToolStripContainerActionList_RightDesc
source: Toggles the participation of RightToolStripPanel in runtime dragging of ToolStrip.
sr: Включает и выключает участие RightToolStripPanel в перетаскивании ToolStrip во время выполнения.

# ToolStripContainerActionList_Show
source: Show
sr: Показать

# ToolStripContainerActionList_Top
source: Top
sr: По верхнему краю

# ToolStripContainerActionList_TopDesc
source: Toggles the participation of TopToolStripPanel in runtime dragging of ToolStrip.
sr: Включает и выключает участие TopToolStripPanel в перетаскивании ToolStrip во время выполнения.

# ToolStripContainerActionList_Visible
source: Panel Visibility
sr: Видимость панели

# ToolStripCreatingNewItemTransaction
source: ToolStrip New Item create Transaction.
sr: Новый элемент ToolStrip создает транзакцию.

# ToolStripDesignerEmbedVerb
source: Embed in ToolStripContainer
sr: Внедрить в ToolStripContainer

# ToolStripDesignerEmbedVerbDesc
source: Embeds the current ToolStrip in ToolStripContainer
sr: Внедряет текущий ToolStrip в ToolStripContainer

# ToolStripDesignerStandardItemsVerb
source: &Insert Standard Items
sr: &Вставить стандартные элементы

# ToolStripDesignerStandardItemsVerbDesc
source: Inserts standard items in the current ToolStrip
sr: Вставляет стандартные элементы в текущий ToolStrip

# ToolStripDesignerTemplateNodeEnterText
source: Type Here
sr: Прототип для текста

# ToolStripDesignerTemplateNodeLabelToolTip
source: Type Text for ToolStripMenuItem
sr: Введите текст для ToolStripMenuItem

# ToolStripDesignerTemplateNodeSplitButtonStatusStripAccessibleName
source: Add Menu Item
sr: Добавить пункт меню

# ToolStripDesignerTemplateNodeSplitButtonStatusStripToolTip
source: Add ToolStripStatusLabel
sr: Добавить ToolStripStatusLabel

# ToolStripDesignerTemplateNodeSplitButtonToolTip
source: Add ToolStripButton
sr: Добавить ToolStripButton

# ToolStripDesignerToolStripAccessibleName
source: New item selection
sr: Выбор нового элемента

# ToolStripDesignerTransactionAddingItem
source: Adding Item
sr: Добавление элемента

# ToolStripDesignerTransactionRemovingItem
source: Removing Item
sr: Удаление элемента

# ToolStripDropDownItemCollectionEditorVerb
source: &Edit DropDownItems...
sr: &Правка DropDownItems...

# ToolStripInsertingIntoDropDownTransaction
source: ToolStrip MenuItem Insert in DropDown Transaction.
sr: Вставка элементов меню ToolStrip в транзакцию DropDown.

# ToolStripItemCollectionEditorVerb
source: &Edit Items...
sr: &Правка элементов…

# ToolStripItemContextMenuConvertTo
source: Con&vert To
sr: Пр&еобразовать в

# ToolStripItemContextMenuInsert
source: &Insert
sr: &Вставить

# ToolStripItemContextMenuSetImage
source: Set I&mage...
sr: Задать р&исунок...

source: ToolStripItem Property Change Transaction.
sr: Транзакция изменения свойства ToolStripItem.

# ToolStripMorphingItemTransaction
source: ToolStripItem Morphing Transaction.
sr: Транзакция преобразования ToolStripItem

# ToolStripPanelGlyphUnsupportedDock
source: Unsupported Dock
sr: Неподдерживаемое свойство Dock

# ToolStripSeparatorError
source: Cannot add ToolStripSeparator to MenuStrip.
sr: Не удается добавить ToolStripSeparator в MenuStrip.

# ToolboxItemInvalidKey
source: Argument should be a non-empty string.
sr: Аргумент не может быть пустой строкой.

# ToolboxItemInvalidPropertyType
source: Property {0} requires an argument of type {1}.
sr: Свойство {0} требует аргумент типа {1}.

# ToolboxItemLocked
source: Toolbox item cannot be modified.
sr: Невозможно изменить элемент панели инструментов.

# ToolboxItemValueNotSerializable
source: Data type {0} is not serializable. Items added to a property dictionary must be serializable.
sr: Тип данных {0} не является упорядочиваемым. В словарь свойств можно добавлять только упорядочиваемые элементы.

# TrayAutoArrange
source: Auto Arrange Tray Icons
sr: Автоматически упорядочить значки на панели задач

# TrayLineUpIcons
source: Line Up Tray Icons
sr: Выстроить значки на панели задач

# TrayShowLargeIcons
source: Show Large or Small Icons
sr: Отображать крупные или мелкие значки

# TypeNotFoundInTargetFramework
source: Type '{0}' is not available in the target framework.
sr: Тип "{0}" недоступен в целевой платформе.

# UIServiceHelper_ErrorCaption
source: Error
sr: Ошибка

# UndoEngineComponentAdd0
source: Add Component
sr: Добавить компонент

# UndoEngineComponentAdd1
source: Add {0}
sr: Добавить {0}

# UndoEngineComponentChange0
source: Change Component
sr: Изменить компонент

# UndoEngineComponentChange1
source: Change {0}
sr: Изменить {0}

# UndoEngineComponentChange2
source: Change {0}.{1}
sr: Изменить {0}.{1}

# UndoEngineComponentRemove0
source: Remove Component
sr: Удалить компонент

# UndoEngineComponentRemove1
source: Remove {0}
sr: Удалить {0}

# UndoEngineComponentRename
source: Rename {0} to {1}
sr: Переименовать {0} в {1}

# UndoEngineMissingService
source: The service {0} is required but could not be found. If you have removed this service ensure that you provide a replacement.
sr: Требуется служба {0}, но она не найдена. Если вы перенесли эту службу, убедитесь в том, что обеспечили замену.

# UnsafeNativeMethodsNotImplemented
source: Not implemented.
sr: Не реализовано.

# WindowsFormsAddEvent
source: <couldn't find resource string "WindowsFormsAddEvent">
sr: <невозможно найти строку ресурса "WindowsFormsAddEvent">

# WindowsFormsCommandCenterX
source: Horizontal center of {0} component(s)
sr: Центр {0} компонентов по горизонтали

# WindowsFormsCommandCenterY
source: Vertical center of {0} component(s)
sr: Центр {0} компонентов по вертикали

# WindowsFormsTabOrderReadOnly
source: - Read Only
sr: – Только для чтения

# bitmapFileDescription
source: Bitmap files
sr: Файлы точечных рисунков

# iconFileDescription
source: Icon files
sr: Файлы значков

# imageFileDescription
source: All image files
sr: Все файлы изображений

# lockedDescr
source: The Locked property determines if we can move or resize the control.
sr: Свойство Locked определяет, можно ли перемещать элемент управления или изменять его размеры.

# metafileFileDescription
source: Metafiles
sr: Метафайлы

# ToolStripActionList_RenderMode
source: RenderMode:
sr: Modo de representación:

# ColorEditorStandardTab
source: Web
sr: Sieć Web

# CannotConvertDoubleToDate
source: Double cannot be converted to a date.
sr: Impossibile convertire un tipo double in un tipo date.

# CannotConvertIntToFloat
source: Integer cannot be converted to a float.
sr: Impossibile convertire un numero intero in un valore float.

# SerializationManagerAreadyInSession
source: You cannot create a new session because this serialization manager already has an active serialization session.
sr: Non è possibile creare una nuova sessione perché per questo gestore di serializzazione esiste già una sessione di serializzazione attiva.
