Repository: dotnet/winforms
Catalog: src/System.Windows.Forms.Design/src/Resources/xlf/*.*.xlf
Languages: sr

source: {0} Reparent Controls Transaction.
sr: Транзакция переподчиненных элементов управления {0}.

# AXNotRegistered
source: Could not create ActiveX control '{0}' because it is not properly registered.
sr: Невозможно создать элемент управления ActiveX '{0}', так как он не был должным образом зарегистрирован.

# AccessibleActionCheck
source: Check
sr: Установить

# AccessibleActionUncheck
source: Uncheck
sr: Снять

# AnchorEditorAccName
source: Anchor Editor
sr: Редактор привязки

# AnchorEditorBottomAccName
source: Bottom
sr: Снизу

# AnchorEditorLeftAccName
source: Left
sr: Слева

# AnchorEditorRightAccName
source: Right
sr: Справа

# AnchorEditorTopAccName
source: Top
sr: Сверху

# AxImportFailed
source: Failed to import the ActiveX control. Please ensure it is properly registered.
sr: Сбой при импорте элемента управления ActiveX. Убедитесь в том, что он правильно зарегистрирован.

# Ax_Control
source: ActiveX Control
sr: Элемент управления ActiveX

# BaseNodeName
source: Node
sr: Узел

# BasicDesignerLoaderAlreadyLoaded
source: The designer is already loaded.
sr: Конструктор уже загружен.

# BasicDesignerLoaderDifferentHost
source: The designer loader has already been loaded from another host. You can only have one designer loader for each host.
sr: Загрузчик конструктора уже был загружен с другого узла. Для каждого приложения может существовать только один загрузчик конструктора.

# BasicDesignerLoaderMissingService
source: The service {0} is required but could not be found. If you have removed this service ensure that you provide a replacement.
sr: Требуется служба {0}, но она не найдена. Если вы перенесли эту службу, убедитесь в том, что обеспечили замену.

# BasicDesignerLoaderNotInitialized
source: The designer loader has not been initialized yet. You may only call this method after initialization.
sr: Загрузчик конструктора еще не инициализирован. Этот метод можно вызвать только после инициализации.

# BehaviorServiceCopyControl
source: Copy and move {0}
sr: Копировать и переместить {0}

# BehaviorServiceCopyControls
source: Copy and move {0} Controls
sr: Копировать и переместить {0} элементы управления

# BehaviorServiceMoveControl
source: Move {0}
sr: Переместить {0}

# BehaviorServiceMoveControls
source: Move {0} Controls
sr: Переместить {0} элементы управления

# BehaviorServiceResizeControl
source: Resize {0}
sr: Изменить размер {0}

# BehaviorServiceResizeControls
source: Resize {0} Controls
sr: Изменить размер {0} элементов управления

# BinaryEditorAllFiles
source: All Files
sr: Все файлы

# BinaryEditorFileError
source: Error writing to file: {0}
sr: Ошибка записи в файл: {0}.

# BinaryEditorSaveFile
source: Save File As
sr: Сохранить файл как

# BinaryEditorTitle
source: Byte Array Property Editor
sr: Редактор свойств байтового массива

# BindingFormattingDialogCustomFormat
source: Custo&m format
sr: Спец&иальный формат

# BindingFormattingDialogCustomFormatAccessibleDescription
source: Custom format
sr: Специальный формат

# BindingFormattingDialogDecimalPlaces
source: &Decimal places
sr: &Десятичные разряды

# BindingFormattingDialogFormatTypeCurrency
source: Currency
sr: Валюта

# BindingFormattingDialogFormatTypeCurrencyExplanation
source: Specify the format for monetary values.
sr: Укажите формат денежных значений.

# BindingFormattingDialogFormatTypeCustom
source: Custom
sr: Настраиваемое

# BindingFormattingDialogFormatTypeCustomExplanation
source: Type a custom format string. A custom string may require extra handling unless it is a read-only value.
sr: Введите строку специального формата. Специальная строка может потребовать дополнительной обработки, если не предназначена только для чтения.

# BindingFormattingDialogFormatTypeCustomInvalidFormat
source: Invalid format
sr: Недопустимый формат

# BindingFormattingDialogFormatTypeDateTime
source: Date Time
sr: Дата и время

# BindingFormattingDialogFormatTypeDateTimeExplanation
source: Specify the format for date and time values.
sr: Укажите формат даты и времени.

# BindingFormattingDialogFormatTypeNoFormatting
source: No Formatting
sr: Без форматирования

# BindingFormattingDialogFormatTypeNoFormattingExplanation
source: Use no formatting to display the value from the source without adornment.
sr: Не использовать форматирование, если значения из источника отображаются без оформления.

# BindingFormattingDialogFormatTypeNumeric
source: Numeric
sr: Числовой

# BindingFormattingDialogFormatTypeNumericExplanation
source: Specify the format for numbers. Note that the Currency format type offers specialized formatting for monetary values.
sr: Задайте формат чисел. Помните, что формат "Денежный" обеспечивает специальное форматирование денежных значений.

# BindingFormattingDialogFormatTypeScientific
source: Scientific
sr: Научный

# BindingFormattingDialogFormatTypeScientificExplanation
source: Specify the format for values that use scientific notation.
sr: Задайте формат для значений, использующих экспоненциальное представление чисел.

# BindingFormattingDialogNullValue
source: &Null value:
sr: &Значение Null:

# BindingFormattingDialogType
source: &Type
sr: &Тип

# CellStyleBuilderNormalPreviewAccName
source: Normal Preview
sr: Обычный предварительный просмотр

# CellStyleBuilderSelectedPreviewAccName
source: Selected Preview
sr: Выборочный предварительный просмотр

# ChooseIconDisplayName
source: Choose Icon...
sr: Выбрать значок...

# ChooseImageDescription
source: Select the image displayed in the PictureBox
sr: Выберите изображение, отображаемое в поле PictureBox

# ChooseImageDisplayName
source: Choose Image...
sr: Выбрать изображение…

# ClassComments1
source: This class was auto-generated by the StronglyTypedResourceBuilder
sr: Этот класс создан автоматически классом StronglyTypedResourceBuilder

# ClassComments2
source: class via a tool like ResGen or Visual Studio.
sr: с помощью такого средства, как ResGen или Visual Studio.

# ClassComments3
source: To add or remove a member, edit your .ResX file then rerun ResGen
sr: Чтобы добавить или удалить член, измените RESX-файл и снова запустите ResGen

# ClassComments4
source: with the /str option, or rebuild your VS project.
sr: с параметром /str или выполните повторную сборку проекта VS.

# ClassDocComment
source: A strongly-typed resource class, for looking up localized strings, etc.
sr: Класс ресурса со строгой типизацией для поиска локализованных строк и т. д.

# ClipboardError
source: Requested Clipboard operation did not succeed.
sr: Сбой при выполнении запрошенной операции с буфером обмена.

# CodeDomComponentSerializationServiceClosedStore
source: The serialization store is closed. New objects cannot be added to a closed store.
sr: Хранилище сериализованных объектов закрыто. Добавление новых объектов в закрытое хранилище невозможно.

# CodeDomComponentSerializationServiceDeserializationError
source: Complete deserialization of {0} failed.
sr: Сбой полной десериализации {0}.

# CodeDomComponentSerializationServiceUnknownStore
source: This type of serialization store is not supported. Use a store returned by the CreateStore method.
sr: Этот тип хранилища сериализованных объектов не поддерживается. Используйте хранилище, возвращенное методом CreateStore.

# CodeDomDesignerLoaderBadSerializationObject
source: The serialization data object is not of the proper type.
sr: Неправильный тип объекта данных сериализации.

# CodeDomDesignerLoaderDocumentFailureTypeDesignerNotInstalled
source: {0} --- The designer for base class '{1}' is not installed.
sr: {0} --- Конструктор для базового класса '{1}' не установлен.

# CodeDomDesignerLoaderDocumentFailureTypeNotDesignable
source: {0} --- The base class '{1}' cannot be designed.
sr: {0} --- Невозможно создать базовый класс '{1}'.

# CodeDomDesignerLoaderDocumentFailureTypeNotFound
source: {0} --- The base class '{1}' could not be loaded. Ensure the assembly has been referenced and that all projects have been built.
sr: {0} --- Невозможно загрузить базовый класс '{1}'. Проверьте, что есть ссылка на сборку и все проекты созданы.

# CodeDomDesignerLoaderDupComponentName
source: There is already a component named '{0}'. Components must have unique names, and names must be case-insensitive. A name also cannot conflict with the name of any component in an inherited class.
sr: Компонент с именем "{0}" уже существует. Компоненты должны иметь уникальные имена, независимые от регистра. Кроме того, имя не может конфликтовать с именем какого-либо компонента в унаследованном классе.

# CodeDomDesignerLoaderInvalidBlankIdentifier
source: Empty identifiers are not valid.
sr: Пустые идентификаторы недопустимы.

# CodeDomDesignerLoaderInvalidIdentifier
source: '{0}' is not a valid identifier.
sr: {0} не является допустимым идентификатором.

# CodeDomDesignerLoaderNoLanguageSupport
source: The language did not provide a code parser for this file. Please make sure that this file type supports a designer.
sr: Язык не предоставил анализатор кода для этого файла. Убедитесь, что для этого типа файлов поддерживается использование конструктора.

# CodeDomDesignerLoaderNoRootSerializer
source: The designer could not be shown for this file because none of the classes within it can be designed.
sr: Показать конструктор для этого файла невозможно, так как невозможно сконструировать ни один из входящих в него классов.

# CodeDomDesignerLoaderNoRootSerializerWithFailures
source: The designer could not be shown for this file because none of the classes within it can be designed. The designer inspected the following classes in the file: {0}
sr: Показать конструктор для этого файла невозможно, так как невозможно сконструировать ни один из входящих в него классов. Конструктор проверил следующие классы в этом файле: {0}

# CodeDomDesignerLoaderNoTypeResolution
source: The designer loader did not supply a type resolution service, which is a requirement for CodeDom serialization.
sr: Загрузчик конструктора не предоставил службу определения типа, необходимую для сериализации CodeDom.

# CodeDomDesignerLoaderPropGenerateMember
source: Indicates if a member variable will be generated for this component.
sr: Указывает, будет ли создана переменная члена для этого компонента.

# CodeDomDesignerLoaderPropModifiers
source: Indicates the visibility level of the object.
sr: Указывает уровень видимости объекта.

# CodeDomDesignerLoaderSerializerTypeNotFirstType
source: The class {0} can be designed, but is not the first class in the file. Visual Studio requires that designers use the first class in the file. Move the class code so that it is the first class in the file and try loading the designer again.
sr: Класс {0} можно сконструировать, но это не первый класс в файле. В Visual Studio конструктор должен использовать первый класс в файле. Переместите код класса, чтобы он был первым в файле, и еще раз попробуйте загрузить конструктор.

# CollectionEditorCantRemoveItem
source: The item '{0}' cannot be removed.
sr: Невозможно удалить элемент '{0}'.

# CollectionEditorCaption
source: {0} Collection Editor
sr: Редактор коллекции {0}

# CollectionEditorCreateInstanceError
source: Neither {0} nor {1} can create an instance of {2}.
sr: Ни {0}, ни {1} не могут создать экземпляр {2}.

# CollectionEditorInheritedReadOnlySelection
source: Read-only component(s) selected.
sr: Выбран компонент(-ы) с доступом только для чтения.

# CollectionEditorProperties
source: {0} &properties:
sr: С&войства {0}:

# CollectionEditorPropertiesMultiSelect
source: Multi-Select &Properties:
sr: &Свойства множественного выбора:

# CollectionEditorPropertiesNone
source: &Properties:
sr: &Свойства:

# CollectionEditorUndoBatchDesc
source: Add or remove {0} objects
sr: Добавить или удалить {0} объектов

# ColorEditorAccName
source: Color Picker
sr: Палитра

# ColorEditorPaletteTab
source: Custom
sr: Настраиваемое

# ColorEditorSystemTab
source: System
sr: Система

# CommandSetAlignByPrimary
source: Format {0} components (alignment)
sr: Форматировать {0} компонентов (выравнивание)

# CommandSetAlignToGrid
source: Align {0} components to grid
sr: Выровнять {0} компонентов по сетке

# CommandSetBringToFront
source: Bring {0} controls to front
sr: Переместить {0} элементов управления на передний план

# CommandSetCutMultiple
source: Cut {0} Components
sr: Вырезать {0} компонентов

# CommandSetDelete
source: Delete {0} components
sr: Удалить {0} компонентов

# CommandSetError
source: An error occurred while processing this command. {0}
sr: Ошибка при обработке этой команды. {0}

# CommandSetFormatSpacing
source: Format {0} components (spacing)
sr: Форматировать {0} компонентов (с интервалом)

# CommandSetLockControls
source: Lock {0} components
sr: Заблокировать компоненты ({0})

# CommandSetPaste
source: Paste components
sr: Вставить компоненты

# CommandSetSendToBack
source: Send {0} controls to back
sr: Переместить {0} элементов управления на задний план

# CommandSetSize
source: Size {0} components
sr: Изменить размер {0} компонентов

# CommandSetSizeToGrid
source: Size {0} components to grid
sr: Изменить размер {0} компонентов по сетке

# CommandSetUnknownSpacingCommand
source: Unknown spacing command
sr: Неизвестная команда задания интервала

# ComponentDesignerAddEvent
source: Adding event '{0}'
sr: Добавляется событие '{0}'

# COM2UnhandledVT
source: Unhandled VT: {0}.
sr: Необработанный VT: {0}.

# ContentAlignmentEditorAccName
source: Alignment Picker
sr: Выбор выравнивания

# ContentAlignmentEditorBottomCenterAccName
source: Bottom Middle
sr: Снизу в середине

# ContentAlignmentEditorBottomLeftAccName
source: Bottom Left
sr: Внизу слева

# ContentAlignmentEditorBottomRightAccName
source: Bottom Right
sr: Снизу справа

# ContentAlignmentEditorMiddleCenterAccName
source: Middle Center
sr: Посередине по центру

# ContentAlignmentEditorMiddleLeftAccName
source: Middle Left
sr: Посередине слева

# ContentAlignmentEditorMiddleRightAccName
source: Middle Right
sr: Посередине справа

# ContentAlignmentEditorTopCenterAccName
source: Top Center
sr: Сверху по центру

# ContentAlignmentEditorTopLeftAccName
source: Top Left
sr: Вверху слева

# ContentAlignmentEditorTopRightAccName
source: Top Right
sr: Вверху справа

# ContextMenuAlignToGrid
source: Align To &Grid
sr: Выровнять по р&ешетке

# ContextMenuBringToFront
source: &Bring To Front
sr: &На передний план

# ContextMenuCopy
source: C&opy
sr: К&опировать

# ContextMenuCut
source: &Cut
sr: &Вырезать

# ContextMenuDelete
source: &Delete
sr: &Удалить

# ContextMenuDocumentOutline
source: &Document Outline
sr: Структура до&кумента

# ContextMenuLockControls
source: &Lock Controls
sr: &Блокировка элементов управления

# ContextMenuPaste
source: &Paste
sr: Вст&авка

# ContextMenuProperties
source: &Properties
sr: &Свойства

# ContextMenuSelect
source: &Select
sr: Выб&рать

# ContextMenuSendToBack
source: &Send To Back
sr: &На задний план

# ContextMenuStripActionList_ShowCheckMarginDesc
source: Toggles the ShowCheckMargin property
sr: Переключает свойство ShowCheckMargin

# ContextMenuStripActionList_ShowImageMarginDesc
source: Toggles the ShowImageMargin property
sr: Переключает свойство ShowImageMargin

# ContextMenuViewCode
source: View &Code
sr: Перейти к ко&ду

# ControlDesigner_WndProcException
source: The control {0} has thrown an unhandled exception in the designer and has been disabled. Exception: {1} Stack trace:{2}
sr: Элемент управления {0} возвратил необработанное исключение в конструкторе и был отключен. Исключение: {1} Трассировка стека:{2}

# CulturePropertyComment1
source: Overrides the current thread's CurrentUICulture property for all
sr: Переопределяет свойство CurrentUICulture текущего потока для всех

# CulturePropertyComment2
source: resource lookups using this strongly typed resource class.
sr: поиск ресурса с помощью этого класса ресурса со строгой типизацией.

# DataGridViewAddColumnTransactionString
source: Add Column
sr: Добавить столбец

# DataGridViewAddColumnVerb
source: &Add Column...
sr: &Добавить столбец…

# DataGridViewBoundColumnProperties
source: Bound Column &Properties
sr: Сво&йства привязанного столбца

# DataGridViewChooseDataSource
source: Choose Data Source:
sr: Выберите источник данных:

# DataGridViewChooseDataSourceTransactionString
source: {0} DataSource changed
sr: Источник данных {0} изменен

# DataGridViewColumnTypePropertyDescription
source: The DataGridViewColumn type.
sr: Тип DataGridViewColumn.

# DataGridViewDataSourceNoLongerValid
source: Unable to create columns for the data source. The data source is no longer valid
sr: Невозможно создать столбцы для источника данных. Источник данных стал недействительным

# DataGridViewDisableAddingTransactionString
source: Disable Adding
sr: Отключить добавление

# DataGridViewDisableColumnReorderingTransactionString
source: Disable Column Reordering
sr: Отключить возможность изменения порядка столбцов

# DataGridViewDisableDeletingTransactionString
source: Disable Deleting
sr: Отключить удаление

# DataGridViewDisableEditingTransactionString
source: Disable Editing
sr: Отключить правку

# DataGridViewDuplicateColumnName
source: The name {0} is already in use by another column.
sr: Имя {0} уже используется другим столбцом.

# DataGridViewEditColumnsTransactionString
source: Edit Columns
sr: Правка столбцов

# DataGridViewEditColumnsVerb
source: &Edit Columns...
sr: &Изменить столбцы…

# DataGridViewEnableAdding
source: Enable Adding
sr: Включить добавление

# DataGridViewEnableAddingTransactionString
source: Enable Adding
sr: Включить добавление

# DataGridViewEnableColumnReordering
source: Enable Column Reordering
sr: Включить возможность изменения порядка столбцов

# DataGridViewEnableColumnReorderingTransactionString
source: Enable Column Reordering
sr: Включить возможность изменения порядка столбцов

# DataGridViewEnableDeleting
source: Enable Deleting
sr: Включить удаление

# DataGridViewEnableDeletingTransactionString
source: Enable Deleting
sr: Включить удаление

# DataGridViewEnableEditing
source: Enable Editing
sr: Включить правку

# DataGridViewEnableEditingTransactionString
source: Enable Editing
sr: Включить правку

# DataGridViewProperties
source: &Properties
sr: &Свойства

# DataGridViewUnboundColumnProperties
source: Unbound Column &Properties
sr: Сво&йства непривязанного столбца

# DataGridView_Cancel
source: Cancel
sr: Отмена

# DataGridView_Close
source: Close
sr: Закрыть

# DataGridView_OK
source: OK
sr: ОК

# DataSourceLocksItems
source: Items collection cannot be modified when the DataSource property is set.
sr: Изменение коллекции элементов невозможно, если задано свойство DataSource.

# DesignBindingPickerAccessibleName
source: Data binding editor
sr: Редактор привязки данных

# DesignBindingPickerAddProjDataSourceLabel
source: Add new Object Data Source...
sr: Добавить новый источник данных объекта...

# DesignBindingPickerHelpGenAddDataSrc
source: Click the 'Add Project Data Source...' link to connect to data.
sr: Щелкните ссылку 'Добавить источник данных проекта...', чтобы установить связь с данными.

# DesignBindingPickerHelpGenCurrentBinding
source: Currently data bound to '{0}'.
sr: В данный момент данные привязаны к '{0}'.

# DesignBindingPickerHelpGenPickBindSrc
source: Select a BindingSource to bind to.
sr: Выберите источник BindingSource для привязки.

# DesignBindingPickerHelpGenPickDataSrc
source: Select a data source under 'Other Data Sources' to connect to data.
sr: Выберите источник данных в разделе 'Другие источники данных', чтобы установить связь с данными.

# DesignBindingPickerHelpGenPickMember
source: Select a data member to bind to.
sr: Выберите член данных для привязки.

# DesignBindingPickerHelpNodeInstances
source: Contains all form components that implement IList, IListSource or Array.
sr: Содержит все компоненты форм, в которых реализованы объекты IList, IListSource или массив.

# DesignBindingPickerHelpNodeNone
source: Selecting 'None' clears the current data binding.
sr: Выбор значения 'Нет' отменяет текущую привязку данных.

# DesignBindingPickerHelpNodeOther
source: Contains all project data sources and local form list instances.
sr: Содержит все источники данных проекта и локальные экземпляры списка форм.

# DesignBindingPickerHelpNodeProject
source: Contains all project data sources.
sr: Содержит все источники данных проекта.

# DesignBindingPickerHelpNodeProjectGroup
source: Contains project data sources belonging to this namespace.
sr: Содержит источники данных проекта, принадлежащие этому пространству имен.

# DesignBindingPickerNodeInstances
source: {0} List Instances
sr: {0} Экземпляры списка

# DesignBindingPickerNodeNone
source: None
sr: Отсутствует

# DesignBindingPickerNodeOther
source: Other Data Sources
sr: Другие источники данных

# DesignBindingPickerNodeProject
source: Project Data Sources
sr: Источники данных проекта

# DesignBindingPickerTreeViewAccessibleName
source: Bindable data sources and data members
sr: Привязываемые источники данных и члены данных

# DesignerActionPanel_CouldNotConvertValue
source: Could not convert value '{0}' to the type '{1}'.
sr: Невозможно преобразовать значение '{0}' в тип '{1}'.

# DesignerActionPanel_CouldNotFindMethod
source: Could not find method '{0}'.
sr: Невозможно найти метод {0}.

# DesignerActionPanel_CouldNotFindProperty
source: Could not find property '{0}' on '{1}'.
sr: Невозможно найти свойство {0} в '{1}'.

# DesignerActionPanel_DefaultPanelTitle
source: {0} Tasks
sr: {0} Задачи

# DesignerActionPanel_ErrorActivatingDropDown
source: Error using the dropdown: {0}
sr: Ошибка при использовании раскрывающегося списка: {0}

# DesignerActionPanel_ErrorInvokingAction
source: Error invoking '{0}'. Details: {1}
sr: Ошибка при вызове '{0}'. Подробно: {1}

# DesignerActionPanel_ErrorSettingValue
source: Error setting value '{0}' to property '{1}'. Details: {2}
sr: Ошибка при установке значения '{0}' для свойства '{1}'. Подробно: {2}

# DesignerBatchCreateTool
source: Creating components in tool '{0}'
sr: Создаются компоненты в инструменте '{0}'

# DesignerBeginDragNotCalled
source: Call to BeginDrag must succeed before calling drag functions.
sr: Перед вызовом функций перетаскивания необходимо, чтобы успешно завершился вызов функции BeginDrag.

# DesignerCantParentType
source: Cannot add component of type '{0}' to container of type '{1}'
sr: Невозможно добавить компонент типа '{0}' в контейнер типа '{1}'

# DesignerInherited
source: Inherited control
sr: Унаследованный элемент управления

# DesignerInheritedReadOnly
source: Inherited control (Private)
sr: Унаследованный элемент управления (Частный)

# DesignSurfaceContainerDispose
source: The container cannot be disposed at design time.
sr: Контейнер не может быть освобожден во время конструирования.

# DesignSurfaceDesignerNotLoaded
source: Cannot create a view for this design surface because the designer is not loaded.
sr: Не удается создать представление для этой плоскости конструирования, так как конструктор не загружен.

# DesignSurfaceFatalError
source: An error occurred while loading the document. Fix the error, and then try loading the document again. The error message follows: {0}
sr: Ошибка при загрузке документа. Исправьте ошибку и повторите загрузку. Сообщение об ошибке: {0}

# DesignSurfaceNoRootComponent
source: The designer loader did not provide a root component but has not indicated why.
sr: Загрузчик конструктора не предоставил корневой компонент и не указал причину.

# DesignSurfaceNoSupportedTechnology
source: The designer loaded, but it does not offer a view compatible with this design surface.
sr: Конструктор загружен, но не предлагает представления для этой плоскости конструирования.

# DesignSurfaceServiceIsFixed
source: The service {0} cannot be removed from the service container.
sr: Служба {0} не может быть удалена из контейнера служб.
