Repository: dotnet/winforms
Catalog: src/System.Windows.Forms.Design/src/Resources/xlf/*.*.xlf
Languages: sr

# DesignerHostCantDestroyInheritedComponent
source: Cannot remove or destroy inherited component '{0}'.
sr: Невозможно удалить или уничтожить унаследованный компонент '{0}'.

# DesignerHostCyclicAdd
source: Cannot add an instance of {0} to the designer because it would create a circular dependency. Make sure that the type does not have the same namespace and type name as the root component {1}.
sr: Невозможно добавить экземпляр {0} в конструктор, так как это приведет к созданию циклической зависимости. Убедитесь в том, что пространство имен и имя этого типа отличаются от заданных для корневого компонента {1}.

# DesignerHostDesignerNeedsComponent
source: Failure initializing the designer. It has no Component member.
sr: Сбой при инициализации конструктора. Он не имеет члена Component.

# DesignerHostDestroyComponentTransaction
source: Deleting '{0}'.
sr: Удаление "{0}".

# DesignerHostDuplicateName
source: The name {0} is already in use by another component.
sr: Имя {0} уже используется другим компонентом.

# DesignerHostFailedComponentCreate
source: Component of type {0} could not be created. Make sure the type implements IComponent and provides an appropriate public constructor. Appropriate constructors either take no parameters or take a single IContainer parameter.
sr: Невозможно создать компонент типа {0}. Убедитесь в том, что этот тип реализует IComponent и предоставляет соответствующий общий конструктор. Соответствующие конструкторы вообще не принимают параметров или принимают один параметр IContainer.

# DesignerHostGenericTransactionName
source: No Description Available
sr: Описание недоступно

# DesignerHostLoaderSpecified
source: A designer loader has already been configured for this design surface.
sr: Загрузчик конструктора уже настроен для этой плоскости проектирования.

# DesignerHostNestedTransaction
source: The designer transaction '{0}' cannot be committed or canceled because nested transaction '{1}' is still active. Commit or cancel the nested transaction first.
sr: Транзакция конструктора '{0}' не может быть завершена или отменена, так как вложенная транзакция '{1}' все еще выполняется. Сначала необходимо завершить или отменить вложенную транзакцию.

# DesignerHostNoBaseClass
source: Cannot open a designer for the file because the class within it does not inherit from a class that can be visually designed.
sr: Не удается открыть конструктор для файла, так как входящий в него класс не наследует от класса, который можно проектировать в графическом представлении.

# DesignerHostNoTopLevelDesigner
source: There is no designer for the class {0}.
sr: Нет конструктора для класса {0}.

# DesignerHostUnloading
source: New components cannot be added while a designer is unloading.
sr: Добавление новых компонентов во время выгрузки конструктора невозможно.

# DesignerOptions_CodeGenDisplay
source: Optimized Code Generation
sr: Создание оптимизированного кода

# DesignerOptions_CodeGenSettings
source: Code Generation Settings
sr: Настройки создания кода

# DesignerOptions_EnableInSituEditingCat
source: InSitu Editing
sr: Правка InSitu

# DesignerOptions_EnableInSituEditingDesc
source: Controls whether InSitu editing is enabled.
sr: Определяет, включена ли правка InSitu.

# DesignerOptions_EnableInSituEditingDisplay
source: Enable InSitu Editing
sr: Включить правку InSitu

# DesignerOptions_GridSizeDesc
source: Sets the default X and Y grid setting on designers when LayoutMode = SnapToGrid.
sr: Задает настройки сетки X и Y по умолчанию для конструкторов, если LayoutMode = SnapToGrid.

# DesignerOptions_GridSizeDisplayName
source: Default Grid Cell Size
sr: Размер ячейки таблицы по умолчанию

# DesignerOptions_LayoutSettings
source: Layout Settings
sr: Параметры макета

# DesignerOptions_ObjectBoundSmartTagAutoShow
source: Controls whether designer smart tag windows should be shown by default.
sr: Определяет, будут ли по умолчанию отображаться окна смарт-тегов конструктора.

# DesignerOptions_ObjectBoundSmartTagAutoShowDisplayName
source: Automatically Open Smart Tags
sr: Автоматически открывать смарт-теги

# DesignerOptions_ObjectBoundSmartTagSettings
source: Object Bound Smart Tag Settings
sr: Настройки смарт-тегов, привязанных к объектам

# DesignerOptions_OptimizedCodeGen
source: Enabled optimized code generation. Some controls may not be compatible with this mode. For this change to take effect, Visual Studio must be closed and re-opened.
sr: Включено создание оптимизированного кода. Некоторые элементы управления могут быть несовместимы с этим режимом. Чтобы это изменение вступило в силу, необходимо закрыть и снова открыть Visual Studio.

# DesignerOptions_ShowGridDesc
source: Controls whether designers should display a sizing grid when LayoutMode = SnapToGrid.
sr: Определяет, будут ли конструкторы отображать сетку размера, если LayoutMode = SnapToGrid.

# DesignerOptions_ShowGridDisplayName
source: Show Grid
sr: Показать сетку

# DesignerOptions_SnapToGridDesc
source: Controls whether designers should snap to grid dots when LayoutMode = SnapToGrid.
sr: Определяет, будут ли конструкторы выполнять выравнивание по сетке, если LayoutMode = SnapToGrid.

# DesignerOptions_SnapToGridDisplayName
source: Snap to Grid
sr: Привязать к сетке

# DesignerOptions_UseSmartTags
source: Controls whether designers should show smart tag popup windows.
sr: Определяет, будут ли конструкторы отображать всплывающие окна смарт-тегов.

# DesignerOptions_UseSnapLines
source: Controls whether designers should use snap lines. If true, snap lines will be used as guides. If false, grid lines will be used.
sr: Определяет, будут ли конструкторы использовать линии выравнивания. Если задано значение true, линии выравнивания используются в качестве направляющих. В случае false используются линии сетки.

# DesignerPropName
source: Indicates the name used in code to identify the object.
sr: Указывает имя, используемое в коде для идентификации объекта.

# DesignerShortcutDockInForm
source: Dock Fill in Form
sr: Заполнение дока в форме

# DesignerShortcutDockInParent
source: Dock in Parent Container
sr: Закрепить в родительском контейнере

# DesignerShortcutDockInUserControl
source: Dock Fill in UserControl
sr: Заполнение дока в UserControl

# DesignerShortcutHorizontalOrientation
source: Horizontal Splitter Orientation.
sr: Горизонтальная ориентация разделителя

# DesignerShortcutReparentControls
source: Re-parent Controls
sr: Повторно указать родителей для элементов управления

# DesignerShortcutUndockInParent
source: Undock in Parent Container
sr: Открепить в родительском контейнере

# DesignerShortcutVerticalOrientation
source: Vertical Splitter Orientation.
sr: Вертикальная ориентация разделителя

# DockEditorAccName
source: Dock Picker
sr: Выбор дока

# DockEditorBottomAccName
source: Bottom
sr: Снизу

# DockEditorFillAccName
source: Fill
sr: Заполнение

# DockEditorLeftAccName
source: Left
sr: Слева

# DockEditorNoneAccName
source: None
sr: Отсутствует

# DockEditorRightAccName
source: Right
sr: Справа

# DockEditorTopAccName
source: Top
sr: Сверху

# DotNET_ComponentType
source: .NET Component
sr: Компонент .NET

# DragDropDragComponents
source: Drag {0} components
sr: Перетащить {0} компонентов

# DragDropDropComponents
source: Drop components
sr: Отпустить компоненты

# DragDropMoveComponent
source: Move {0}
sr: Переместить {0}

# DragDropMoveComponents
source: Move {0} components
sr: Переместить {0} компонентов

# DragDropSetDataError
source: This IDataObject doesn't support SetData.
sr: Этот объект IDataObject не поддерживает SetData.

# DragDropSizeComponent
source: Size {0}
sr: Изменить размер {0}

# DragDropSizeComponents
source: Size {0} components
sr: Изменить размер {0} компонентов

# EditLinesDescription
source: Opens the Lines collection editor
sr: Открывает редактор коллекции строк

# EditLinesDisplayName
source: Edit Text Lines...
sr: Изменить текстовые строки…

# EventBindingServiceBadArgType
source: The event {0} expects an argument type of {1}.
sr: Событие {0} ожидает тип аргумента {1}.

# EventBindingServiceEventReadOnly
source: The event {0} is read-only and cannot be changed.
sr: Событие {0} доступно только для чтения и не может быть изменено.

# EventBindingServiceMissingService
source: The service {0} is required but could not be found. If you have removed this service ensure that you provide a replacement.
sr: Требуется служба {0}, но она не найдена. Если вы перенесли эту службу, убедитесь в том, что обеспечили замену.

# EventBindingServiceNoSite
source: Events cannot be set on the object passed to the event binding service because a site associated with the object could not be located.
sr: Невозможно установить события для объекта, переданного в службу привязки событий, так как сайт, связанный с объектом, не найден.

# EventBindingServiceSetValue
source: Set {0}.{1} event
sr: Задать {0}.{1} событие

# ExceptionCollectionInvalidArgument
source: Argument must only contain objects of type '{0}'.
sr: Аргумент должен содержать только объекты типа "{0}".

# ExtenderProviderServiceDuplicateProvider
source: The extender provider {0} has already been added as an extender. Adding another would result in duplicate properties.
sr: Поставщик расширений {0} уже добавлен в качестве расширения. Добавление другого поставщика приведет к появлению повторяющихся свойств.

# FailedToCreateComponent
source: Failed to create component '{0}'. The error message follows:\r\n '{1}'
sr: Не удалось создать компонент "{0}". Сообщение об ошибке:\r\n "{1}"

# FormatStringDialogTitle
source: Format String Dialog
sr: Диалог формата строки

# GenericFileFilter
source: All Files(*.*)|*.*
sr: Все файлы(*.*)|*.*

# GenericOpenFile
source: Open File
sr: Открыть файл

# HelpProviderEditorFilter
source: All Help Files(*.chm,*.col,*.htm,*.html)|*.chm;*.col;*.htm;*.html|Compressed HTML Files(*.chm)|*.chm|Help Collection Files(*.col)|*.col|HTML Files(*.htm,*.html)|*.htm;*.html|All Files(*.*)|*.*
sr: Все файлы справки(*.chm,*.col,*.htm,*.html)|*.chm;*.col;*.htm;*.html|Сжатые файлы HTML(*.chm)|*.chm|Файлы коллекции справки(*.col)|*.col|Файлы HTML(*.htm,*.html)|*.htm;*.html|Все файлы(*.*)|*.*

# HelpProviderEditorTitle
source: Open Help File
sr: Открыть файл справки

# ImageCollectionEditorFormText
source: Images Collection Editor
sr: Редактор коллекции изображений

# ImageListActionList_ChooseImagesDescription
source: Opens the Images collection editor
sr: Открывает редактор коллекции изображений

# ImageListActionList_ChooseImagesDisplayName
source: Choose images
sr: Выберите изображения

# ImageListActionList_ColorDepthDescription
source: Changes the bit depth images imported into this ImageList are stored at
sr: Меняет разрядность, в которой хранятся изображения, импортированные в этот ImageList

# ImageListActionList_ColorDepthDisplayName
source: Image Bit Depth
sr: Разрядность изображения

# ImageListActionList_ImageSizeDescription
source: Changes the size images imported into this ImageList are stored at
sr: Меняет размер, в котором хранятся изображения, импортированные в этот ImageList

# ImageListActionList_ImageSizeDisplayName
source: Image Size
sr: Размер изображения

# ImageListDescription
source: Chooses an ImageList to use with this TreeView
sr: Выбирает ImageList для использования с этим TreeView

# ImageListDisplayName
source: ImageList:
sr: Список изображений:

# InheritanceServiceReadOnlyCollection
source: Read-Only
sr: Только для чтения

# InitialDirectoryEditorLabel
source: Select the directory that will initially be opened in the dialog.
sr: Выберите каталог, который будет изначально открываться в диалоговом окне.

# InvalidArgument
source: '{1}' is not a valid value for '{0}'.
sr: '{1}' не является допустимым значением для '{0}'.

# InvalidBoundArgument
source: '{1}' is not a valid value for '{0}'. '{0}' should be between {2} and {3}.
sr: '{1}' не является допустимым значением для '{0}'. Значение '{0}' должно лежать в диапазоне от {2} до {3}.

# InvalidIdentifier
source: Identifier '{0}' is not valid.
sr: Недопустимый идентификатор "{0}".

# InvokeNodesDialogDescription
source: Opens the Nodes collection editor
sr: Открывает редактор коллекции узлов

# InvokeNodesDialogDisplayName
source: Edit Nodes...
sr: Изменить узлы…

# ItemsCategoryName
source: Items
sr: Элементы

# LinkAreaEditorCancel
source: Cancel
sr: Отмена

# LinkAreaEditorCaption
source: LinkArea Editor
sr: Редактор LinkArea

# LinkAreaEditorDescription
source: Select a &range of text to make your link:
sr: &Выберите часть текста для преобразов. в ссылку:

# LinkAreaEditorOK
source: OK
sr: ОК

# LinksCategoryName
source: Links
sr: Ссылки

# ListControlUnboundActionListEditItemsDescription
source: Opens the Items collection editor
sr: Открывает редактор коллекции элементов

# ListControlUnboundActionListEditItemsDisplayName
source: Edit Items...
sr: Изменить элементы…

# ListViewActionListEditColumnsDescription
source: Opens the Columns collection editor
sr: Открывает редактор коллекции столбцов

# ListViewActionListEditColumnsDisplayName
source: Edit Columns...
sr: Изменить столбцы…

# ListViewActionListEditGroupsDescription
source: Opens the Groups collection editor
sr: Открывает редактор коллекции групп

# ListViewActionListEditGroupsDisplayName
source: Edit Groups...
sr: Изменить группы…

# ListViewActionListEditItemsDescription
source: Opens the Items collection editor
sr: Открывает редактор коллекции элементов

# ListViewActionListEditItemsDisplayName
source: Edit Items...
sr: Изменить элементы…

# ListViewActionListLargeImagesDescription
source: Selects an ImageList to use with LargeIcon mode
sr: Выбирает список ImageList для использования с режимом LargeIcon

# ListViewActionListLargeImagesDisplayName
source: Large ImageList:
sr: Список крупных изображений:

# ListViewActionListSmallImagesDescription
source: Selects an ImageList to use with SmallIcon mode
sr: Выбирает список ImageList для использования с режимом SmallIcon

# ListViewActionListSmallImagesDisplayName
source: Small ImageList:
sr: Список малых изображений:

# ListViewActionListViewDescription
source: Changes the type of View this ListView shows
sr: Меняет тип представления, отображаемого этим ListView

# ListViewActionListViewDisplayName
source: View:
sr: Вид:

# LocalizationProviderManualReload
source: You must close and re-open the designer for this change to take effect.
sr: Чтобы изменения начали действовать, необходимо закрыть и вновь открыть конструктор.

# LocalizationProviderMissingService
source: The service {0} is required but could not be found. If you have removed this service ensure that you provide a replacement.
sr: Требуется служба {0}, но она не найдена. Если вы перенесли эту службу, убедитесь в том, что обеспечили замену.

# LocalizingCannotAdd
source: Components cannot be added in localization mode. Select (Default) in the Language property to return to the default form and add components.
sr: Компоненты нельзя добавлять в режиме локализации. Чтобы вернуться в форму по умолчанию и добавить компоненты, выберите значение "По умолчанию" в свойстве "Язык".

# MaskDescriptorNotMaskFullErrorMsg
source: Mask is not full.
sr: Маска не полная.

# MaskDescriptorNull
source: The provided MaskDescriptor is null.
sr: Предоставленный MaskDescriptor равен null.

# MaskDescriptorNullOrEmptyRequiredProperty
source: One or more required properties are null or empty.
sr: Одно или несколько обязательных свойств пусты или равны null.

# MaskDescriptorValidatingTypeNone
source: (none)
sr: (нет)

# MaskDesignerDialogCustomEntry
source: <Custom>
sr: <Специальный>

# MaskDesignerDialogDataFormat
source: Data Format
sr: Формат данных

# MaskDesignerDialogDlgCaption
source: Input Mask
sr: Маска ввода

# MaskDesignerDialogMaskDescription
source: Mask Description
sr: Описание маски

# MaskDesignerDialogValidatingType
source: Validating Type
sr: Проверка типа

# MaskedTextBoxDesignerVerbsSetMaskDesc
source: Set Mask...
sr: Установка маски...

# MaskedTextBoxHintAlphanumericCharacterExpected
source: Alphanumeric character expected
sr: Ожидается алфавитно-цифровой символ

# MaskedTextBoxHintAsciiCharacterExpected
source: ASCII character expected
sr: Ожидается символ ASCII

# MaskedTextBoxHintDigitExpected
source: Digit expected
sr: Ожидается цифра

# MaskedTextBoxHintInvalidInput
source: Invalid input character
sr: Недействительный входной символ

# MaskedTextBoxHintLetterExpected
source: Letter expected
sr: Ожидается буква

# MaskedTextBoxHintNonEditPosition
source: Non edit position
sr: Неизменяемое положение

# MaskedTextBoxHintPositionOutOfRange
source: Position out of range
sr: Положение вне диапазона

# MaskedTextBoxHintPromptCharNotAllowed
source: Prompt character disallowed as input
sr: Нельзя использовать на входе символ приглашения к вводу

# MaskedTextBoxHintSignedDigitExpected
source: Signed digit expected
sr: Ожидается десятичное число

# MaskedTextBoxHintUnavailableEditPosition
source: Unavailable edit position
sr: Недоступное положение правки

# MaskedTextBoxTextEditorErrorFormatString
source: Error at position {0}: {1}.
sr: Ошибка в положении {0}: {1}.

# MenuCommandService_DuplicateCommand
source: There is already a command handler for the menu command '{0}'.
sr: Уже существует дескриптор команд для команды меню '{0}'.

# MismatchedResourceName
source: When passing ResXDataNodes as the IDictionary values to StronglyTypedResourceBuilder.Create, the keys must match the corresponding values for ResXDataNode.Name. Key name: '{0}', ResXDataNode.Name: '{1}'.
sr: Когда ResXDataNodes передается в качестве значений IDictionary в StronglyTypedResourceBuilder.Create, ключи должны соответствовать значениям для ResXDataNode.Name. Имя ключа: "{0}", ResXDataNode.Name: "{1}".

# MultiLineDescription
source: Puts the TextBox in a mode where it can display multiple lines of text
sr: Переводит поле TextBox в режим, когда в нем отображается несколько строк текста

# MultiLineDisplayName
source: MultiLine
sr: Многострочный

# MultilineStringEditorWatermark
source: Press Enter to begin a new line. Press Ctrl+Enter to accept Text.
sr: Нажмите клавишу ВВОД, чтобы начать новую строку. Нажмите клавиши Ctrl+ВВОД, чтобы принять текст.

# NonStringPropertyComment
source: Looks up a localized resource of type {0}.
sr: Ищет локализованный ресурс типа {0}.

# NonStringPropertyDetailedComment
source: Looks up a localized resource of type {0} similar to {1}.
sr: Ищет локализованный ресурс типа {0}, аналогичного {1}.

source: (None)
sr: (Нет)

# None_lc
source: (none)
sr: (нет)

# NotImplementedByDesign
source: This method/object is not implemented by design.
sr: Этот метод или объект не реализован намеренно.

# ParentControlDesignerGridSizeDescr
source: Determines the size of the positioning grid.
sr: Определяет размер направляющей сетки.

# ParentControlDesignerLassoShortcutRedo
source: Place existing controls in new container, '{0}'.
sr: Поместить существующие элементы управления в новый контейнер, '{0}'.

# PlatformNotSupported_WinformsDesigner
source: Winforms Designer is not supported on this platform.
sr: Конструктор Windows Forms не поддерживается на этой платформе.

# PropertiesCategoryName
source: Properties
sr: Свойства

# ResMgrPropertyComment
source: Returns the cached ResourceManager instance used by this class.
sr: Возвращает кэшированный экземпляр ResourceManager, использованный этим классом.

# SelectedPathEditorLabel
source: Select the path to the folder that will initially be selected in the FolderBrowserDialog.
sr: Выберите путь к папке, которая изначально будет выбираться в FolderBrowserDialog.

# SerializationManagerAlreadyInSession
source: You cannot create a new session because this serialization manager already has an active serialization session.
sr: Вы не можете создать новый сеанс, так как у этого диспетчера сериализации уже есть активный сеанс сериализации.

# SerializationManagerDuplicateComponentDecl
source: Duplicate declaration of member '{0}'
sr: Повторяющееся объявление члена '{0}'

# SerializationManagerNameInUse
source: The name '{0}' is already used by another object.
sr: Имя '{0}' уже используется другим объектом.

# SerializationManagerNoMatchingCtor
source: Type '{0}' does not have a constructor with parameters of types {1}.
sr: Тип '{0}' не имеет конструктора с параметрами типов {1}.

# SerializationManagerNoSession
source: This method cannot be invoked because the serialization manager does not have an active serialization session.
sr: Вызов метода невозможен, так как у диспетчера сериализации есть активный сеанс сериализации.

# SerializationManagerObjectHasName
source: Cannot name the object '{0}' because it is already named '{1}'.
sr: Невозможно присвоить имя объекту '{0}', так как он уже имеет имя '{1}'.

# SerializationManagerWithinSession
source: This method cannot be invoked because the serialization manager has an active serialization session.
sr: Вызов метода невозможен, так как у диспетчера сериализации есть активный сеанс сериализации.

# SerializerBadElementTypes
source: Elements of type {0} are not supported. The serializer expects the element to be one of the following: {1}.
sr: Элементы типа {0} не поддерживаются. Сериализатор ожидает один из следующих элементов: {1}.

# SerializerFieldTargetEvalFailed
source: The field '{0}' could not be found on the target object. Make sure that the field is defined as an instance variable on the target object and has the correct scope.
sr: Невозможно найти поле '{0}' в целевом объекте. Убедитесь в том, что это поле определено как переменная экземпляра для целевого объекта и имеет правильный контекст.

# SerializerInvalidArrayRank
source: Array rank '{0}' is too high. Visual Studio can only save and load arrays with a rank of 1.
sr: Ранг массива '{0}' слишком велик. Visual Studio позволяет сохранять и загружать массивы только ранга 1.

# SerializerLostStatements
source: Code statements for the object '{0}' were lost during serialization. This may have been a result of another object misbehaving during serialization.
sr: Операторы кода для объекта '{0}' потеряны во время сериализации. Это могло произойти из-за неправильного поведения другого объекта во время сериализации.

# SerializerMemberTypeNotSerializable
source: Members of type '{0}' cannot be serialized.
sr: Члены типа '{0}' невозможно сериализовать.

# SerializerNoRootExpression
source: The source code contains a reference to the class definition, but the class definition cannot be found.
sr: Код источника содержит ссылку на определение класса, но определение класса не найдено.

# SerializerNoSerializerForComponent
source: The object '{0}' failed to serialize itself. It may not support code generation.
sr: Объекту '{0}' не удалось сериализоваться. Возможно, он не поддерживает создание кода.

# SerializerNoSuchEvent
source: The type '{0}' has no event named '{1}'.
sr: Тип '{0}' не содержит события с именем '{1}'.

# SerializerNoSuchField
source: The type '{0}' has no field named '{1}'.
sr: Тип '{0}' не содержит поля с именем '{1}'.

# SerializerNoSuchProperty
source: The type '{0}' has no property named '{1}'.
sr: Тип '{0}' не содержит свойства с именем '{1}'.

# SerializerNullNestedProperty
source: The object '{0}' returned null for the property '{1}' but this is not allowed.
sr: Объект '{0}' вернул для свойства '{1}' значение NULL, что не допускается.

# SerializerPropertyGenFailed
source: Code generation for property '{0}' failed. Error was: '{1}'
sr: Ошибка при генерации кода для свойства "{0}". Произошла следующая ошибка: '{1}'

# SerializerResourceException
source: Error reading resources from the resource file for the culture {0}: {1}
sr: Ошибка чтения ресурсов из файла ресурсов для культуры {0}: {1}
