Repository: dotnet/winforms
Catalog: src/Microsoft.VisualBasic.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# AppModel_NoStartupForm
source: A startup form has not been specified.
sr: Formularz początkowy nie został określony.

# AppModel_SingleInstanceCantConnect
source: This single-instance application could not connect to the original instance.
sr: To pojedyncze wystąpienie aplikacji nie może połączyć się z wystąpieniem oryginalnym.

# AppModel_SplashAndMainFormTheSame
source: Splash screen and main form cannot be the same form.
sr: Ekran powitalny i ekran główny nie mogą być tym samym formularzem.

# ApplicationLogBaseNameNull
source: BaseFileName cannot be Nothing or an empty String.
sr: Parametr BaseFileName nie może mieć wartości Nothing ani nie może być pustym ciągiem.

# ApplicationLogNumberTooSmall
source: The value of {0} must be greater than or equal to 1000.
sr: Wartość {0} musi być większa lub równa 1000.

# ApplicationLog_ExhaustedPossibleStreamNames
source: Unable to obtain a stream for the log. Potential file names based on {0} are already in use.
sr: Nie można uzyskać strumienia dla dziennika. Potencjalne nazwy plików oparte na {0} są już używane.

# ApplicationLog_FileExceedsMaximumSize
source: Unable to write to log file because writing to it would cause it to exceed the MaxFileSize value.
sr: Nie można zapisać w pliku dziennika, ponieważ zapisanie może spowodować przekroczenie wartości MaxFileSize.

# ApplicationLog_FreeSpaceError
source: Cannot determine the amount of available disk space.
sr: Nie można określić ilości dostępnego miejsca na dysku.

# ApplicationLog_NegativeNumber
source: The value of {0} must be a positive number.
sr: Wartość {0} musi być liczbą dodatnią.

# ApplicationLog_ReservedSpaceEncroached
source: Unable to write to log file because writing to it would reduce free disk space below ReservedSpace value.
sr: Nie można zapisać w pliku dziennika, ponieważ zapisanie może spowodować zmniejszenie ilości wolnego miejsca na dysku poniżej wartości ReservedSpace.

# Argument_InvalidNullValue1
source: Argument '{0}' is Nothing.
sr: Argument '{0}' ma wartość Nothing.

# Argument_InvalidValue1
source: Argument '{0}' is not a valid value.
sr: Argument '{0}' nie ma prawidłowej wartości.

# Argument_InvalidValueType2
source: Argument '{0}' cannot be converted to type '{1}'.
sr: Nie można przekonwertować argumentu '{0}' na typ '{1}'.

# DiagnosticInfo_FullOSName
source: Could not obtain full operation system name due to internal error. This might be caused by WMI not existing on the current machine.
sr: Nie można uzyskać pełnej nazwy systemu operacyjnego z powodu błędu wewnętrznego. Przyczyną może być interfejs WMI nie istniejący na bieżącym komputerze.

# DiagnosticInfo_Memory
source: Could not obtain memory information due to internal error.
sr: Nie można uzyskać informacji o pamięci z powodu błędu wewnętrznego.

# EnvVarNotFound_Name
source: Environment variable is not defined: '{0}'.
sr: Zmienna środowiskowa nie została zdefiniowana: '{0}'.

# General_ArgumentNullException
source: Argument cannot be Nothing.
sr: Argument nie może mieć wartości Nothing.

# General_PropertyNothing
source: Property {0} cannot be set to Nothing.
sr: Właściwość {0} nie może być ustawiona na wartość Nothing.

# ID53
source: File not found.
sr: Nie znaleziono pliku.

# ID70
source: Permission denied.
sr: Odmowa uprawnień.

# IO_FileExists_Path
source: Could not complete operation since a file already exists in this path '{0}'.
sr: Nie można wykonać operacji, ponieważ plik już istnieje w tej ścieżce '{0}'.

# IO_FileNotFound_Path
source: Could not find file '{0}'.
sr: Nie można odnaleźć pliku '{0}'.

# IO_FilePathException
source: The given file path ends with a directory separator character.
sr: Podana ścieżka pliku kończy się znakiem separatora katalogu.

# Mouse_NoMouseIsPresent
source: No mouse is present.
sr: Nie ma myszy.

# Mouse_NoWheelIsPresent
source: No mouse wheel is present.
sr: Nie ma kółka myszy.

# Network_BadConnectionTimeout
source: The ConnectionTimeout must be greater than 0.
sr: Wartość parametru ConnectionTimeout musi być większa niż 0.

# Network_DownloadNeedsFilename
source: destinationFileName needs to include a file name.
sr: Parametr destinationFileName musi zawierać nazwę pliku.

# Network_InvalidUriString
source: '{0}' is not a valid remote file address. A valid address should include a protocol, a path and a file name.
sr: '{0}' nie jest prawidłowym adresem pliku zdalnego. prawidłowy adres powinien zawierać protokół, ścieżkę i nazwę pliku.

# Network_NetworkNotAvailable
source: Unable to ping because a network connection is not available.
sr: Nie można użyć polecenia ping, ponieważ połączenie sieciowe jest niedostępne.

# Network_UploadAddressNeedsFilename
source: The address for UploadFile needs to include a file name.
sr: Adres parametru UploadFile musi zawierać nazwę pliku.

# ProcessNotFound
source: Process '{0}' was not found.
sr: Nie można odnaleźć procesu '{0}'.

# ProgressDialogDownloadingLabel
source: Downloading {0} to {1}
sr: Pobieranie {0} do {1}

# ProgressDialogDownloadingTitle
source: Downloading {0}
sr: Pobieranie {0}

# ProgressDialogUploadingLabel
source: Uploading {0} to {1}
sr: Przekazywanie {0} do {1}

# ProgressDialogUploadingTitle
source: Uploading {0}
sr: Przekazywanie: {0}
