Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# DescriptionTreeView
source: Displays a hierarchical collection of labeled items to the user that optionally contain an image.
sr: Показывает пользователю иерархическую коллекцию помеченных объектов, которые могут содержать изображение.

# DescriptionVScrollBar
source: Enables its parent component to scroll content vertically. Unnecessary if the parent has an autoscroll attribute, and the attribute is enabled.
sr: Включает вертикальную прокрутку содержимого родительского компонента. Не требуется, если родительский компонент имеет атрибут автоматической прокрутки и этот атрибут включен.

# DescriptionWebBrowser
source: Enables the user to browse Web pages inside your form.
sr: Позволяет пользователю просматривать веб-страницы внутри формы.

# DispInvokeFailed
source: Operation {0} on the component did not succeed, generating the error code 0x{1:X}.
sr: Невозможно выполнить операцию {0} для компонента; генерируется код ошибки 0x{1:X}.

# DomainUpDownItemsDescr
source: The allowable values of the DomainUpDown.
sr: Допустимые значения для DomainUpDown.

# DomainUpDownOnSelectedItemChangedDescr
source: Occurs when the selected item in the control changes.
sr: Происходит при изменении выбранного элемента в элементе управления.

# DomainUpDownSelectedIndexDescr
source: The index of the selected domain value.
sr: Индекс значения выбранной зоны.

# DomainUpDownSelectedItemDescr
source: The currently selected domain value.
sr: Значение текущей выбранной зоны.

# DomainUpDownSortedDescr
source: Controls whether items in the domain list are sorted.
sr: Определяет, отсортированы ли элементы в списке зон.

# DomainUpDownWrapDescr
source: Indicates whether values wrap around at either end of the item list.
sr: Указывает, происходит ли прокрутка значений списка элементов от начала до конца по замкнутому циклу.

# DragDropRegFailed
source: DragDrop registration did not succeed.
sr: Регистрация DragDrop невозможна.

# ErrorBadInputLanguage
source: inputLanguage is not recognized by the system.
sr: inputLanguage не распознан системой.

# ErrorCollectionFull
source: Collection has reached its maximum capacity.
sr: Коллекция достигла своего максимального размера.

# ErrorCreatingHandle
source: Error creating window handle.
sr: Ошибка при создании дескриптора окна.

# ErrorNoMarshalingThread
source: Invoke or BeginInvoke cannot be called on a control until the window handle has been created.
sr: Невозможно вызвать Invoke или BeginInvoke для элемента управления до завершения создания дескриптора окна.

# ErrorPropertyPageFailed
source: Component did not succeed to show the property page.
sr: Компоненту не удалось отобразить страницу свойств.

# ErrorProviderBlinkRateDescr
source: The rate in milliseconds at which the error icon blinks.
sr: Период мигания значка ошибки (в миллисекундах).

# ErrorProviderBlinkStyleDescr
source: Controls whether the error icon blinks when an error is set.
sr: Определяет, мигает ли значок ошибки при наличии ошибки.

# ErrorProviderContainerControlDescr
source: The parent control, usually the form, that contains the data-bound controls on which the ErrorProvider can display error icons.
sr: Родительский элемент управления (как правило, форма), содержащий привязанные к данным элементы управления, для которых ErrorProvider может отображать значки ошибки.

# ErrorProviderDataMemberDescr
source: Indicates the sub-list of data from the DataSource to bind errors against.
sr: Указывает подсписок данных из DataSource для привязки к ним ошибок.

# ErrorProviderDataSourceDescr
source: Indicates the source of data to bind errors against.
sr: Указывает источник данных для привязки к ним ошибок.

# ErrorProviderErrorDescr
source: The error description for a control.
sr: Описание ошибок для элементов управления.

# ErrorProviderIconAlignmentDescr
source: The location of the error icon relative to the control.
sr: Местоположение значка ошибки относительно данного элемента управления.

# ErrorProviderIconDescr
source: The icon used to indicate an error.
sr: Значок для сигнализации об ошибке.

# ErrorProviderIconPaddingDescr
source: The number of pixels to leave between the error icon and the control.
sr: Количество пикселей между значком ошибки и данным элементом управления.

# ErrorSettingWindowRegion
source: Error occurred while trying to set the window region for the MDI client.
sr: Ошибка при попытке задать область окна для клиента MDI.

# ErrorTypeConverterFailed
source: Component did not succeed to show the editor.
sr: Компоненту не удалось отобразить редактор.

# ExDlgCancel
source: Cancel
sr: Отмена

# ExDlgContinue
source: &Continue
sr: Продол&жить

# ExDlgContinueErrorText
source: Unhandled exception has occurred in a component in your application. If you click Continue, the application will ignore this error and attempt to continue. {0}.
sr: Необрабатываемое исключение в компоненте приложения. При нажатии кнопки "Продолжить" приложение проигнорирует ошибку и попытается продолжить работу. {0}.

# ExDlgDetailsText
source: Error Text
sr: Текст ошибки

# ExDlgErrorText
source: Unhandled exception has occurred in your application. If you click Continue, the application will ignore this error and attempt to continue. If you click Quit, the application will close immediately. {0}.
sr: Необрабатываемое исключение в приложении. При нажатии кнопки "Продолжить" приложение проигнорирует ошибку и попытается продолжить работу. При нажатии кнопки "Выход" приложение немедленно завершит работу. {0}.

# ExDlgHelp
source: &Help
sr: &Справка

# ExDlgMsgExceptionSection
source: Exception Text
sr: Текст исключения

# ExDlgMsgFooterNonSwitchable
source: Application does not support Windows Forms just-in-time (JIT) debugging. Contact the application author for more information.
sr: Приложение не поддерживает оперативную (JIT) отладку Windows Forms. Для получения дополнительной информации свяжитесь с разработчиком приложения.

# ExDlgMsgHeaderNonSwitchable
source: Application does not support just-in-time (JIT) debugging. See the end of this message for details.
sr: Приложение не поддерживает оперативную (JIT) отладку. Подробная информацию приводится в конце данного сообщения.

# ExDlgMsgHeaderSwitchable
source: See the end of this message for details on invoking just-in-time (JIT) debugging instead of this dialog box.
sr: Подробная информация об использовании оперативной (JIT) отладки вместо данного диалогового окна содержится в конце этого сообщения.

# ExDlgMsgJITDebuggingSection
source: JIT Debugging
sr: Оперативная отладка (JIT)

# ExDlgMsgLoadedAssembliesEntry
source: {0} Assembly Version: {1} Win32 Version: {2} CodeBase: {3}
sr: {0} Версия сборки: {1} Версия Win32: {2} CodeBase: {3}

# ExDlgMsgLoadedAssembliesSection
source: Loaded Assemblies
sr: Загруженные сборки

# ExDlgQuit
source: &Quit
sr: В&ыход

# ExDlgSecurityContinueErrorText
source: Application attempted to perform an operation not allowed by the security policy. To grant this application the required permission, contact your system administrator, or use the Microsoft .NET Configuration tool. If you click Continue, the application will ignore this error and attempt to continue. {1}.
sr: Приложение попыталось выполнить операцию, недопустимую в соответствии с используемой политикой безопасности. Для выдачи соответствующего разрешения данному приложению обратитесь к системному администратору или используйте конфигуратор Microsoft .NET. При нажатии кнопки "Продолжить" приложение проигнорирует ошибку и попытается продолжить работу. {1}.

# ExDlgSecurityErrorText
source: Application attempted to perform an operation not allowed by the security policy. To grant this application the required permission, contact your system administrator, or use the Microsoft .NET Configuration tool. If you click Continue, the application will ignore this error and attempt to continue. If you click Quit, the application will close immediately. {1}.
sr: Приложение попыталось выполнить операцию, недопустимую в соответствии с использующейся политикой безопасности. Для выдачи соответствующего разрешения данному приложению обратитесь к системному администратору или используйте конфигуратор Microsoft .NET. При нажатии кнопки "Продолжить" приложение проигнорирует ошибку и попытается продолжить работу. При нажатии кнопки "Выход" приложение немедленно завершит работу. {1}.

# ExDlgShowDetails
source: &Details
sr: &Таблица

# ExceptionCreatingCompEditorControl
source: ComponentEditorControl: {0} cannot be created.
sr: Создание ComponentEditorControl: {0} невозможно.

# ExceptionCreatingObject
source: Exception occurred while trying to create an instance of {0}. The exception was "{1}".
sr: Исключение при попытке создания экземпляра {0}. Исключение: "{1}".

source: External exception
sr: Внешнее исключение

# FDFileNamesDescr
source: Retrieves the file names of all selected files in the dialog box.
sr: Считывает имена всех файлов, выбранных в данном диалоговом окне.

# FDaddExtensionDescr
source: Controls whether extensions are automatically added to file names.
sr: Определяет, добавляются ли расширения к именам файлов автоматически.

# FDcheckFileExistsDescr
source: Checks that the specified file exists before returning from the dialog.
sr: Перед возвратом из диалогового окна проверяет, что заданный файл существует.

# FDcheckPathExistsDescr
source: Checks that the specified path exists before returning from the dialog.
sr: Перед возвратом из диалогового окна проверяет, что заданный путь существует.

# FDdefaultExtDescr
source: The default file name extension. If the user types a file name, this extension is added at the end of the file name if one is not specified.
sr: Суффикс для имени файла по умолчанию. При вводе имени файла, если пользователь не задает суффикс, он добавляется в конец имени файла.

# FDdereferenceLinksDescr
source: Controls whether shortcuts are dereferenced before returning from the dialog.
sr: Определяет, отменяются ли клавиши быстрого доступа перед возвратом из данного диалога.

# FDfileNameDescr
source: The file first shown in the dialog box, or the last one selected by the user.
sr: Первый файл, отображаемый в диалоговом окне, или последний файл, выбранный пользователем.

# FDfileOkDescr
source: Occurs when the user clicks the Open or Save button in the dialog box.
sr: Возникает при нажатии кнопки "Открыть" или "Сохранить" в диалоговом окне.

# FDfilterDescr
source: The file filters to display in the dialog box, for example, "C# files|*.cs|All files|*.*".
sr: Фильтры файлов, отображаемые в диалоговом окне, например "C# files|*.cs|Все файлы|*.*".

# FDfilterIndexDescr
source: The index of the file filter selected in the dialog box. The first item has an index of 1.
sr: Индекс фильтра файлов, выбранного в диалоговом окне. Первый элемент имеет индекс 1.

# FDinitialDirDescr
source: The initial directory for the dialog box.
sr: Исходный каталог диалогового окна.

# FDrestoreDirectoryDescr
source: Controls whether the dialog box restores the current directory before closing.
sr: Определяет, восстанавливает ли диалоговое окно текущий каталог перед закрытием.

# FDshowHelpDescr
source: Enables the Help button.
sr: Активирует кнопку 'Справка'.

# FDsupportMultiDottedExtensionsDescr
source: Controls whether multi-dotted extensions are supported.
sr: Определяет, допускаются ли расширения с несколькими точками.

# FDtitleDescr
source: The string to display in the title bar of the dialog box.
sr: Строка, отображаемая в строке заголовка диалогового окна.

# FDvalidateNamesDescr
source: Controls whether the dialog box ensures that file names do not contain invalid characters or sequences.
sr: Определяет, проверяет ли диалоговое окно имена файлов на наличие недопустимых символов или последовательностей.

# FileDialogBufferTooSmall
source: Too many files selected. Select fewer files and try again.
sr: Выбрано слишком много файлов. Выберите меньшее число файлов и повторите попытку.

# FileDialogCreatePrompt
source: File {0} does not exist. Do you want to create it?
sr: Файл {0} не существует. Создать его?

# FileDialogFileNotFound
source: File {0} does not exist. Verify that the correct file name was given.
sr: Файл {0} не существует. Убедитесь в правильности указанного имени файла.

# FileDialogInvalidFileName
source: File {0} is not a valid file name.
sr: Недопустимое имя файла {0}.

# FileDialogInvalidFilter
source: Filter string you provided is not valid. The filter string must contain a description of the filter, followed by the vertical bar (|) and the filter pattern. The strings for different filtering options must also be separated by the vertical bar. Example: "Text files (*.txt)|*.txt|All files (*.*)|*.*"
sr: Указана недопустимая строка фильтра. Строка фильтра должна содержать описание фильтра, за которым следуют вертикальная черта (|) и шаблон фильтра. Строки различных вариантов фильтра также должны разделяться вертикальной чертой. Например: "Текстовые файлы (*.txt)|*.txt|Все файлы (*.*)|*.*"

# FileDialogInvalidFilterIndex
source: Filter index not valid.
sr: Недопустимый индекс фильтра.

# FileDialogOverwritePrompt
source: File {0} already exists. Do you want to replace it?
sr: Файл {0} уже существует. Заменить его?

# FileDialogSubLassFailure
source: Attempt to subclass a list box did not succeed. Not enough memory is available.
sr: Не удалось создать подкласс окна списков. Недостаточно памяти.

# FilterRequiresIBindingListView
source: Can only set filter on an IBindingListView where SupportsFiltering is true.
sr: Фильтр можно задать только для IBindingListView, где SupportsFiltering имеет значение true.

# FindKeyMayNotBeEmptyOrNull
source: Key specified was either empty or null.
sr: Указанный ключ пуст либо имеет пустое значение.

# FlowPanelFlowDirectionDescr
source: Specifies the direction in which controls are laid out.
sr: Определяет ориентацию макета элементов управления.

# FlowPanelWrapContentsDescr
source: Indicates whether contents are wrapped or clipped at the control boundary.
sr: Указывает, переносится или обрезается содержимое у границы элемента управления.

# FnDallowScriptChangeDescr
source: Controls whether the character set of the font can be changed.
sr: Определяет, может ли изменяться кодовая страница для данного шрифта.

# FnDallowSimulationsDescr
source: Controls whether GDI font simulations are allowed.
sr: Определяет, разрешена ли имитация шрифта GDI.

# FnDallowVectorFontsDescr
source: Controls whether vector fonts can be selected.
sr: Определяет, возможен ли выбор векторных шрифтов.

# FnDallowVerticalFontsDescr
source: Controls whether vertical fonts can be selected.
sr: Определяет, возможен ли выбор вертикальных шрифтов.

# FnDapplyDescr
source: Occurs when the user clicks the Apply button.
sr: Происходит при нажатии пользователем кнопки 'Применить'.

# FnDcolorDescr
source: The color selected in the dialog box.
sr: Цвет, выбранный в диалоговом окне.

# FnDfixedPitchOnlyDescr
source: Controls whether only fixed pitch fonts can be selected.
sr: Определяет, только ли шрифты фиксированного размера могут выбираться.

# FnDfontDescr
source: The font selected in the dialog box.
sr: Шрифт, выбранный в диалоговом окне.

# FnDfontMustExistDescr
source: Controls whether to report an error if the selected font does not exist.
sr: Определяет, появляется ли сообщение об ошибке, если выбранный шрифт не существует.

# FnDmaxSizeDescr
source: The maximum point size that can be Selected (or zero to disable).
sr: Максимальный размер (в пунктах), который можно выбрать (нуль для отключения).

# FnDminSizeDescr
source: The minimum point size that can be Selected (or zero to disable).
sr: Минимальный размер (в пунктах), который можно выбрать (нуль для отключения).

# FnDscriptsOnlyDescr
source: Controls whether to exclude OEM and Symbol character sets.
sr: Определяет, исключаются ли кодовые страницы OEM и Symbol.

# FnDshowApplyDescr
source: Controls whether to show the Apply button.
sr: Определяет, отображать ли кнопку 'Применить'.

# FnDshowColorDescr
source: Controls whether to show a color choice.
sr: Определяет, отображать ли выбор цветов.

# FnDshowEffectsDescr
source: Controls whether to show the underline, strikeout, and font color selections.
sr: Определяет, отображается ли нижнее подчеркивание, перечеркивание и выбор цветов шрифтов.

# FnDshowHelpDescr
source: Controls whether to show the Help button.
sr: Определяет, отображать ли кнопку 'Справка'.

# FolderBrowserDialogDescription
source: The string that is displayed above the tree view control in the dialog box. This string can be used to specify instructions to the user.
sr: Строка, отображаемая над иерархическим представлением структуры дерева в данном диалоговом окне. Эта строка служит для задания инструкций для пользователя.

# FolderBrowserDialogNoRootFolder
source: Unable to retrieve the root folder.
sr: Не удалось извлечь корневую папку.

# FolderBrowserDialogRootFolder
source: The location of the root folder from which to start browsing. Only the specified folder and any subfolders that are beneath it will appear in the dialog box.
sr: Местоположение корневого каталога, от которого начинается обзор. В диалоговом окне будет отображаться только указанная папка и вложенные в нее папки всех уровней.

# FolderBrowserDialogSelectedPath
source: The path of the folder first selected in the dialog or the last one selected by the user.
sr: Путь к папке, которая первой выбрана в данном диалоговом окне, или к последней папке, выбранной пользователем.

# FolderBrowserDialogShowNewFolderButton
source: Include the New Folder button in the dialog box.
sr: Отображать кнопку 'Создать папку' в диалоговом окне.

# FolderBrowserDialogUseDescriptionForTitle
source: A value that indicates whether to use the value of the Description property as the dialog title for Vista style dialogs. This property has no effect on old style dialogs.
sr: Значение, указывающее, следует ли использовать значение свойства Description как заголовок диалогового окна для диалоговых окон в стиле Vista. Это свойство не влияет на диалоговые окна в старом стиле.

# FormAcceptButtonDescr
source: The accept button of the form. If this is set, the button is 'clicked' whenever the user presses the 'ENTER' key.
sr: Кнопка приема данных формы. Можно сделать нажатие клавиши 'Ввод' эквивалентным нажатию этой кнопки.

# FormActiveMDIChildDescr
source: The currently active MDI child form.
sr: Текущая активная дочерняя форма MDI.

# FormAutoScaleDescr
source: If set to true, the form will automatically scale with the screen font.
sr: При значении true (истина) данная форма автоматически масштабируется по экранному шрифту.

# FormAutoScrollDescr
source: Indicates whether scroll bars automatically appear when the control contents are larger than its visible area.
sr: Управляет автоматическим появлением полосы прокрутки, когда содержимое элемента управления больше его отображаемой области.

# FormAutoScrollMarginDescr
source: The margin around controls during auto scroll.
sr: Поля вокруг элементов управления при автоматической прокрутке.

# FormAutoScrollMinSizeDescr
source: The minimum logical size for the auto scroll region.
sr: Минимальный логический размер области автоматической прокрутки.

# FormAutoScrollPositionDescr
source: The current position of the auto-scrolling scroll bar.
sr: Текущее положение автоматической полосы прокрутки.

# FormBorderStyleDescr
source: Indicates the appearance and behavior of the border and title bar of the form.
sr: Определяет внешний вид и поведение границы и строки заголовка данной формы.

# FormCancelButtonDescr
source: The cancel button of the form. If this property is set, the button is 'clicked' whenever the user presses the 'ESC' key.
sr: Кнопка отмены для данной формы. Если это свойство задано, можно сделать нажатие клавиши ESC эквивалентным нажатию этой кнопки.

# FormControlBoxDescr
source: Determines whether a form has a Control/System menu box.
sr: Определяет, содержит ли форма значок меню окна/системного меню.

# FormDesktopBoundsDescr
source: The bounds of this form in desktop coordinates.
sr: Привязки данной формы в координатах рабочего стола.

# FormDesktopLocationDescr
source: The location of this form in desktop coordinates.
sr: Положение данной формы в координатах рабочего стола.

# FormDialogResultDescr
source: The value this form will return if displayed as a dialog box.
sr: Значение, возвращаемое этой формой при ее отображении в виде диалогового окна.

# FormHelpButtonClickedDescr
source: Event raised when the help button is clicked.
sr: Событие возникает при нажатии кнопки справки.

# FormHelpButtonDescr
source: Determines whether a form has a Help button on the caption bar.
sr: Определяет, содержит ли форма кнопку справки в строке заголовка.

# FormIconDescr
source: Indicates the icon for a form. This icon is displayed in the form's system menu box and when the form is minimized.
sr: Указывает значок для формы. Этот значок используется в системном меню данной формы, а также отображается, когда форма свернута.

# FormIsMDIChildDescr
source: Determines whether the form is a child of a MDI container.
sr: Определяет, является ли форма дочерним окном контейнера MDI.

# FormIsMDIContainerDescr
source: Determines whether the form is an MDI container.
sr: Определяет, является ли форма контейнером MDI.

# FormKeyPreviewDescr
source: Determines whether keyboard events for controls on the form are registered with the form.
sr: Определяет, регистрируются ли в данной форме события нажатия клавиш клавиатуры для элементов управления этой формы.

# FormMDIChildrenDescr
source: Retrieves the MDI children of this form.
sr: Извлекает дочерние окна MDI этой формы.

# FormMDIParentAndChild
source: Form cannot be both an MDI child and MDI parent.
sr: Форма не может одновременно являться дочерней и родительской формой MDI.

# FormMDIParentCannotAdd
source: Form cannot be added to the Controls collection that has a valid MDI parent.
sr: Невозможно добавить форму к коллекции элементов управления, имеющей допустимого родителя MDI.

# FormMDIParentDescr
source: Retrieves the MDI parent of this form.
sr: Извлекает родительское окно MDI этой формы.

# FormMaximizeBoxDescr
source: Determines whether a form has a maximize box in the upper-right corner of its caption bar.
sr: Определяет, содержит ли форма в правом верхнем углу строки заголовка значок развертывания до максимального размера.

# FormMaximumSizeDescr
source: The maximum size the form can be resized to.
sr: Максимальный размер, который может иметь форма.

# FormMenuStripDescr
source: Specifies the primary MenuStrip for the Form. This property is used for keyboard activation and automatic merging in MDI.
sr: Определяет для Form первичный MenuStrip. Данное свойство используется для активации клавиатуры и автоматического слияния в MDI.

# FormMinimizeBoxDescr
source: Determines whether a form has a minimize box in the upper-right corner of its caption bar.
sr: Определяет, содержит ли форма в правом верхнем углу строки заголовка значок свертывания.

# FormMinimumSizeDescr
source: The minimum size the form can be resized to.
sr: Минимальный размер, который может иметь форма.

# FormModalDescr
source: Indicates if this form is currently being displayed as a modal dialog box.
sr: Указывает, отображается ли в данный момент эта форма как модальное диалоговое окно.

# FormOnActivateDescr
source: Occurs whenever the form is activated.
sr: Происходит при каждой активации данной формы.

# FormOnClosedDescr
source: Occurs whenever the user closes the form, after the form has been closed.
sr: Происходит всегда при закрытии формы после того, как пользователь закрыл форму.

# FormOnClosingDescr
source: Occurs whenever the user closes the form, before the form has been closed.
sr: Происходит всегда при закрытии формы до того, как пользователь закрыл форму.
