Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# DataGridView_RowResizableDescr
source: Indicates whether users can resize the row or indicates that the behavior is inherited from the DataGridView.AllowUserToResizeRows property.
sr: Указывает, может ли пользователь изменять размеры строки, или указывает, что поведение наследуется от свойства DataGridView.AllowUserToResizeRows.

# DataGridView_RowStateChangedDescr
source: Occurs when a row changes state, such as losing or gaining input focus.
sr: Возникает при изменении состояния строки (например, при получении или потере фокуса строкой).

# DataGridView_RowTemplateDescr
source: Identifies the template row whose characteristics are used as the basis for all new implicitly added rows.
sr: Определяет строку шаблона, характеристики которой используются как основа для всех явно добавляемых новых строк.

# DataGridView_RowUnsharedDescr
source: Occurs when a row's state changes from shared to unshared.
sr: Возникает при запрете совместного использования строки.

# DataGridView_RowValidatedDescr
source: Occurs after a row has finished validating.
sr: Возникает после завершения проверки допустимости строки.

# DataGridView_RowValidatingDescr
source: Occurs when a row is validating.
sr: Возникает при проверке допустимости строки.

# DataGridView_RowsAddedDescr
source: Event raised when one or more rows are added to the rows collection.
sr: Событие возникает при добавлении одной или нескольких строк к коллекции строк.

# DataGridView_RowsDefaultCellStyleDescr
source: The default style applied to the row cells of the DataGridView.
sr: Стиль, используемый для ячеек строк DataGridView по умолчанию.

# DataGridView_RowsRemovedDescr
source: Event raised when one or more rows are removed from the rows collection.
sr: Событие вызывается при удалении одной или нескольких строк из коллекции строк.

# DataGridView_ScrollBarsDescr
source: The type of scroll bars to display for the DataGridView control.
sr: Тип полосы прокрутки, отображаемый для элемента управления DataGridView.

# DataGridView_ScrollDescr
source: Event raised when the grid scrolls horizontally or vertically. Use the ScrollEventArgs.Orientation to determine the direction scrolled.
sr: Событие вызывается при горизонтальной или вертикальной прокрутке сетки. Для определения направления прокрутки используйте ScrollEventArgs.Orientation.

# DataGridView_SelectionChangedDescr
source: Occurs when the current selection changes.
sr: Возникает при изменении текущего выбора.

# DataGridView_SelectionModeAndSortModeClash
source: DataGridView control's SelectionMode cannot be set to {0} while it has a column with SortMode set to DataGridViewColumnSortMode.Automatic.
sr: SelectionMode элемента управления DataGridView не может принимать значение {0}, пока в нем есть столбец, SortMode которого имеет значение DataGridViewColumnSortMode.Automatic.

# DataGridView_SelectionModeDescr
source: Indicates how the cells of the DataGridView can be selected.
sr: Указывает, как можно выбрать ячейки DataGridView.

# DataGridView_SelectionModeReset
source: {0} The SelectionMode property was reset to its default value {1}.
sr: {0} Для свойства SelectionMode установлено значение по умолчанию {1}.

# DataGridView_SetCurrentCellAddressCoreNotReentrant
source: Operation is not valid because it results in a reentrant call to the SetCurrentCellAddressCore function.
sr: Недопустимая операция: приводит к повторному вызову функции SetCurrentCellAddressCore.

# DataGridView_ShowCellErrorsDescr
source: Indicates whether to show cell errors.
sr: Указывает, отображаются ли ошибки на уровне ячеек.

# DataGridView_ShowCellToolTipsDescr
source: Indicates whether or not ToolTips will show when the mouse pointer pauses on a cell.
sr: Указывает, отображается ли подсказка при задержке указателя мыши над ячейкой.

# DataGridView_ShowEditingIconDescr
source: Indicates whether or not the editing glyph is visible in the row header of the cell being edited.
sr: Указывает, отображается ли значок редактирования в заголовке строки редактируемой ячейки.

# DataGridView_ShowRowErrorsDescr
source: Indicates whether row headers will display error glyphs for each row that contains a data entry error.
sr: Указывает, отображаются ли в заголовках строк значки ошибок для каждой строки, содержащей ошибку ввода данных.

# DataGridView_SizeTooLarge
source: Width and height of the control cannot be set to values larger than {0}.
sr: Значения ширины и высоты элемента управления не могут быть больше {0}.

# DataGridView_SortCompareDescr
source: Occurs when the DataGridView compares two cell values to perform a sort operation.
sr: Возникает, когда DataGridView сравнивает значения двух ячеек при выполнении сортировки.

# DataGridView_SortedDescr
source: Occurs when the DataGridView compares two cell values to perform a sort operation.
sr: Возникает, когда DataGridView сравнивает значения двух ячеек при выполнении сортировки.

# DataGridView_StandardTabDescr
source: Indicates whether the TAB key moves the focus to the next control in the tab order rather than moving focus to the next cell in the control.
sr: Указывает, происходит ли при нажатии клавиши TAB переключение фокуса на следующий элемент управления вкладки, а не на следующую ячейку элемента управления.

# DataGridView_TextBoxColumnMaxInputLengthDescr
source: Specifies the maximum number of characters that can be entered into the text box.
sr: Определяет максимальное число символов, которые можно ввести в текстовое поле.

# DataGridView_TransparentColor
source: Color '{0}' cannot be set to a transparent color.
sr: Цвет '{0}' не может быть прозрачным.

# DataGridView_UserAddedRowDescr
source: Occurs when the user has finished adding a row to the DataGridView control.
sr: Возникает после завершения добавления строки в элемент управления DataGridView.

# DataGridView_UserDeletedRowDescr
source: Occurs when the user has finished deleting a row from the DataGridView control.
sr: Возникает после завершения удаления строки из элемента управления DataGridView.

# DataGridView_UserDeletingRowDescr
source: Occurs when the user deletes a row from the DataGridView control.
sr: Возникает при удалении строки из элемента управления DataGridView.

# DataGridView_WeightSumCannotExceedLongMaxValue
source: Sum of the columns' FillWeight values cannot exceed {0}.
sr: Сумма значений FillWeight столбцов не должна превышать {0}.

# DataGridView_WrongType
source: Provided {0} must be of type {1} or derive from it.
sr: Указанный {0} должен иметь тип {1} или производный от него тип.

# DataGridVisibleColumnCountDescr
source: Returns the count of visible columns in the grid.
sr: Возвращает число видимых столбцов сетки.

# DataGridVisibleRowCountDescr
source: Returns the count of visible rows in the grid.
sr: Возвращает число видимых строк сетки.

# DataObjectDibNotSupported
source: Bitmap object does not directly support the device-independent bitmap format. Either specify auto-conversion or perform a SetData with the Bitmap data format.
sr: Растровый объект непосредственно не поддерживает не зависящий от устройства растровый формат. Используйте автоматическое приведение либо выполните SetData с растровым форматом данных.

# DataObjectWhitespaceEmptyFormatNotAllowed
source: Whitespace or empty string is not a valid value for parameter 'format'.
sr: Пробел и пустая строка не являются допустимыми значениями для параметра "format".

# DataSourceDataMemberPropNotFound
source: DataMember property '{0}' cannot be found on the DataSource.
sr: Свойство '{0}' для DataMember не найдено в DataSource.

# DataSourceLocksItems
source: Items collection cannot be modified when the DataSource property is set.
sr: Изменение коллекции элементов невозможно, если задано свойство DataSource.

# DataStreamWrite
source: Requested number of bytes did not get written to the underlying IStream implementation.
sr: Указанное число байтов не удалось записать в базовую реализацию IStream.

# DateTimePickerCalendarFontDescr
source: The font used to display the calendar.
sr: Шрифт для отображения календаря.

# DateTimePickerCalendarForeColorDescr
source: The color used to display text within a month.
sr: Цвет для отображения текста в области месяца.

# DateTimePickerCalendarMonthBackgroundDescr
source: The background color displayed within the month.
sr: Фоновый цвет, отображаемый в области месяца.

# DateTimePickerCalendarTitleBackColorDescr
source: The background color displayed in the calendar's title.
sr: Фоновый цвет заглавия календаря.

# DateTimePickerCalendarTitleForeColorDescr
source: The color used to display text within the calendar's title.
sr: Цвет для отображения текста в заглавии календаря.

# DateTimePickerCalendarTrailingForeColorDescr
source: The color used to display header day and trailing day text. Header and trailing days are the days from the previous and following months that appear on the current month calendar.
sr: Цвет для отображения текста завершающих и начальных дней. Завершающие и начальные дни - это дни предыдущего и следующего месяца, отображаемые в календаре на текущий месяц.

# DateTimePickerCheckedDescr
source: When ShowSelectBox is true, determines if the check box is checked, indicating that the user has selected a value.
sr: Если ShowSelectBox имеет значение true, определяет, установлен ли флажок, указывающий, что пользователь выбрал значение.

# DateTimePickerCustomFormatDescr
source: The custom format string used to format the date and/or time displayed in the control.
sr: Строка пользовательского формата даты и/или времени, отображаемого в данном элементе управления.

# DateTimePickerDropDownAlignDescr
source: Controls how the month drop-down is aligned to the DateTimePicker. Can be LEFT or RIGHT.
sr: Управляет выравниванием месяцев в раскрывающемся списке элемента управления DateTimePicker. Может принимать значение LEFT или RIGHT.

# DateTimePickerFormatDescr
source: Determines whether dates and times are displayed using standard or custom formatting.
sr: Определяет, отображаются ли даты и время в стандартном или особом формате.

# DateTimePickerLocalizedControlType
source: date and time picker
sr: Средство выбора даты и времени

# DateTimePickerMaxDate
source: DateTimePicker does not support dates after {0}.
sr: DateTimePicker не поддерживает даты позднее {0}.

# DateTimePickerMaxDateDescr
source: The maximum date that can be selected.
sr: Максимальная доступная для выбора дата.

# DateTimePickerMinDate
source: DateTimePicker does not support dates before {0}.
sr: DateTimePicker не поддерживает даты ранее {0}.

# DateTimePickerMinDateDescr
source: The minimum date that can be selected.
sr: Минимальная доступная для выбора дата.

# DateTimePickerOnCloseUpDescr
source: Occurs when the user is finished selecting a date from the drop-down calendar.
sr: Происходит при завершении пользователем выбора даты из раскрывающегося календаря.

# DateTimePickerOnDropDownDescr
source: Occurs when the drop-down calendar is about to drop.
sr: Происходит перед развертыванием раскрывающегося календаря.

# DateTimePickerOnFormatChangedDescr
source: Event raised when the value of the Format property is changed on DateTimePicker.
sr: Событие возникает, когда для DateTimePicker изменяется значение свойства Format.

# DateTimePickerShowNoneDescr
source: Determines whether a check box is displayed in the control. When the box is unchecked, no value is selected.
sr: Определяет, отображается ли флажок в данном элементе управления. Когда флажок не установлен, значение не выбрано.

# DateTimePickerShowUpDownDescr
source: Indicates whether a spin box rather than a drop-down calendar is displayed for modifying the control value.
sr: Указывает, используются ли для изменения значения элемента управления кнопки "вверх-вниз" вместо раскрывающегося календаря.

# DateTimePickerValueDescr
source: The current date/time value for this control.
sr: Текущее значение даты и времени для этого элемента управления.

# DebuggingExceptionOnly
source: {0} This exception is only raised if a debugger is attached to the process.
sr: {0} Данное исключение создается, только если к процессу подключен отладчик.

# DefManifestNotFound
source: Default manifest file required to enable visual styles cannot be found.
sr: Не найден файл манифеста по умолчанию, необходимый для подключения визуальных стилей.

# DefaultDataGridViewButtonCellTollTipText
source: Button
sr: Кнопка

# DefaultDataGridViewComboBoxCellTollTipText
source: ComboBox
sr: Поле со списком

# DefaultDataGridViewImageCellToolTipText
source: Image
sr: Изображение

# DefaultDataGridViewLinkCellTollTipText
source: Link
sr: Связь

# DefaultDataGridViewTextBoxCellTollTipText
source: Edit
sr: Изменить

# DescriptionBindingNavigator
source: Provides a user interface for navigation and manipulation of data bound to controls on a form.
sr: Указывает интерфейс пользователя для навигации и управления данными, привязанными к элементам управления формы.

# DescriptionBindingSource
source: Encapsulates a data source for a form and provides navigation, filtering, sorting, and updating capabilities.
sr: Инкапсулирует источник данных для формы и обеспечивает возможности навигации, фильтрации, сортировки и обновления.

# DescriptionButton
source: Raises an event when the user clicks it.
sr: При щелчке возникает событие.

# DescriptionCheckBox
source: Enables the user to select or clear the associated option.
sr: Позволяет пользователю выбрать или удалить соответствующий параметр.

# DescriptionCheckedListBox
source: Displays a list of items with a check box on the left side of each item.
sr: Отображает список элементов с флаговыми кнопками слева от каждого элемента.

# DescriptionColorDialog
source: Displays available colors along with controls that enable the user to define custom colors.
sr: Отображает доступные цвета и элементы управления, позволяющие пользователю задать другие цвета.

# DescriptionComboBox
source: Displays an editable text box with a drop-down list of permitted values.
sr: Отображает редактируемое текстовое поле и раскрывающийся список допустимых значений.

# DescriptionContextMenuStrip
source: Displays a shortcut menu when the user right-clicks the associated control.
sr: Отображает меню быстрого доступа при щелчке правой кнопкой мыши на соответствующем элементе управления.

# DescriptionDataGridView
source: Displays rows and columns of data in a grid you can customize.
sr: Отображает строки и столбцы данных в сетке, которые пользователь может изменить.

# DescriptionDateTimePicker
source: Enables the user to select a date and time, and to display that date and time in a specified format.
sr: Позволяет пользователю выбрать дату и время и отобразить их в выбранном формате.

# DescriptionDomainUpDown
source: Displays a single string value that the user selected from a list of items by clicking up and down buttons in the control.
sr: Отображает единичное строковое значение, выбранное пользователем из списка элементов с помощью кнопок "вверх-вниз" элемента управления.

# DescriptionErrorProvider
source: Provides a user interface to indicate to the user that a control on a form has an error associated with it.
sr: Предоставляет интерфейс пользователя, указывающий пользователю о наличии ошибки в элементе управления формы.

# DescriptionFlowLayoutPanel
source: Handles the layout of its components and arranges them in a flow layout automatically.
sr: Обрабатывает макет компонентов и автоматически компонует их в макет потока.

# DescriptionFolderBrowserDialog
source: Displays a dialog box that prompts the user to select a folder.
sr: Отображает диалоговое окно, позволяющее пользователю выбрать папку.

# DescriptionFontDialog
source: Displays a dialog box that prompts the user to choose a font from those installed on the local computer.
sr: Отображает диалоговое окно, позволяющее пользователю выбрать шрифт из списка шрифтов, установленных на локальном компьютере.

# DescriptionGroupBox
source: Displays a frame around a group of controls with an optional caption.
sr: Отображает рамку вокруг группы элементов управления с возможностью включения заголовка.

# DescriptionHScrollBar
source: Enables its parent component to scroll content horizontally. Unnecessary if the parent has an autoscroll attribute, and that attribute is enabled.
sr: Обеспечивает для родительского компонента возможность горизонтальной прокрутки содержимого. Не требуется, если родитель имеет атрибут автопрокрутки и этот атрибут включен.

# DescriptionHelpProvider
source: Provides pop-up or online Help for controls.
sr: Обеспечивает для элементов управления всплывающее окно справки или окно оперативной справки.

# DescriptionImageList
source: Manages a collection of images that are typically used by other controls such as ListView, TreeView, or ToolStrip.
sr: Управляет коллекцией изображений, которые обычно используются другими элементами управления (например, ListView, TreeView или ToolStrip).

# DescriptionLabel
source: Provides run-time information or descriptive text for a control.
sr: Предоставляет элементу управления текст описания либо информацию во время выполнения.

# DescriptionLinkLabel
source: Displays a label control that supports hyperlink functionality, formatting, and tracking.
sr: Отображает элемент управления "надпись", поддерживающий форматирование, отслеживание и функциональность гиперссылки.

# DescriptionListBox
source: Displays a list from which the user can select items.
sr: Отображает список, из которого пользователь может выбирать элементы.

# DescriptionListView
source: Displays a collection of items in one of five different views.
sr: Отображает коллекцию элементов в одном из пяти различных представлений.

# DescriptionMaskedTextBox
source: Uses a mask to distinguish between proper and improper user input.
sr: Использует маску для различения допустимого и недопустимого ввода данных пользователем.

# DescriptionMenuStrip
source: Displays application commands and options grouped by functionality.
sr: Отображает команды приложения и параметры, сгруппированные по функциональности.

# DescriptionMonthCalendar
source: Displays a monthly calendar from which the user can select a date.
sr: Отображает помесячный календарь, с помощью которого пользователь может выбрать дату.

# DescriptionNotifyIcon
source: Displays an icon in the notification area, on the right side of the Windows taskbar, during run time.
sr: Во время выполнения отображает значок в области уведомления справа от панели задач Windows.

# DescriptionNumericUpDown
source: Displays a single numeric value that the user can increment and decrement by clicking up and down buttons on the control.
sr: Отображает единичное числовое значение, которое пользователь может увеличить или уменьшить с помощью кнопок "вверх-вниз" элемента управления.

# DescriptionOpenFileDialog
source: Displays a dialog box that prompts the user to open a file.
sr: Отображает диалоговое окно, позволяющее пользователю открыть файл.

# DescriptionPageSetupDialog
source: Displays a dialog box that enables the user to change page-related print settings, including margins and paper orientation.
sr: Отображает диалоговое окно, позволяющее пользователю изменить параметры страницы для печати, включая поля и ориентацию бумаги.

# DescriptionPanel
source: Enables you to group collections of controls.
sr: Позволяет пользователю группировать коллекции элементов управления.

# DescriptionPictureBox
source: Displays an image.
sr: Отображает изображение.

# DescriptionPrintDialog
source: Displays a dialog box that enables the user to select a printer and choose other print options such as the number of copies and page orientation.
sr: Отображает диалоговое окно, позволяющее пользователю выбрать принтер и другие параметры печати (например, число копий и ориентацию страницы).

# DescriptionPrintPreviewControl
source: Represents only the portion of a print preview that shows the document being previewed. Does not contain any dialog boxes or buttons.
sr: Представляет только часть документа в режиме предварительного просмотра. Не содержит диалоговых окон и кнопок.

# DescriptionPrintPreviewDialog
source: Displays a dialog box that shows the user a preview of what the associated document will look like when printed.
sr: Отображает диалоговое окно предварительного просмотра документа перед печатью.

# DescriptionProgressBar
source: Displays a bar that fills to indicate to the user the progress of an operation.
sr: Отображает индикатор выполнения операции.

# DescriptionPropertyGrid
source: Provides a user interface for browsing the properties of an object.
sr: Предоставляет интерфейс пользователя, который используется как обозреватель для свойств объекта.

# DescriptionRadioButton
source: Enables the user to select a single option from a group of choices when paired with other RadioButtons.
sr: Позволяет пользователю выбрать определенный параметр из группы в комбинации с другими флаговыми кнопками.

# DescriptionRichTextBox
source: Provides advanced text entry and editing features such as character and paragraph formatting.
sr: Обеспечивает дополнительные возможности ввода и редактирования текста (например, форматирование символов и абзацев).

# DescriptionSaveFileDialog
source: Displays a dialog box that prompts the user to select a location for saving a file.
sr: Отображает диалоговое окно, позволяющее пользователю выбрать местоположение для сохранения файла.

# DescriptionSplitContainer
source: Divides a container's display area into two resizable panels to which you can add controls.
sr: Разделяет отображаемую область контейнера на две панели изменяемого размера, к которым пользователь может добавлять элементы управления.

# DescriptionSplitter
source: Divides a container's display area into two areas which can be resized.
sr: Разделяет отображаемую область контейнера на две области изменяемого размера.

# DescriptionStatusStrip
source: Displays information to the user about the object being viewed, the object's components, or the object's operation.
sr: Показывает пользователю информацию о просматриваемом объекте, компонентах объекта или операциях объекта.

# DescriptionTabControl
source: Manages and displays to the user a related collection of tabs that can contain controls and components.
sr: Обрабатывает и отображает для пользователя соответствующую коллекцию вкладок, содержащих элементы управления и компоненты.

# DescriptionTableLayoutPanel
source: Handles the layout of its components and arranges them in the format of a table automatically.
sr: Обрабатывает макет компонентов и автоматически компонует их в формате таблицы.

# DescriptionTextBox
source: Enables the user to enter text, and provides multiline editing and password character masking.
sr: Позволяет пользователю вводить текст и обеспечивает редактирование нескольких строк и маскирование символов пароля.

# DescriptionTimer
source: Component that raises an event at user defined intervals
sr: Компонент, создающий событие с интервалами, определенными пользователем

# DescriptionToolStrip
source: Provides toolbars and other user interface elements that support many appearance options, and that support overflow and run-time item reordering.
sr: Предоставляет панели инструментов и другие элементы интерфейса пользователя, поддерживающие множество параметров представления, а также переполнение и реорганизацию элементов во время выполнения.

# DescriptionToolTip
source: Displays information when the user moves the pointer over an associated control.
sr: Отображает информацию при наведении указателя мыши на соответствующий элемент управления.

# DescriptionTrackBar
source: Enables the user to choose between a range of values by sliding a small bar along another bar.
sr: Позволяет пользователю выбрать диапазон значений с помощью небольшого ползунка, перемещаемого по полосе.
