Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# DataGridView_AllowUserToOrderColumnsDescr
source: Indicates whether manual column repositioning is enabled.
sr: Указывает, включена ли возможность изменения положения столбцов вручную.

# DataGridView_AllowUserToResizeColumnsDescr
source: Indicates whether users can resize columns.
sr: Указывает, может ли пользователь изменять размеры столбцов.

# DataGridView_AllowUserToResizeRowsDescr
source: Indicates whether users can resize rows.
sr: Указывает, может ли пользователь изменять размеры строк.

# DataGridView_AlternatingRowsDefaultCellStyleDescr
source: The default cell style applied to odd-numbered rows.
sr: Стиль ячеек, применяемый к нечетным строкам по умолчанию.

# DataGridView_AtLeastOneColumnIsNull
source: At least one of the provided columns is null.
sr: Как минимум один из указанных столбцов пуст.

# DataGridView_AtLeastOneRowIsNull
source: At least one of the provided rows is null.
sr: Как минимум одна из указанных строк пуста.

# DataGridView_AutoSizeColumnsModeDescr
source: Determines the auto size mode for the visible columns.
sr: Определяет режим автоматической установки размера для видимых столбцов.

# DataGridView_AutoSizeRowsModeDescr
source: Determines the auto size mode for the visible rows.
sr: Определяет режим автоматической установки размера для видимых строк.

# DataGridView_BeginEditNotReentrant
source: Operation is not valid because it results in a reentrant call to the BeginEdit function.
sr: Данная операция невозможна, так как она приводит к повторному вызову функции BeginEdit.

# DataGridView_BorderStyleDescr
source: The border style for the DataGridView.
sr: Стиль границ для DataGridView.

# DataGridView_ButtonColumnFlatStyleDescr
source: The flat style appearance of the button cells in the column.
sr: Плоское отображение ячеек кнопок в столбце.

# DataGridView_ButtonColumnTextDescr
source: The default text displayed on the button cell.
sr: Текст, отображаемый в ячейке кнопки по умолчанию.

# DataGridView_ButtonColumnUseColumnTextForButtonValueDescr
source: Indicates whether the DataGridViewButtonColumn.Text property value is displayed as the button text for cells in this column.
sr: Указывает, отображается ли значение свойства DataGridViewButtonColumn.Text как текст кнопки для ячеек данного столбца.

# DataGridView_CancelRowEditDescr
source: Occurs when the DataGridView.VirtualMode property of a DataGridView control is true and a row edit should be canceled.
sr: Возникает, когда свойство DataGridView.VirtualMode элемента управления DataGridView принимает значение true, и редактирование строки необходимо отменить.

# DataGridView_CannotAddAutoFillColumn
source: Visible column cannot be added because its AutoSize mode is Fill, and the column is frozen.
sr: Невозможно добавить видимый столбец, так как функция AutoSize столбца имеет значение Fill, и столбец зафиксирован.

# DataGridView_CannotAddAutoSizedColumn
source: Visible column cannot be added because its AutoSize mode includes its header, and the column headers are invisible.
sr: Невозможно добавить видимый столбец, так как функция AutoSize столбца включает его заголовок, а заголовки столбца невидимы.

# DataGridView_CannotAddFrozenColumn
source: Column cannot be added because it is frozen and placed after an unfrozen column.
sr: Невозможно добавить столбец, так как он зафиксирован и помещен после нефиксированного столбца.

# DataGridView_CannotAddFrozenRow
source: Row cannot be added because it is frozen and placed after an unfrozen row.
sr: Невозможно добавить строку, так как она зафиксирована и помещена после нефиксированной строки.

# DataGridView_CannotAddIdenticalColumns
source: At least two provided columns are identical. Each provided column must be unique.
sr: Как минимум два из указанных столбцов являются идентичными. Каждый столбец должен быть уникален.

# DataGridView_CannotAddIdenticalRows
source: At least two provided rows are identical. Each provided row must be unique.
sr: Как минимум две из указанных строк являются идентичными. Каждая строка должна быть уникальна.

# DataGridView_CannotAddNonFrozenColumn
source: Column cannot be added because it is unfrozen and placed before a frozen column.
sr: Невозможно добавить столбец, так как он не зафиксирован и помещен перед фиксированным столбцом.

# DataGridView_CannotAddNonFrozenRow
source: Row cannot be added because it is unfrozen and placed before a frozen row.
sr: Невозможно добавить строку, так как она не зафиксирована и помещена перед фиксированной строкой.

# DataGridView_CannotAddUntypedColumn
source: Column cannot be added because its CellType property is null.
sr: Невозможно добавить столбец, так как его свойство CellType пусто.

# DataGridView_CannotAlterAutoFillColumnParameter
source: This operation cannot be performed while an auto-filled column is being resized.
sr: Выполнение данной операции во время изменения размеров автозаполняемого столбца невозможно.

# DataGridView_CannotAlterDisplayIndexWithinAdjustments
source: This operation cannot be performed while the DisplayIndex of a column is being adjusted.
sr: Выполнение данной операции во время изменения DisplayIndex столбца невозможно.

# DataGridView_CannotAutoFillFrozenColumns
source: Columns AutoSize mode cannot be set to Fill because at least one visible column would inherit this AutoSize mode and is frozen.
sr: Установка значения Fill для функции AutoSize для столбцов невозможна, так как по меньшей мере один видимый столбец наследует этот режим AutoSize и является фиксированным.

# DataGridView_CannotAutoSizeColumnsInvisibleColumnHeaders
source: Columns AutoSize mode cannot be based exclusively on the headers because the column headers are invisible and at least one visible column would inherit this AutoSize mode.
sr: Режим AutoSize для столбцов не может базироваться исключительно на заголовках, так как заголовки столбцов невидимы и как минимум один видимый столбец наследует этот режим AutoSize.

# DataGridView_CannotAutoSizeInvisibleColumnHeader
source: Column AutoSize mode cannot be based exclusively on the header because the column headers are invisible.
sr: Режим AutoSize для столбца не может базироваться исключительно на заголовке, так как заголовки столбцов невидимы.

# DataGridView_CannotAutoSizeRowInvisibleRowHeader
source: Row AutoSize mode cannot be based on the row headers alone while they are invisible.
sr: Режим AutoSize для строки не может базироваться исключительно на заголовках строк, пока они невидимы.

# DataGridView_CannotAutoSizeRowsInvisibleRowHeader
source: Rows AutoSize mode cannot be based on the row headers alone while they are invisible.
sr: Режим AutoSize для строк не может базироваться исключительно на заголовках строк, пока они невидимы.

# DataGridView_CannotMakeAutoSizedColumnVisible
source: Column cannot be made visible because its AutoSize mode includes its header and the column headers are invisible.
sr: Невозможно сделать столбец видимым, так как его режим AutoSize включает его заголовок, а заголовки столбцов невидимы.

# DataGridView_CannotMoveFrozenColumn
source: Frozen column cannot be moved after an unfrozen column.
sr: Фиксированный столбец нельзя расположить после нефиксированного столбца.

# DataGridView_CannotMoveNonFrozenColumn
source: Unfrozen column cannot be moved before a frozen column.
sr: Нефиксированный столбец нельзя расположить перед фиксированным столбцом.

# DataGridView_CannotSetColumnCountOnDataBoundDataGridView
source: ColumnCount property cannot be set on a data-bound DataGridView control.
sr: Невозможно задать свойство ColumnCount для элемента управления DataGridView с привязкой к данным.

# DataGridView_CannotSetRowCountOnDataBoundDataGridView
source: RowCount property cannot be set on a data-bound DataGridView control.
sr: Невозможно задать свойство RowCount для элемента управления DataGridView с привязкой к данным.

# DataGridView_CannotSortDataBoundDataGridViewBoundToNonIBindingList
source: DataGridView control must be bound to an IBindingList object to be sorted.
sr: Для сортировки элемент управления DataGridView должен быть привязан к объекту IBindingList.

# DataGridView_CannotThrowNullException
source: Exception property is not set to a valid exception. ThrowException cannot be set to true.
sr: Для свойства исключения установлено недопустимое значение. Для ThrowException нельзя установить значение true.

# DataGridView_CannotUseAComparerToSortDataGridViewWhenDataBound
source: DataGridView control is data-bound. The control cannot use the comparer to perform the sort operation.
sr: Элемент управления DataGridView имеет привязку к данным. Данный элемент управления не может использовать блок сравнения для выполнения сортировки.

# DataGridView_CellBeginEditDescr
source: Occurs when edit mode starts for the selected cell.
sr: Возникает при запуске режима правки для выбранных ячеек.

# DataGridView_CellBorderStyleChangedDescr
source: Occurs when the border style of a cell changes.
sr: Возникает при изменении стиля границ ячейки.

# DataGridView_CellBorderStyleDescr
source: The cell border style for the DataGridView.
sr: Стиль границ ячейки для DataGridView.

# DataGridView_CellChangeCannotBeCommittedOrAborted
source: Operation did not succeed because the program cannot commit or quit a cell value change.
sr: Сбой при выполнении операции: программа не может передать или покинуть изменение значения ячейки.

# DataGridView_CellClickDescr
source: Occurs when any part of the cell is clicked.
sr: Возникает при щелчке на любой части ячейки.

# DataGridView_CellContentClick
source: Occurs when the content within a cell is clicked.
sr: Возникает при щелчке на содержимом ячейки.

# DataGridView_CellContentDoubleClick
source: Occurs when a user double-clicks a cell's contents.
sr: Возникает при двойном щелчке на содержимом ячейки.

# DataGridView_CellContextMenuStripChanged
source: Occurs when the DataGridViewCell.ContextMenuStrip property changes.
sr: Возникает при изменении свойства DataGridViewCell.ContextMenuStrip.

# DataGridView_CellContextMenuStripNeeded
source: Occurs when a cell's context menu strip is needed.
sr: Возникает, когда требуется полоса контекстного меню ячейки.

# DataGridView_CellDoesNotBelongToDataGridView
source: Provided cell does not belong to this DataGridView control.
sr: Указанная ячейка не принадлежит к данному элементу управления DataGridView.

# DataGridView_CellDoesNotYetBelongToDataGridView
source: Operation can only be performed on cells that belong to a DataGridView control.
sr: Выполнение данной операции возможно только для ячеек, принадлежащих элементу управления DataGridView.

# DataGridView_CellDoubleClickDescr
source: Occurs when the user double-clicks anywhere in a cell.
sr: Возникает при щелчке в любой области части ячейки.

# DataGridView_CellEndEditDescr
source: Occurs when edit mode stops for the currently selected cell.
sr: Возникает при остановке режима правки для выбранной ячейки.

# DataGridView_CellEnterDescr
source: Occurs when the cell receives input focus, becoming the current cell in the DataGridView.
sr: Возникает при получении фокуса данной ячейкой (ячейка становится текущей в DataGridView).

# DataGridView_CellErrorTextChangedDescr
source: Occurs when the value of the DataGridViewCell.ErrorText property of a cell changes.
sr: Возникает при изменении значения свойства DataGridViewCell.ErrorText ячейки.

# DataGridView_CellErrorTextNeededDescr
source: Occurs when a cell's error text is needed.
sr: Возникает, когда требуется текст ошибки ячейки.

# DataGridView_CellFormattingDescr
source: Occurs when the contents of a cell need to be formatted for display.
sr: Возникает, когда требуется форматирование содержимого ячейки для отображения.

# DataGridView_CellLeaveDescr
source: Occurs when a cell loses input focus and is no longer the current cell.
sr: Возникает при перемещении фокуса с данной ячейки (ячейка больше не является текущей).

# DataGridView_CellMouseClickDescr
source: Occurs whenever a mouse clicks anywhere on a cell.
sr: Возникает при каждом щелчке мышью в любой области ячейки.

# DataGridView_CellMouseDoubleClickDescr
source: Occurs when a cell within the DataGridView is double-clicked.
sr: Возникает при двойном щелчке на ячейке в DataGridView.

# DataGridView_CellMouseDownDescr
source: Occurs when the user presses a mouse button while the mouse pointer is within the boundaries of a cell.
sr: Возникает при нажатии кнопки мыши, когда указатель мыши находится в пределах ячейки.

# DataGridView_CellMouseEnterDescr
source: Occurs when the mouse pointer enters a cell.
sr: Возникает при наведении указателя мыши на ячейку.

# DataGridView_CellMouseLeaveDescr
source: Occurs when the mouse pointer leaves a cell.
sr: Возникает, когда указатель мыши выходит за пределы ячейки.

# DataGridView_CellMouseMoveDescr
source: Occurs when the mouse pointer moves over the DataGridView control.
sr: Возникает при наведении указателя мыши на элемент управления DataGridView.

# DataGridView_CellMouseUpDescr
source: Occurs when the user releases a mouse button while over a cell.
sr: Возникает, когда пользователь отпускает кнопку мыши, когда указатель мыши находится на ячейке.

# DataGridView_CellNeedsDataGridViewForInheritedStyle
source: Cell is not in a DataGridView. The cell cannot retrieve the inherited cell style.
sr: Ячейка не входит в DataGridView. Нельзя извлечь наследованный стиль для ячейки.

# DataGridView_CellPaintingDescr
source: Occurs when a cell needs to be drawn.
sr: Возникает, когда требуется прорисовка ячейки.

# DataGridView_CellParsingDescr
source: Occurs when the user leaves edit mode, regardless of whether the value of the current cell has been modified.
sr: Возникает, когда пользователь покидает режим правки, независимо от того, изменилось ли значение текущей ячейки.

# DataGridView_CellStateChangedDescr
source: Occurs when a cell state changes, such as when the cell loses or gains focus.
sr: Возникает при изменении состояния ячейки (например, при получении или потере фокуса ячейкой).

# DataGridView_CellStyleChangedDescr
source: Occurs when the DataGridViewCell.Style property of a DataGridViewCell changes.
sr: Возникает при изменении свойства DataGridViewCell.Style для DataGridViewCell.

# DataGridView_CellStyleContentChangedDescr
source: Occurs when one of the values of a cell style changes.
sr: Возникает при изменении одного из значений стиля ячейки.

# DataGridView_CellToolTipTextChangedDescr
source: Occurs when the DataGridViewCell.ToolTipText property value changes for a cell in the DataGridView.
sr: Возникает при изменении значения свойства DataGridViewCell.ToolTipText для ячейки в DataGridView.

# DataGridView_CellToolTipTextDescr
source: The text displayed by the ToolTip associated with this cell.
sr: Текст, отображаемый в подсказке ToolTip, связанной с данной ячейкой.

# DataGridView_CellToolTipTextNeededDescr
source: Occurs when a cell's ToolTip text is needed.
sr: Возникает, когда требуется текст подсказки ToolTip ячейки.

# DataGridView_CellValidatedDescr
source: Occurs after the cell has finished validating.
sr: Возникает по завершении проверки допустимости ячейки.

# DataGridView_CellValidatingDescr
source: Occurs when the cell is validating.
sr: Возникает при проверке допустимости ячейки.

# DataGridView_CellValueChangedDescr
source: Occurs when the value of a cell changes.
sr: Возникает при изменении значения ячейки.

# DataGridView_CellValueNeededDescr
source: Occurs when the DataGridView.VirtualMode property of the DataGridView control is true and the DataGridView requires a value for a cell in order to format and display the cell.
sr: Возникает, когда свойство DataGridView.VirtualMode элемента управления DataGridView принимает значение true, и DataGridView требует значение для ячейки для форматирования и отображения ячейки.

# DataGridView_CellValuePushedDescr
source: Occurs when the DataGridView.VirtualMode property of the DataGridView control is true, and a cell value has changed and requires storage in the underlying data source.
sr: Возникает, когда свойство DataGridView.VirtualMode элемента управления DataGridView принимает значение true, значение ячейки изменяется и требует сохранения в базовом источнике данных.

# DataGridView_CheckBoxColumnFalseValueDescr
source: The underlying value corresponding to a cell value of false, which appears as an unchecked box.
sr: Основное значение соответствует значению ячейки false, и флаговая кнопка отображается со снятым флажком.

# DataGridView_CheckBoxColumnFlatStyleDescr
source: The flat style appearance of the check box cells.
sr: Плоское отображение флаговых кнопок.

# DataGridView_CheckBoxColumnIndeterminateValueDescr
source: The underlying value corresponding to an indeterminate or null cell value, which appears as a disabled checkbox.
sr: Базовое значение соответствует неопределенному или пустому значению ячейки, и флаговая кнопка отображается отключенной.

# DataGridView_CheckBoxColumnThreeStateDescr
source: Indicates whether the hosted check box cells will allow three check states rather than two.
sr: Указывает, будет ли для флажка доступно три состояния, а не два.

# DataGridView_CheckBoxColumnTrueValueDescr
source: The underlying value corresponding to a cell value of true, which appears as a checked box.
sr: Базовое значение соответствует значению ячейки true, что выражается в установленном флажке.

# DataGridView_ClipboardCopyModeDescr
source: Indicates whether users can copy cell text values to the Clipboard and whether row and column header text is included.
sr: Указывает, может ли пользователь копировать текст ячеек в буфер обмена и включается ли текст заголовков строк и столбцов.

# DataGridView_ColumnAddedDescr
source: Occurs when a column is added to the control.
sr: Возникает при добавлении столбца к элементу управления.

# DataGridView_ColumnAlreadyBelongsToDataGridView
source: Provided column already belongs to the DataGridView control.
sr: Указанный столбец уже принадлежит к элементу управления DataGridView.

# DataGridView_ColumnBoundToAReadOnlyFieldMustRemainReadOnly
source: DataGridView column bound to a read-only field must have ReadOnly set to True.
sr: Свойство ReadOnly столбца DataGridView с привязкой к полю только для чтения должно иметь значение True.

# DataGridView_ColumnContextMenuStripChangedDescr
source: Occurs when the DataGridViewColumn.ContextMenuStrip property of a column changes.
sr: Возникает при изменении свойства DataGridViewColumn.ContextMenuStrip столбца.

# DataGridView_ColumnContextMenuStripDescr
source: The shortcut menu for the column.
sr: Меню быстрого доступа к столбцу.

# DataGridView_ColumnDataPropertyNameChangedDescr
source: Occurs when the value of the DataGridViewColumn.DataPropertyName property for a column changes.
sr: Возникает при изменении значения свойства DataGridViewColumn.DataPropertyName столбца.

# DataGridView_ColumnDataPropertyNameDescr
source: The name of the data source property or database column to which the DataGridViewColumn is bound.
sr: Имя свойства источника данных или столбца базы данных, к которому привязано свойство DataGridViewColumn.

# DataGridView_ColumnDefaultCellStyleChangedDescr
source: Occurs when the value of the DataGridViewBand.DefaultCellStyle property for a column changes.
sr: Возникает при изменении значения свойства DataGridViewBand.DefaultCellStyle столбца.

# DataGridView_ColumnDefaultCellStyleDescr
source: The column's default cell style.
sr: Стиль ячейки столбца по умолчанию.

# DataGridView_ColumnDisplayIndexChangedDescr
source: Occurs when the value the DataGridViewColumn.DisplayIndex property for a column changes.
sr: Возникает при изменении значения свойства DataGridViewColumn.DisplayIndex столбца.

# DataGridView_ColumnDividerDoubleClickDescr
source: Occurs when the user double-clicks a divider between two columns.
sr: Возникает при двойном щелчке на разделителе между двумя столбцами.

# DataGridView_ColumnDividerWidthChangedDescr
source: Occurs when DataGridViewColumn.DividerWidth changes.
sr: Возникает при изменении DataGridViewColumn.DividerWidth.

# DataGridView_ColumnDividerWidthDescr
source: The width of the column divider in pixels.
sr: Ширина разделителя столбцов (в пикселях).

# DataGridView_ColumnDoesNotBelongToDataGridView
source: Column provided does not belong to this DataGridView control.
sr: Указанный столбец не принадлежит к данному элементу управления DataGridView.

# DataGridView_ColumnFrozenDescr
source: Indicates whether a column will move when a user scrolls the DataGridView control horizontally.
sr: Указывает, будет ли перемещаться столбец при горизонтальной прокрутке элемента управления DataGridView.

# DataGridView_ColumnHeaderCellChangedDescr
source: Occurs when the contents of a column header cell change.
sr: Возникает при изменении содержимого ячейки заголовка столбца.

# DataGridView_ColumnHeaderMouseClickDescr
source: Occurs when the user clicks a column header.
sr: Возникает при щелчке заголовка столбца.

# DataGridView_ColumnHeaderMouseDoubleClickDescr
source: Occurs when a column header is double-clicked.
sr: Возникает при двойном щелчке заголовка столбца.

# DataGridView_ColumnHeaderTextDescr
source: The caption text on the column's header cell.
sr: Текст в ячейке заголовка столбца.

# DataGridView_ColumnHeadersBorderStyleChangedDescr
source: Occurs when the DataGridView.ColumnHeadersBorderStyle property changes.
sr: Возникает при изменении свойства DataGridView.ColumnHeadersBorderStyle.

# DataGridView_ColumnHeadersBorderStyleDescr
source: The border style applied to the column headers.
sr: Стиль границ, используемый для заголовков столбцов.

# DataGridView_ColumnHeadersCannotBeInvisible
source: Column headers cannot be made invisible because at least one column uses its header in its AutoSize mode.
sr: Заголовки столбцов нельзя сделать невидимыми, так как по крайней мере у одного столбца для заголовка задан режим AutoSize.

# DataGridView_ColumnHeadersDefaultCellStyleDescr
source: The default column header style.
sr: Стиль заголовка столбца по умолчанию.

# DataGridView_ColumnHeadersHeightDescr
source: The height, in pixels, of the column headers row.
sr: Высота (в пикселях) строки заголовка столбца.

# DataGridView_ColumnHeadersHeightSizeModeChangedDescr
source: Occurs when the value of the ColumnHeadersHeightSizeMode property changes.
sr: Возникает при изменении значения свойства ColumnHeadersHeightSizeMode.

# DataGridView_ColumnHeadersHeightSizeModeDescr
source: Determines the behavior for adjusting the column headers height.
sr: Определяет поведение при изменении высоты заголовков столбцов.

# DataGridView_ColumnMinimumWidthChangedDescr
source: Occurs when the value of the DataGridViewColumn.MinimumWidth property for a column changes.
sr: Возникает при изменении значения свойства DataGridViewColumn.MinimumWidth для столбца.

# DataGridView_ColumnMinimumWidthDescr
source: The minimum width of the column in pixels.
sr: Минимальная ширина столбца (в пикселях).

# DataGridView_ColumnNameChangedDescr
source: Occurs when the value of the DataGridViewColumn.Name property for a column changes.
sr: Возникает при изменении значения свойства DataGridViewColumn.Name для столбца.

# DataGridView_ColumnNameDescr
source: The name of the column.
sr: Имя столбца.

# DataGridView_ColumnNeedsToBeDataBoundWhenSortingDataBoundDataGridView
source: Data-bound DataGridView control can only be sorted on data-bound columns.
sr: Элемент управления DataGridView с привязкой к данным можно сортировать только по столбцам с привязкой к данным.

# DataGridView_ColumnReadOnlyDescr
source: Indicates whether the user can edit the column's cells.
sr: Указывает, может ли пользователь редактировать ячейки столбца.

# DataGridView_ColumnRemovedDescr
source: Occurs when a column is removed from the control.
sr: Возникает при удалении столбца из элемента управления.
