Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# AXAddInvalidEvent
source: Event {0} is not valid on this ActiveX control.
sr: Событие {0} не определено для этого элемента управления ActiveX.

# AXDuplicateControl
source: ActiveX control named '{0}' already exists in this container. Change or set the "Name" property for this ActiveX control and try again.
sr: В данном контейнере уже существует элемент управления ActiveX с именем '{0}'. Измените или установите свойство "Name" для данного элемента управления ActiveX и повторите попытку.

# AXEditProperties
source: Edit ActiveX component properties
sr: Изменить свойства компонента ActiveX

# AXFontUnitNotPoint
source: ActiveX controls only accept fonts that are defined in GraphicsUnit.Point.
sr: Элементы управления ActiveX поддерживают только шрифты, определенные в GraphicsUnit.Point.

# AXInvalidArgument
source: Not a valid argument.
sr: Недопустимый аргумент.

# AXInvalidMethodInvoke
source: Method '{0}' cannot be invoked at this time.
sr: В данный момент вызов метода '{0}' невозможен.

# AXInvalidPropertyGet
source: Property get of '{0}' cannot be invoked at this time.
sr: В данный момент обращение к свойству get для '{0}' невозможно.

# AXInvalidPropertySet
source: Property set of '{0}' cannot be invoked at this time.
sr: В данный момент обращение к свойству set для '{0}' невозможно.

# AXMTAThread
source: ActiveX control '{0}' cannot be instantiated because the current thread is not in a single-threaded apartment.
sr: Создание экземпляра элемента управления ActiveX '{0}' невозможно: текущий поток не находится в однопоточном контейнере.

# AXNoConnectionPoint
source: Connection point for event interface '{0}' cannot be created.
sr: Невозможно создать точку подключения для интерфейса события '{0}'.

# AXNoConnectionPointContainer
source: Source object does not expose IConnectionPointContainer.
sr: Исходный объект не предоставляет интерфейс IConnectionPointContainer.

# AXNoEventInterface
source: Source object does not expose '{0}' event interface.
sr: Исходный объект не предоставляет интерфейс события '{0}'.

# AXNoLicenseToUse
source: You must have a license to use this ActiveX control.
sr: Для использования данного элемента управления ActiveX необходима лицензия.

# AXNoSinkAdvise
source: Could not Advise() the event interface '{0}'.
sr: Не удалось выполнить Advise() для интерфейса события '{0}'.

# AXNoSinkImplementation
source: Given 'sink' object does not implement '{0}' event interface.
sr: В данном объекте 'sink' не реализован интерфейс события '{0}'.

# AXNoThreadInfo
source: Unable to verify required threading model of apartment or free-threaded. This control cannot be hosted.
sr: Невозможно проверить требуемую потоковую модель: контейнер или свободное распределение. Не предусмотрено назначение этого элемента управления ведущим.

# AXNoTopLevelContainerControl
source: ActiveX control must have at least one ContainerControl in its parent hierarchy to be properly instantiated. Set the ContainingControl property on '{0}' to a non-null value and try again.
sr: Для корректного создания экземпляра у элемента управления ActiveX должен быть хотя бы один ContainerControl в родительской иерархии. Задайте ненулевое значение для свойства ContainingControl для '{0}' и повторите попытку.

# AXNohWnd
source: Unable to get the window handle for the '{0}' control. Windowless ActiveX controls are not supported.
sr: Невозможно получить дескриптор окна для элемента управления '{0}'. Элементы управления ActiveX, не базирующиеся на окнах, не поддерживаются.

# AXNotImplemented
source: Not implemented.
sr: Не реализовано.

# AXOcxStateLoaded
source: ActiveX control cannot be reloaded with an OcxState of a different storage type.
sr: Невозможно перезагрузить элемент управления ActiveX с OcxState другого типа хранилища.

# AXProperties
source: ActiveX - Properties...
sr: ActiveX - Свойства...

# AXSingleThreaded
source: Control is single threaded. It cannot be hosted.
sr: Элемент управления является однопоточным. Его нельзя назначить ведущим.

# AXTopLevelSource
source: Top-level Windows Forms control cannot be exposed as an ActiveX control.
sr: Элемент управления верхнего уровня Windows Forms не может отображаться как элемент управления ActiveX.

# AXUnknownError
source: Unknown error.
sr: Неизвестная ошибка.

# AXUnknownImage
source: Unknown image type.
sr: Неизвестный тип изображения.

# AXWindowlessControl
source: ActiveX control is a windowless control. The control is not supported in this version of the .NET.
sr: Элемент управления ActiveX является неоконным и не поддерживается в этой версии .NET.

# AboutBoxDesc
source: Displays the 'About' box for this component
sr: Отображает окно 'О программе' для этого компонента

# AccDGCollapse
source: Collapse
sr: Свернуть

# AccDGEdit
source: Edit
sr: Редактировать

# AccDGExpand
source: Expand
sr: Развертывание

# AccDGNavigate
source: Navigate
sr: Перейти

# AccDGNavigateBack
source: Navigate Back
sr: Переход назад

# AccDGNewRow
source: (Create New)
sr: (Создать новый)

# AccDGParentRow
source: Parent Row
sr: Родительская строка

# AccDGParentRows
source: Parent Rows
sr: Родительские строки

# AccessibleActionCheck
source: Check
sr: Пометить

# AccessibleActionClick
source: Click
sr: Щелчок

# AccessibleActionCollapse
source: Collapse
sr: Свернуть

# AccessibleActionExpand
source: Expand
sr: Развертывание

# AccessibleActionPress
source: Press
sr: Нажать

# AccessibleActionUncheck
source: Uncheck
sr: Снять пометку

# AccessibleObjectLiveRegionNotSupported
source: The corresponding UI element is not a live region.
sr: Соответствующий элемент пользовательского интерфейса не является динамической областью.

# AddDifferentThreads
source: Controls created on one thread cannot be parented to a control on a different thread.
sr: Элементы управления, созданные в одном потоке, не могут быть родительскими для элемента управления в другом потоке.

# ApplicationCannotChangeApplicationExceptionMode
source: Application exception mode cannot be changed once any Controls are created in the application.
sr: Режим исключений приложения нельзя изменить, если в приложении были созданы элементы управления.

# ApplicationCannotChangeThreadExceptionMode
source: Thread exception mode cannot be changed once any Controls are created on the thread.
sr: Режим исключений потоков нельзя изменить, если в потоке были созданы элементы управления.

# ApplyCaption
source: &Apply
sr: &Применить

# ArraysNotSameSize
source: Arrays '{0}' and '{1}' must be the same size.
sr: Массивы '{0}' и '{1}' должны быть одинакового размера.

# AutoCompleteFailure
source: autoComplete cannot be initialized with given custom source.
sr: Невозможно инициализировать autoComplete с данным пользовательским источником.

# AutoCompleteFailureListItems
source: autoComplete cannot be initialized with the list items.
sr: Невозможно инициализировать autoComplete с элементами списка.

# AxInterfaceNotSupported
source: Interface is not supported.
sr: Интерфейс не поддерживается.

# BadDataSourceForComplexBinding
source: Complex DataBinding accepts as a data source either an IList or an IListSource.
sr: Для составного DataBinding источником данных может служить IList или IListSource.

# BindingManagerBadIndex
source: ListManager for {0} cannot be found.
sr: ListManager для {0} не найден.

# BindingNavigatorAddNewItemPropDescr
source: The ToolStripItem on the BindingNavigator that raises the 'Add new' action.
sr: ToolStripItem для BindingNavigator, вызывающий действие "Добавить новый элемент".

# BindingNavigatorAddNewItemText
source: Add new
sr: Добавить

# BindingNavigatorBindingSourcePropDescr
source: The BindingSource that the BindingNavigator navigates.
sr: BindingSource, по которому осуществляет навигацию BindingNavigator.

# BindingNavigatorCountItemFormat
source: of {0}
sr: из {0}

# BindingNavigatorCountItemFormatPropDescr
source: Formatting to apply to count displayed in the CountItem ToolStrip item.
sr: Форматирование, применяемое к счетчику, отображенному в элементе ToolStrip CountItem.

# BindingNavigatorCountItemPropDescr
source: The ToolStripItem on the BindingNavigator that displays the total number of items.
sr: ToolStripItem для BindingNavigator, отображающий общее число элементов.

# BindingNavigatorCountItemTip
source: Total number of items
sr: Общее число элементов

# BindingNavigatorDeleteItemPropDescr
source: The ToolStripItem on the BindingNavigator that raises the 'Delete' action.
sr: ToolStripItem для BindingNavigator, вызывающий действие "Удалить".

# BindingNavigatorDeleteItemText
source: Delete
sr: Удалить

# BindingNavigatorMoveFirstItemPropDescr
source: The ToolStripItem on the BindingNavigator that raises the 'Move first' action.
sr: ToolStripItem для BindingNavigator, вызывающий действие "Переместить в начало".

# BindingNavigatorMoveFirstItemText
source: Move first
sr: Переместить в начало

# BindingNavigatorMoveLastItemPropDescr
source: The ToolStripItem on the BindingNavigator that raises the 'Move last' action.
sr: ToolStripItem для BindingNavigator, вызывающий действие "Переместить в конец".

# BindingNavigatorMoveLastItemText
source: Move last
sr: Переместить в конец

# BindingNavigatorMoveNextItemPropDescr
source: The ToolStripItem on the BindingNavigator that raises the 'Move next' action.
sr: ToolStripItem для BindingNavigator, вызывающий действие "Переместить вперед".

# BindingNavigatorMoveNextItemText
source: Move next
sr: Переместить вперед

# BindingNavigatorMovePreviousItemPropDescr
source: The ToolStripItem on the BindingNavigator that raises the 'Move previous' action.
sr: ToolStripItem для BindingNavigator, вызывающий действие "Переместить назад".

# BindingNavigatorMovePreviousItemText
source: Move previous
sr: Переместить назад

# BindingNavigatorPositionAccessibleName
source: Position
sr: Положение

# BindingNavigatorPositionItemPropDescr
source: The ToolStripItem on the BindingNavigator that displays the current position.
sr: ToolStripItem для BindingNavigator, отображающий текущее положение.

# BindingNavigatorPositionItemTip
source: Current position
sr: Текущее положение

# BindingNavigatorRefreshItemsEventDescr
source: Event raised when BindingNavigator ToolStrip items need to be refreshed to reflect current state of data.
sr: Событие, вызываемое при необходимости обновления элементов BindingNavigator ToolStrip для отображения текущего состояния данных.

# BindingNavigatorToolStripName
source: Binding Navigator
sr: Привязка Navigator

# BindingSourceAddingNewEventHandlerDescr
source: Event raised when the user calls AddNew on the BindingSource
sr: Событие, возникающее, когда пользователь вызывает метод AddNew для BindingSource

# BindingSourceAllowNewDescr
source: Determines whether the BindingSource allows new items to be added to the list.
sr: Определяет, позволяет ли BindingSource добавление новых элементов к списку.

# BindingSourceBadSortString
source: Sort string not valid.
sr: Недопустимая строка сортировки.

# BindingSourceBindingCompleteEventHandlerDescr
source: Event raised after data has been exchanged between the data source and a control property bound to that data source.
sr: Событие, возникающее после обмена данными между источником данных и свойством элемента управления, привязанным к этому источнику данных.

# BindingSourceBindingListWrapperAddToReadOnlyList
source: Item cannot be added to a read-only or fixed-size list.
sr: Добавление элемента к списку фиксированного размера или списку, предназначенному только для чтения, невозможно.

# BindingSourceBindingListWrapperNeedAParameterlessConstructor
source: AddNew cannot be called on the '{0}' type. This type does not have a public default constructor. You can call AddNew on the '{0}' type if you handle the AddingNew event and create the appropriate object.
sr: Вызов AddNew для типа '{0}' невозможен. У данного типа нет публичного конструктора по умолчанию. Вызов AddNew для типа '{0}' возможен после обработки события AddingNew и создания соответствующего объекта.

# BindingSourceBindingListWrapperNeedToSetAllowNew
source: AddNew cannot be called on the '{0}' type. This type does not have a public default constructor. You can call AddNew on the '{0}' type if you set AllowNew=true and handle the AddingNew event.
sr: Вызов AddNew для типа '{0}' невозможен. У данного типа нет публичного конструктора по умолчанию. Вызов AddNew для типа '{0}' допускается после установки AllowNew=true и обработки события AddingNew.

# BindingSourceCurrentChangedEventHandlerDescr
source: Event raised when the value of Current changes.
sr: Событие, вызываемое при изменении значения Current.

# BindingSourceCurrentItemChangedEventHandlerDescr
source: Event raised when the value of Current changes, or a property of the current item changes.
sr: Событие, вызываемое при изменении значения Current или свойства текущего элемента.

# BindingSourceDataErrorEventHandlerDescr
source: Event raised when an exception thrown during data binding is handled internally by the CurrencyManager.
sr: Событие, вызываемое, когда во время связывания данных возникает исключение, обрабатываемое внутри с помощью CurrencyManager.

# BindingSourceDataMemberChangedEventHandlerDescr
source: Event raised when the DataMember changes.
sr: Событие, вызываемое при изменении DataMember.

# BindingSourceDataMemberDescr
source: Indicates a sub-list of the DataSource that the BindingSource is bound to.
sr: Указывает подсписок DataSource, к которому привязан BindingSource.

# BindingSourceDataSourceChangedEventHandlerDescr
source: Event raised when the DataSource changes.
sr: Событие, вызываемое при изменении DataSource.

# BindingSourceDataSourceDescr
source: Indicates the source of data for the BindingSource.
sr: Указывает источник данных для BindingSource.

# BindingSourceFilterDescr
source: Indicates a database column expression used to filter the set of rows returned by the data source.
sr: Указывает выражение столбца базы данных, используемое для фильтрации набора строк, возвращаемых источником данных.

# BindingSourceInstanceError
source: BindingSource unable to create list based on the Type specified in the DataSource property.
sr: BindingSource не удается создать список на основе значения Type, указанного в свойстве DataSource.

# BindingSourceItemChangedEventModeDescr
source: Controls how the BindingSource raises the ListChanged event as a result of changing an item in the BindingSource.
sr: Определяет, как BindingSource вызывает событие ListChanged в результате изменения элемента в BindingSource.

# BindingSourceItemTypeIsValueType
source: Cannot add null to BindingSource if the underlying list stores value types.
sr: Если в основном списке сохраняются типы значений, добавление пустого значения в BindingSource невозможно.

# BindingSourceItemTypeMismatchOnAdd
source: Objects added to a BindingSource's list must all be of the same type.
sr: Объекты, добавляемые к списку BindingSource, должны быть одного типа.

# BindingSourceListChangedEventHandlerDescr
source: Event raised when a change occurs in the BindingSource's list.
sr: Событие, вызываемое при изменении в списке BindingSource.

# BindingSourcePositionChangedEventHandlerDescr
source: Event raised when the value of Position changes.
sr: Событие, вызываемое при изменении значения свойства Position.

# BindingSourceRecursionDetected
source: BindingSource cannot be its own data source. Do not set the DataSource and DataMember properties to values that refer back to BindingSource.
sr: BindingSource не может быть источником данных для самого себя. Для свойств DataSource и DataMember нельзя устанавливать значения, ссылающиеся на BindingSource.

# BindingSourceRemoveCurrentNoCurrentItem
source: Current item cannot be removed from the list because there is no current item.
sr: Удаление текущего элемента из списка невозможно, так как текущий элемент отсутствует.

# BindingSourceRemoveCurrentNotAllowed
source: Current item cannot be removed from the list because the list does not allow removal of items.
sr: Текущий элемент нельзя удалить из списка, так как удаление элементов из данного списка не допускается.

# BindingSourceSortDescr
source: Indicates names of database columns used to sort the set of rows returned by the data source.
sr: Указывает имена столбцов базы данных, используемых для сортировки набора строк, возвращаемых источником данных.

# BindingSourceSortStringPropertyNotInIBindingList
source: Sort string contains a property that is not in the IBindingList.
sr: Строка сортировки содержит свойство, которое отсутствует в списке IBindingList.

# BindingsCollectionAdd1
source: dataBinding already belongs to this BindingsCollection.
sr: dataBinding уже принадлежит данному BindingsCollection.

# BindingsCollectionAdd2
source: dataBinding belongs to another BindingsCollection.
sr: dataBinding принадлежит другому BindingsCollection.

# BindingsCollectionBadIndex
source: Binding {0 } cannot be found.
sr: Связывание {0 } не найдено.

# BindingsCollectionDup
source: This causes two bindings in the collection to bind to the same property.
sr: Два связывания в коллекции привязываются к одному свойству.

# BindingsCollectionForeign
source: Binding does not belong to this BindingsCollection.
sr: Связывание не принадлежит к данной коллекции BindingsCollection.

# BlinkRateMustBeZeroOrMore
source: BlinkRate must be zero or greater. Negative values are not permitted.
sr: Значение BlinkRate не должно быть меньше нуля. Отрицательные значения не разрешены.

# ButtonAutoEllipsisDescr
source: Enables the automatic handling of text that extends beyond the width of the button.
sr: Включает автоматическую обработку текста, превосходящего ширину кнопки.

# ButtonBorderColorDescr
source: For buttons whose FlatStyle is FlatStyle.Flat, this property specifies the color of the border around the button.
sr: Для кнопок с FlatStyle, равным FlatStyle.Flat, данное свойство определяет цвет границы вокруг кнопки.

# ButtonBorderSizeDescr
source: For buttons whose FlatStyle is FlatStyle.Flat, this property specifies the size, in pixels, of the border around the button.
sr: Для кнопок с FlatStyle, равным FlatStyle.Flat, данное свойство определяет размер (в пикселях) границы вокруг кнопки.

# ButtonCheckedBackColorDescr
source: For buttons whose FlatStyle is FlatStyle.Flat, this property specifies the color of the client area of the button when the button is checked and the mouse pointer is outside the bounds of the control.
sr: Для кнопок с FlatStyle, равным FlatStyle.Flat, данное свойство определяет цвет клиентской области кнопки, когда кнопка находится в фокусе и указатель мыши находится вне границ элемента управления.

# ButtonDialogResultDescr
source: The dialog-box result produced in a modal form by clicking the button.
sr: Результат диалогового окна показывается в модальной форме после нажатия клавиши.

# ButtonFlatAppearance
source: For buttons whose FlatStyle is FlatStyle.Flat, determines the appearance of the border and the colors used to indicate check state and mouse state.
sr: Для кнопок с FlatStyle, равным FlatStyle.Flat, определяет внешний вид границы и цвета, используемых для указания состояния, когда кнопка находится в фокусе и на нее наведен указатель мыши.

# ButtonFlatAppearanceInvalidBorderColor
source: ButtonBase controls do not support setting the BorderColor to Transparent.
sr: Элементы управления ButtonBase не поддерживают установку для BorderColor значения Transparent.

# ButtonFlatStyleDescr
source: Determines the appearance of the control when a user moves the mouse over the control and clicks.
sr: Определяет внешний вид элемента управления при наведении указателя мыши и щелчке элементе управления.

# ButtonImageAlignDescr
source: The alignment of the image that will be displayed on the control.
sr: Выравнивание изображения, которое будет отображаться на данном элементе управления.

# ButtonImageDescr
source: The image that will be displayed on the control.
sr: Изображение, которое будет отображаться на данном элементе управления.

# ButtonImageIndexDescr
source: The index of the image in the ImageList to display on the control.
sr: Индекс изображения, которое будет отображаться на данном элементе управления, в списке изображений ImageList.

# ButtonImageListDescr
source: The ImageList to get the image to display on the control.
sr: Список изображений ImageList, из которого извлекается изображение для отображения на данном элементе управления.

# ButtonMouseDownBackColorDescr
source: For buttons whose FlatStyle is FlatStyle.Flat, this property specifies the color of the client area of the button when the mouse is pressed within the bounds of the control.
sr: Для кнопок с FlatStyle, равным FlatStyle.Flat, данное свойство определяет цвет клиентской области кнопки при щелчке мышью в пределах границ элемента управления.

# ButtonMouseOverBackColorDescr
source: For buttons whose FlatStyle is FlatStyle.Flat, this property specifies the color of the client area of the button when the mouse pointer is within the bounds of the control.
sr: Для кнопок с FlatStyle, равным FlatStyle.Flat, данное свойство определяет цвет клиентской области кнопки при наведении указателя мыши на элемент управления.

# ButtonTextAlignDescr
source: The alignment of the text that will be displayed on the control.
sr: Выравнивание текста, который будет отображаться на данном элементе управления.

# ButtonTextImageRelationDescr
source: Specifies the relative location of the image to the text on the button.
sr: Определяет положение изображения относительно текста на кнопке.

# ButtonUseMnemonicDescr
source: If true, the first character preceded by an ampersand (&&) will be used as the button's mnemonic key.
sr: При значении true первый знак, перед которым стоит амперсант (&&), будет использоваться как мнемоническая клавиша этой кнопки.

# ButtonUseVisualStyleBackColorDescr
source: Determines whether the background is drawn using visual styles, if visual styles are supported.
sr: Определяет, используются ли визуальные стили при создании фона (если визуальные стили поддерживаются).

# CDallowFullOpenDescr
source: Enables and disables the Define Custom Colors button.
sr: Включает и отключает кнопку 'Определить цвет'.

# CDanyColorDescr
source: Indicates whether the dialog box displays all available colors in the set of basic colors.
sr: Определяет, отображаются ли в диалоговом окне все доступные цвета в наборе базовых цветов.

# CDcolorDescr
source: The color selected in the dialog box.
sr: Цвет, выбранный в диалоговом окне.

# CDcustomColorsDescr
source: The custom set of colors shown in the dialog box.
sr: Особый набор цветов, отображаемый в диалоговом окне.

# CDfullOpenDescr
source: Controls whether the custom color section of the dialog box is initially displayed.
sr: Определяет, указывается ли в исходном диалоговом окне секция пользовательских цветов.

# CDshowHelpDescr
source: Controls whether the Help button is displayed.
sr: Определяет, отображается ли кнопка 'Справка'.

# CDsolidColorOnlyDescr
source: Indicates whether the dialog box will restrict users to only selecting solid colors.
sr: Определяет, ограничен ли выбор в диалоговом окне только чистыми цветами.

# COM2BadHandlerType
source: Handler type ({0} != {1}) is not valid.
sr: Недопустимый тип обработчика ({0} != {1}).

# COM2NamesAndValuesNotEqual
source: Names and values must be non-null and of same length.
sr: Имена и значения не должны быть неопределенными и должны иметь одинаковую длину.

# COM2ReadonlyProperty
source: Property {0} is read-only.
sr: Свойство {0} доступно только для чтения.

# COM2UnhandledVT
source: Unhandled VT: {0}.
sr: Необработанный VT: {0}.

# CancelCaption
source: Cancel
sr: Отмена

# CannotActivateControl
source: Invisible or disabled control cannot be activated
sr: Активация невидимого или отключенного элемента управления невозможна
