Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# CannotChangePrintedDocument
source: You cannot alter the document or add to it once you have printed it.
sr: После печати внесение изменений или добавление данных в документ невозможно.

# CannotConvertDoubleToDate
source: Double cannot be converted to a date.
sr: Тип double нельзя привести к типу date.

# CannotConvertIntToFloat
source: Integer cannot be converted to a float.
sr: Тип integer нельзя привести к типу float.

# CantNestMessageLoops
source: Starting a second message loop on a single thread is not a valid operation. Use Form.ShowDialog instead.
sr: Запуск второго цикла сообщения в единичном потоке является недопустимой операцией. Вместо этого используйте Form.ShowDialog.

# CantShowMBServiceWithHelp
source: Showing a service notification message box with a Help button is not a valid operation.
sr: Показ окна служебного уведомления с кнопкой "Справка" является недопустимой операцией.

# CantShowMBServiceWithOwner
source: Showing a service notification message box with an owner window is not a valid operation. Use the Show method that does not take an owner.
sr: Показ окна служебного уведомления с окном владельца является недопустимой операцией. Вместо этого используйте метод Show, не использующий владельца.

# CantShowModalOnNonInteractive
source: Showing a modal dialog box or form when the application is not running in UserInteractive mode is not a valid operation. Specify the ServiceNotification or DefaultDesktopOnly style to display a notification from a service application.
sr: Показ модального диалогового окна или формы является допустимой операцией, только если приложение запущено в режиме UserInteractive. Для отображения уведомления из служебного приложения укажите стиль ServiceNotification или DefaultDesktopOnly.

# CatAccessibility
source: Accessibility
sr: Специальные возможности

# CatAction
source: Action
sr: Действие

# CatAppearance
source: Appearance
sr: Внешний вид

# CatAsynchronous
source: Asynchronous
sr: Асинхронный

# CatBehavior
source: Behavior
sr: Поведение

# CatColors
source: Colors
sr: Цвета

# CatData
source: Data
sr: Данные

# CatDisplay
source: Display
sr: Экран

# CatDragDrop
source: Drag Drop
sr: Перетащить и отпустить

# CatFocus
source: Focus
sr: Фокус

# CatFolderBrowsing
source: Folder Browsing
sr: Просмотр папок

# CatItems
source: Items
sr: Элементы

# CatKey
source: Key
sr: Ключ

# CatLayout
source: Layout
sr: Макет

# CatMouse
source: Mouse
sr: Мышь

# CatPrivate
source: Private
sr: Частный

# CatPropertyChanged
source: Property Changed
sr: Свойство изменено

# CatWindowStyle
source: Window Style
sr: Стиль окна

# CheckBoxAppearanceDescr
source: Controls the appearance of the check box.
sr: Определяет внешний вид флажка проверки.

# CheckBoxAutoCheckDescr
source: Causes the check box to automatically change state when clicked.
sr: Вызывает автоматическое изменение состояния флажка при его выборе.

# CheckBoxCheckAlignDescr
source: Determines the location of the check box inside the control.
sr: Определяет местоположение данного флажка проверки в элементе управления.

# CheckBoxCheckStateDescr
source: Indicates the state of the component.
sr: Определяет состояние компонента.

# CheckBoxCheckedDescr
source: Indicates whether the component is in the checked state.
sr: Указывает, находится ли компонент в состоянии проверки.

# CheckBoxOnAppearanceChangedDescr
source: Event raised when the value of the Appearance property is changed on CheckBox.
sr: Событие вызывается при изменении значения свойства Appearance для CheckBox.

# CheckBoxOnCheckStateChangedDescr
source: Occurs whenever the CheckState property is changed.
sr: Происходит при каждом изменении свойства CheckState.

# CheckBoxOnCheckedChangedDescr
source: Occurs whenever the Check property is changed.
sr: Возникает при каждом изменении свойства Check.

# CheckBoxThreeStateDescr
source: Indicates whether the CheckBox will allow three check states rather than two.
sr: Определяет, позволяет ли CheckBox использование трех состояний переключателя вместо двух.

# CheckedListBoxCheckOnClickDescr
source: Indicates if the check box should be toggled with the first click on an item.
sr: Указывает, должен ли флажок проверки изменять состояние при первом выборе данного элемента указателем мыши.

source: CheckedListBox.CheckedIndexCollection is read only.
sr: CheckedListBox.CheckedIndexCollection предназначено только для чтения.

source: CheckedListBox.CheckedItemCollection is read only.
sr: CheckedListBox.CheckedItemCollection предназначено только для чтения.

# CheckedListBoxInvalidSelectionMode
source: Multi-selection is not supported on CheckedListBox.
sr: Выбор нескольких элементов одновременно для CheckedListBox не поддерживается.

# CheckedListBoxItemCheckDescr
source: Indicates that an item is about to have its checked state changed. The value is not updated until after the event occurs.
sr: Указывает на предстоящее изменение состояния проверки элемента управления. Обновление значения происходит только после возникновения события.

# CheckedListBoxThreeDCheckBoxesDescr
source: Indicates whether check boxes have a ButtonState of Flat or Normal.
sr: Указывает, какое значение выбрано для свойства ButtonState флаговых кнопок (Flat или Normal).

# CircularOwner
source: A circular control reference has been made. A control cannot be owned by or parented to itself.
sr: Создана циклическая ссылка на элемент управления. Элемент управления не может являться владельцем или родителем для самого себя.

# ClipboardOperationFailed
source: Requested Clipboard operation did not succeed.
sr: Сбой при выполнении запрошенной операции с буфером обмена.

# ClipboardSecurityException
source: Due to security restrictions on clipboard, the specified clipboard format cannot be set.
sr: Установка указанного формата буфера обмена не допускается ограничениями по безопасности.

# Clipboard_InvalidPath
source: Path "{0}" in the argument "{1}" is not valid.
sr: Недопустимый путь "{0}" в аргументе "{1}".

# CloseCaption
source: Close
sr: Закрыть

# ClosingWhileCreatingHandle
source: Value {0}() cannot be called while doing CreateHandle().
sr: Вызов значения {0}() во время выполнения CreateHandle() невозможен.

# CollectionEmptyException
source: Cannot operate with an empty collection.
sr: Работа с пустой коллекцией невозможна.

# ColumnAlignment
source: Indicates the horizontal alignment of the text displayed in the column header.
sr: Указывает горизонтальное выравнивание текста, отображаемого в заголовке столбца.

# ColumnCaption
source: The text displayed in the column header.
sr: Текст, отображаемый в заголовке столбца.

# ColumnHeaderBadDisplayIndex
source: DisplayIndex value is out of bounds. Value must be greater than or equal to 0 and less than or equal to number of columns minus 1.
sr: Значение DisplayIndex лежит вне границ заданного диапазона. Значение должно быть больше или равно нулю и меньше или равно числу столбцов минус 1.

# ColumnHeaderCollectionInvalidArgument
source: Argument must be of type ColumnHeader.
sr: Аргумент должен иметь тип ColumnHeader.

# ColumnHeaderDisplayIndexDescr
source: The display index of the column
sr: Отображаемый индекс столбца

# ColumnHeaderNameDescr
source: The name of the column header.
sr: Имя заголовка столбца.

# ColumnWidth
source: The visual width of the column in pixels.
sr: Видимая ширина столбца в пикселях.

# CombinationOfAccessibilitySwitchesNotSupported
source: Desktop applications are required to opt in to all earlier accessibility improvements to get the later improvements. To do this, ensure that if the AppContext switch 'Switch.UseLegacyAccessibilityFeatures.N' is set to 'false', then 'Switch.UseLegacyAccessibilityFeatures' and all 'Switch.UseLegacyAccessibilityFeatures.M' switches, when M < N, evaluate to false as well. Note that, if a switch for a particular set of accessibility improvements is not present, its value is determined by the target framework version. You can remedy this by adding these switches and setting their value to false.
sr: Классические приложения должны активировать все предыдущие специальные возможности, чтобы получить последующие улучшения. Для этого в случае, когда параметр AppContext "Switch.UseLegacyAccessibilityFeatures.N" имеет значение False, "Switch.UseLegacyAccessibilityFeatures" и все параметры "Switch.UseLegacyAccessibilityFeatures.M" также должны иметь значение False, если M < N. Обратите внимание, что если параметр для конкретного набора улучшений специальных возможностей отсутствует, его значение определяется версией целевой платформы. Исправить это можно, добавив параметры и задав значение False.

# ComboBoxAutoCompleteCustomSourceDescr
source: The autocomplete custom source, which is a custom StringCollection used when the AutoCompleteSource is CustomSource.
sr: Пользовательский источник автозаполнения, являющийся пользовательской коллекцией StringCollection, которая используется, когда значение параметра AutoCompleteSource равно CustomSource.

# ComboBoxAutoCompleteModeDescr
source: Indicates the text completion behavior of the combo box.
sr: Определяет, как происходит заполнение текстом в поле со списком.

# ComboBoxAutoCompleteModeOnlyNoneAllowed
source: Only the value AutoCompleteMode.None can be used when DropDownStyle is ComboBoxStyle.DropDownList and AutoCompleteSource is not AutoCompleteSource.ListItems.
sr: Если для DropDownStyle задано ComboBoxStyle.DropDownList, а для AutoCompleteSource не задано AutoCompleteSource.ListItems, может использоваться только значение AutoCompleteMode.None.

# ComboBoxAutoCompleteSourceDescr
source: The source of complete strings used for automatic completion.
sr: Источник полных строк, используемый при автоматическом заполнении.

# ComboBoxAutoCompleteSourceOnlyListItemsAllowed
source: Only the value AutoCompleteSource.ListItems can be used when DropDownStyle is ComboBoxStyle.DropDownList and AutoCompleteMode is not AutoCompleteMode.None.
sr: Если для DropDownStyle задано ComboBoxStyle.DropDownList, а для AutoCompleteMode не задано AutoCompleteMode.None, может использоваться только значение AutoCompleteSource.ListItems.

# ComboBoxDataSourceWithSort
source: DataSource cannot be set in a combo box that is sorted.
sr: DataSource нельзя установить в сортируемом поле со списком.

# ComboBoxDrawModeDescr
source: Indicates whether the code or the operating system will handle drawing of elements in the list.
sr: Указывает, будет ли прорисовка элементов списка управляться операционной системой.

# ComboBoxDropDownHeightDescr
source: The height, in pixels, of the drop-down box in a combo box.
sr: Высота (в пикселях) раскрывающегося списка в поле со списком.

# ComboBoxDropDownStyleChangedDescr
source: Occurs when the value of the DropDownStyle property changes.
sr: Возникает при изменении значения свойства DropDownStyle.

# ComboBoxDropDownWidthDescr
source: The width, in pixels, of the drop-down box in a combo box.
sr: Ширина (в пикселях) раскрывающегося списка в поле со списком.

# ComboBoxDroppedDownDescr
source: Indicates if the combo box is currently dropped down.
sr: Показывает, развернут ли список в комбинированном окне в данный момент.

# ComboBoxFlatStyleDescr
source: Determines the display of the control.
sr: Определяет внешний вид элемента управления.

# ComboBoxIntegralHeightDescr
source: Indicates whether the combo box should resize to avoid showing partial items.
sr: Указывает, должен ли изменяться размер комбинированного окна во избежание отображения неполных элементов.

# ComboBoxItemHeightDescr
source: The height, in pixels, of items in an owner-draw combo box.
sr: Высота элементов (в пикселях) в прорисовываемом владельцем комбинированном окне.

# ComboBoxItemOverflow
source: Too many items in the combo box.
sr: В комбинированном окне содержится недопустимо большое число элементов.

# ComboBoxItemsDescr
source: The items in the combo box.
sr: Элементы в данном комбинированном окне.

# ComboBoxMaxDropDownItemsDescr
source: The maximum number of entries to display in the drop-down list.
sr: Максимальное число записей, отображаемых в раскрывающемся списке.

# ComboBoxMaxLengthDescr
source: Specifies the maximum number of characters that can be entered into the combo box.
sr: Задает максимальное число символов, которые можно ввести в комбинированном окне.

# ComboBoxOnDropDownClosedDescr
source: Indicates that the drop-down portion of the combo box has closed.
sr: Указывает, что раскрывающийся список в поле со списком свернут.

# ComboBoxOnDropDownDescr
source: Occurs when the drop-down portion of the combo box is shown.
sr: Указывает, что раскрывающийся список в поле со списком развернут.

# ComboBoxOnTextUpdateDescr
source: Occurs when the combo box text has changed.
sr: Возникает при изменении текста в поле со списком.

# ComboBoxPreferredHeightDescr
source: The preferred height of this control.
sr: Предпочтительная высота данного элемента управления.

# ComboBoxSelectedIndexDescr
source: The index of the currently selected item of the combo box.
sr: Индекс выбранного элемента поля со списком.

# ComboBoxSelectedItemDescr
source: The currently selected item in the combo box, or null.
sr: Текущий выбранный элемент комбинированного окна или неопределенное значение.

# ComboBoxSelectedTextDescr
source: The selected text in the edit component of the combo box.
sr: Выбранный текст в поле редактирования комбинированного окна.

# ComboBoxSelectionLengthDescr
source: The length of the selected text in the edit component of the combo box.
sr: Длина выбранного текста в поле редактирования поля со списком.

# ComboBoxSelectionStartDescr
source: The index of the first character in the selected text.
sr: Индекс первого символа в выбранном тексте.

# ComboBoxSortWithDataSource
source: ComboBox that has a DataSource set cannot be sorted. Sort the data using the underlying data model.
sr: Сортировка ComboBox, для которого определен DataSource, невозможна. Для сортировки данных используйте базовую модель данных.

# ComboBoxSortedDescr
source: Specifies whether items in the list portion of the combo box are sorted.
sr: Определяет, сортируются ли элементы в списке поля со списком.

# ComboBoxStyleDescr
source: Controls the appearance and functionality of the combo box.
sr: Управляет внешним видом и функционированием данного комбинированного окна.

# ComboBoxValueSelectedFormat
source: {0} selected
sr: Выбрано: {0}.

# CommandIdNotAllocated
source: New command ID cannot be allocated.
sr: Выделение нового идентификатора команды невозможно.

# CommonDialogHelpRequested
source: Occurs when the user clicks the Help button.
sr: Происходит, когда пользователь нажимает кнопку 'Справка'.

# ComponentEditorFormBadComponent
source: Parameter must be of type IComponent.
sr: Параметр должен иметь тип IComponent.

# ComponentEditorFormProperties
source: {0} Properties
sr: Свойства - {0}

# ComponentEditorFormPropertiesNoName
source: Properties
sr: Свойства

# ComponentManagerProxyOutOfMemory
source: Unable to register the IMsoComponent. The maximum number of registered IMsoComponents has been reached.
sr: Регистрация компонента IMsoComponent невозможна. Достигнуто максимальное число зарегистрированных компонентов IMsoComponent.

# Config_base_unrecognized_attribute
source: Server cannot recognize the attribute {0}.
sr: Серверу не удалось распознать атрибут {0}.

# ConnPointAdviseFailed
source: IConnectionPoint::Advise did not succeed with hr=0x{0:X} for event interface {1}.
sr: Выполнение IConnectionPoint::Advise с hr=0x{0:X} для интерфейса события {1} невозможно.

# ConnPointCouldNotCreate
source: Connection point for event interface '{0}' cannot be created.
sr: Невозможно создать точку подключения для интерфейса события '{0}'.

# ConnPointSinkIF
source: Sink object does not implement the event interface.
sr: В объекте sink не реализован интерфейс события.

# ConnPointSourceIF
source: Source object does not expose the {0} event interface.
sr: Исходный объект не предоставляет интерфейс события '{0}'.

# ConnPointUnhandledType
source: Unhandled type {0}.
sr: Необработанный тип {0}.

# ContainerControlActiveControlDescr
source: The currently active control.
sr: Активный в текущий момент элемент управления.

# ContainerControlAutoScaleModeDescr
source: Determines how the form or control will scale when screen resolution or fonts change.
sr: Определяет изменение масштаба формы или элемента управления при изменении разрешения экрана или шрифтов.

# ContainerControlAutoValidate
source: Indicates whether controls in the container will be automatically validated when the focus changes.
sr: Определяет, проходят ли элементы управления автоматическую проверку при изменении фокуса.

# ContainerControlBindingContextDescr
source: The binding manager for the container control. This manages all bindings of child controls to lists.
sr: Диспетчер привязок для вмещающего элемента управления. Он управляет всеми привязками дочерних элементов управления к спискам.

# ContainerControlInvalidAutoScaleDimensions
source: The width and height of AutoScaleDimensions must be greater than or equal to zero.
sr: Ширина и высота AutoScaleDimensions должны быть больше или равны нулю.

# ContainerControlOnAutoValidateChangedDescr
source: Occurs whenever the AutoValidate property is changed.
sr: Возникает при изменении свойства AutoValidate.

# ContainerControlParentFormDescr
source: The parent form of this container control.
sr: Родительская форма данного вмещающего элемента управления.

# ControlAccessibileObjectInvalid
source: Control's accessible object is in an invalid state.
sr: Доступный объект элемента управления в недействительном состоянии.

# ControlAccessibilityObjectDescr
source: The accessibility object for this control.
sr: Объект специальных возможностей для этого элемента управления.

# ControlAccessibleDefaultActionDescr
source: The default action description of the control.
sr: Описание действия по умолчанию для данного элемента управления.

# ControlAccessibleDescriptionDescr
source: The description that will be reported to accessibility clients.
sr: Описание, текст которого будет передаваться клиентам специальных возможностей.

# ControlAccessibleNameDescr
source: The name that will be reported to accessibility clients.
sr: Имя, которое будет сообщаться клиентам специальных возможностей.

# ControlAccessibleRoleDescr
source: The role that will be reported to accessibility clients.
sr: Роль, которая будет сообщаться клиентам специальных возможностей.

# ControlAllowDropDescr
source: Indicates whether the control can accept data that the user drags onto it.
sr: Указывает, может ли пользователь перетащить данные в элемент управления.

# ControlAllowTransparencyDescr
source: Indicates whether the opacity of the control can be adjusted.
sr: Указывает, можно ли изменять прозрачность данного элемента управления.

# ControlAnchorDescr
source: Defines the edges of the container to which a certain control is bound. When a control is anchored to an edge, the distance between the control's closest edge and the specified edge will remain constant.
sr: Определяет грани контейнера, к которому привязан определенный элемент управления. Если элемент управления привязан к определенной грани, расстояние между ближним краем элемента управления и указанной гранью постоянно.

# ControlArrayCannotAddComponentArray
source: Instance '{0}' cannot be added. This instance is of a ComponentArrayBase type.
sr: Добавление экземпляра '{0}' невозможно. Этот экземпляр имеет тип ComponentArrayBase.

# ControlArrayCannotPerformAddCopy
source: Cannot perform ControlArray.AddCopy() because the ControlArray is empty. Add the control you want copied to the first position in the ControlArray.
sr: Выполнение ControlArray.AddCopy() невозможно, так как ControlArray пуст. Скопируйте нужный элемент управления в первую позицию массива ControlArray.

# ControlArrayCloningException
source: Instance '{0}' must have a default constructor or one without parameters to be copied by the ControlArray.
sr: Экземпляр '{0}' должен иметь конструктор по умолчанию или конструктор без параметров, чтобы его можно было скопировать с помощью ControlArray.

# ControlArrayDuplicateException
source: Instance '{0}' cannot be added. This instance already exists in the ControlArray '{1}'.
sr: Добавление экземпляра '{0}' невозможно. Данный экземпляр уже присутствует в массиве ControlArray '{1}'.

# ControlArrayValidationException
source: Type of '{0}' cannot be added to ControlArray. Type of '{1}', or a type derived from that type, is expected.
sr: Добавление типа '{0}' в ControlArray невозможно. Следует указать тип '{1}' либо тип, который является производным от этого типа.

# ControlAutoRelocateDescr
source: Specifies whether the control will be auto-relocated in response to the movement of peer controls.
sr: Определяет, будет ли элемент управления автоматически перемещен при перемещении одноранговых элементов управления.

# ControlAutoSizeDescr
source: Specifies whether a control will automatically size itself to fit its contents.
sr: Определяет, будет ли размер элемента управления автоматически изменяться в соответствии с размером его содержимого.

# ControlAutoSizeModeDescr
source: Specifies the mode by which the user interface element automatically resizes itself.
sr: Определяет режим автоматического изменения размера элемента интерфейса пользователя.

# ControlBackColorDescr
source: The background color of the component.
sr: Фоновый цвет компонента.

# ControlBackgroundImageDescr
source: The background image used for the control.
sr: Фоновое изображение для элемента управления.

# ControlBackgroundImageLayoutDescr
source: The background image layout used for the component.
sr: Макет фонового изображения, используемый для компонента.

# ControlBadAsyncResult
source: Parameter must be of type ThreadMethodEntry.
sr: Параметр должен иметь тип ThreadMethodEntry.

# ControlBadControl
source: Parameter must be of type Control.
sr: Параметр должен иметь тип Control.

# ControlBindingContextDescr
source: The binding context for the control.
sr: Контекст привязки для этого элемента управления.

# ControlBindingsDescr
source: The data bindings for the control.
sr: Привязки данных для элемента управления.

# ControlBottomDescr
source: The bottom of the control, in container coordinates.
sr: Нижний край элемента управления в координатах контейнера.

# ControlBoundsDescr
source: The bounds of the control, in container coordinates.
sr: Привязки элемента управления в координатах контейнера.

# ControlCanFocusDescr
source: Checks if this control can receive the focus.
sr: Проверяет, разрешено ли переключение фокуса на этот элемент управления.

# ControlCanSelectDescr
source: Checks if this control can be selected.
sr: Проверяет, может ли быть выбран этот элемент управления.

source: Control cannot be null.
sr: Элемент управления не может быть пустым значением.

# ControlCaptureDescr
source: Determines if this control is currently capturing all mouse input.
sr: Определяет, перехватывает ли в данный момент этот элемент управления все команды мыши.

# ControlCausesValidationDescr
source: Indicates whether this component raises validation events.
sr: Указывает, генерирует ли этот элемент управления события проверки действительности.

# ControlCheckForIllegalCrossThreadCalls
source: Indicates whether illegal cross-thread calls raise exceptions. This can be used as a debugging aid.
sr: Указывает, вызываются ли исключения при недопустимых вызовах в разных потоках. Данная информация может использоваться при отладке.

# ControlClientRectangleDescr
source: Retrieves the rectangle of the inner area of this control.
sr: Считывает внутреннюю прямоугольную область этого элемента управления.

# ControlClientSizeDescr
source: Determines the size of the inner area of this control.
sr: Определяет размер внутренней области этого элемента управления.
