Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# ToolStripStretchDescr
source: Specifies whether the ToolStrip stretches from end to end in the rafting container.
sr: Определяет, будет ли ToolStrip растягиваться по размеру rafting container.

# ToolStripTextBoxTextBoxTextAlignChangedDescr
source: Occurs when the value of the TextBoxTextAlign property changes.
sr: Происходит при изменении значения свойства TextBoxTextAlign.

# ToolStripTextDirectionDescr
source: Specifies the direction to draw the text on the item.
sr: Задает направление отрисовки текста в данном элементе.

# ToolTipActiveDescr
source: Determines if the ToolTip is active. A tip will only appear if the ToolTip has been activated.
sr: Определяет, включен ли режим подсказки. Подсказка отображается только тогда, когда включен режим подсказки.

# ToolTipAddFailed
source: Adding the tip to the native ToolTip control did not succeed.
sr: Добавление подсказки к исходному элементу ToolTip не удалось.

# ToolTipAutoPopDelayDescr
source: Determines the length of time the ToolTip window remains visible if the pointer is stationary inside a ToolTip region.
sr: Определяет длительность отображения подсказки при задержке указателя мыши в области подсказки.

# ToolTipAutomaticDelayDescr
source: Sets the values of AutoPopDelay, InitialDelay, and ReshowDelay to the appropriate values.
sr: Присваивает требуемые значения для AutoPopDelay, InitialDelay и ReshowDelay.

# ToolTipBackColorDescr
source: The background color of the ToolTip control.
sr: Цвет фона элемента управления ToolTip.

# ToolTipDrawEventDescr
source: Occurs in OwnerDraw mode when the ToolTip needs to be drawn.
sr: Происходит в режиме OwnerDraw при необходимости отрисовки ToolTip.

# ToolTipEmptyColor
source: Value '{0}' cannot be set to an empty value.
sr: Значение '{0}' не может быть пустым.

# ToolTipForeColorDescr
source: The foreground color of the ToolTip control.
sr: Цвет переднего плана элемента управления ToolTip.

# ToolTipInitialDelayDescr
source: Determines the length of time the pointer must remain stationary within a ToolTip region before the ToolTip window appears.
sr: Определяет время, в течение которого указатель мыши должен неподвижно находиться в области ToolTip до появления окна ToolTip.

# ToolTipIsBalloonDescr
source: Indicates whether the ToolTip will take on a balloon form.
sr: Определяет, будет ли подсказка принимать форму "облачка".

# ToolTipOwnerDrawDescr
source: Controls whether the system or the user paints items/sub items.
sr: Определяет, будет ли система или пользователь отрисовывать элементы/подэлементы.

# ToolTipPopupEventDescr
source: Occurs whenever a ToolTip is about to be shown.
sr: Возникает перед отображением подсказки.

# ToolTipReshowDelayDescr
source: Determines the length of time it takes for subsequent ToolTip windows to appear as the pointer moves from one ToolTip region to another.
sr: Определяет время на отображение подсказок при перемещении указателя мыши из одной области подсказки в другую.

# ToolTipShowAlwaysDescr
source: Determines if the tool tip will be displayed always, even if the parent window is not active.
sr: Определяет, должна ли подсказка отображаться даже в том случае, если родительское окно неактивно.

# ToolTipStripAmpersandsDescr
source: When set to true, any ampersands (&) in the Text property are not displayed.
sr: Если этот параметр равен true, ни один амперсанд (&) в свойстве Text не отображается.

# ToolTipTitleDescr
source: Determines the title of the ToolTip.
sr: Определяет заголовок подсказки.

# ToolTipToolTipDescr
source: Determines the ToolTip shown when the mouse hovers over the control.
sr: Задает подсказку, отображаемую при задержке указателя мыши над данным элементом управления.

# ToolTipToolTipIconDescr
source: Determines the icon that is shown on the ToolTip.
sr: Определяет значок, отображаемый в подсказке.

# ToolTipUseAnimationDescr
source: When set to true, animations are used when the ToolTip is shown or hidden.
sr: Если этот параметр равен true, при отображении и скрытии подсказки используется анимация.

# ToolTipUseFadingDescr
source: When set to true, a fade effect is used when ToolTips are shown or hidden.
sr: Если этот параметр равен true, при отображении и скрытии подсказки используется эффект угасания.

# TopLevelControlAdd
source: Top-level control cannot be added to a control.
sr: Элемент верхнего уровня нельзя добавлять к элементу управления.

# TopLevelNotAllowedIfActiveX
source: TopLevel property cannot be set to true for ActiveX controls.
sr: Свойство TopLevel нельзя задавать равным true для элементов ActiveX.

# TopLevelParentedControl
source: Top-level style of a parented control cannot be changed.
sr: Стиль верхнего уровня для элемента с предком изменять нельзя.

# TrackBarAutoSizeDescr
source: Indicates whether the control will resize itself automatically based on a computation of the default scroll bar dimensions.
sr: Указывает, изменяется ли размер элемента управления автоматически в соответствии с вычисленными размерами полос прокрутки по умолчанию.

# TrackBarLargeChangeDescr
source: The number of positions the slider moves in response to mouse clicks or the PAGE UP and PAGE DOWN keys.
sr: Число позиций, на которое перемещается ползунок в ответ на щелчок кнопки мыши или нажатие клавиш PAGE UP и PAGE DOWN.

# TrackBarLargeChangeError
source: LargeChange: Value '{0}' must be greater than or equal to 0.
sr: LargeChange: значение '{0}' должно быть больше или равно 0.

# TrackBarMaximumDescr
source: The maximum value for the position of the slider on the TrackBar.
sr: Максимальное значение для положения движка на TrackBar.

# TrackBarMinimumDescr
source: The minimum value for the position of the slider on the TrackBar.
sr: Минимальное значение для положения движка на TrackBar.

# TrackBarOnScrollDescr
source: Occurs when the TrackBar slider moves.
sr: Возникает при каждом перемещении ползунка TrackBar.

# TrackBarOrientationDescr
source: The orientation of the control.
sr: Ориентация элемента управления.

# TrackBarSmallChangeDescr
source: The number of positions the slider moves in response to keyboard input (arrow keys).
sr: Число позиций, на которое перемещается ползунок в ответ на нажатие клавиш со стрелками на клавиатуре.

# TrackBarSmallChangeError
source: SmallChange: Value '{0}' must be greater than or equal to 0.
sr: SmallChange: значение '{0}' должно быть больше или равно 0.

# TrackBarTickFrequencyDescr
source: The number of positions between tick marks.
sr: Число позиций между отметками на оси.

# TrackBarTickStyleDescr
source: Indicates where the ticks appear on the TrackBar.
sr: Указывает, отображаются ли отметки для TrackBar.

# TrackBarValueDescr
source: The position of the slider.
sr: Положение движка.

# TransparentBackColorNotAllowed
source: Control does not support transparent background colors.
sr: Элемент управления не поддерживает прозрачные цвета фона.

# TrayIcon_TextTooLong
source: Text length must be less than 64 characters long.
sr: Длина текста должна быть меньше 64 символов.

# TreeNodeBackColorDescr
source: The background color of tree node.
sr: Цвет фона узла древовидной структуры.

# TreeNodeBeginEditFailed
source: BeginEdit did not succeed because LabelEdit property is false.
sr: Операция BeginEdit не удалась, поскольку значение свойства LabelEdit равно false.

# TreeNodeCheckedDescr
source: Indicates whether the tree node is in a checked state.
sr: Указывает, находится ли данный узел дерева в выделенном состоянии.

# TreeNodeCircularReference
source: A circular reference has been made. A TreeNode cannot be added as a descendant of itself.
sr: Создана циклическая ссылка. TreeNode невозможно добавить в качестве потомка самого себя.

# TreeNodeCollectionBadTreeNode
source: Parameter must be of type TreeNode.
sr: Параметр должен иметь тип TreeNode.

# TreeNodeForeColorDescr
source: The foreground color of tree node.
sr: Цвет переднего плана узла древовидной структуры.

# TreeNodeImageIndexDescr
source: The ImageList index value of the image displayed when the tree node is in the unselected state.
sr: Значение индекса ImageList для изображения, отображаемого, когда данный узел дерева не выделен.

# TreeNodeImageKeyDescr
source: Identifies the image to display on the node when it is not selected.
sr: Определяет изображение, отображаемое на узле, когда он не выбран.

# TreeNodeIndexDescr
source: The position of the tree node in the tree node collection.
sr: Положение узла в коллекции узлов древовидной структуры.

# TreeNodeNoParent
source: Full path can only be retrieved when a TreeNode has been added to a TreeView. This TreeNode has not been added to a TreeView.
sr: Полный путь можно получать только при добавлении TreeNode к TreeView. Данный TreeNode не был добавлен к TreeView.

# TreeNodeNodeFontDescr
source: The font used to display the text on the tree node's label.
sr: Шрифт, используемый при отображении текста подписи к узлу структуры дерева.

# TreeNodeNodeNameDescr
source: The name of the object.
sr: Имя объекта.

# TreeNodeSelectedImageIndexDescr
source: The key in the image-list value that represents the image to display when the tree node is in the selected state.
sr: Ключ в значении списка изображений, определяющий изображение, которое нужно показать, когда узел дерева выделен.

# TreeNodeSelectedImageKeyDescr
source: The key in the ImageList value that represents the image to display when the tree node is in the selected state.
sr: Ключ в значении ImageList, определяющий изображение, которое нужно показать, когда узел дерева выделен.

# TreeNodeStateImageIndexDescr
source: The index in the StateImageList displayed when CheckBoxes is set to false on the TreeView.
sr: Индекс StateImageList, отображаемый при значении CheckBoxes равном false для TreeView.

# TreeNodeStateImageKeyDescr
source: Identifies the image to display on the node to indicate its current state.
sr: Определяет изображение, которое должно отображаться на узле для указания его текущего состояния.

# TreeNodeTextDescr
source: The text displayed in the label of the tree node.
sr: Текст, отображаемый в подписи узла структуры дерева.

# TreeNodeToolTipTextDescr
source: The ToolTip text that will be displayed when the mouse hovers over the node.
sr: Текст подсказки, отображаемый при наведении указателя мыши на узел.

# TreeViewAfterCheckDescr
source: Occurs when a check box on a tree node has been checked or unchecked.
sr: Происходит при установке или очистке флажка проверки в узле дерева.

# TreeViewAfterCollapseDescr
source: Occurs when a node has been collapsed.
sr: Происходит при сворачивании узла.

# TreeViewAfterEditDescr
source: Occurs when the text of a node has been edited by the user.
sr: Происходит после редактирования текста узла пользователем.

# TreeViewAfterExpandDescr
source: Occurs when a node has been expanded.
sr: Происходит при раскрытии узла.

# TreeViewAfterSelectDescr
source: Occurs when the selection has been changed.
sr: Происходит при изменении выбора.

# TreeViewBeforeCheckDescr
source: Occurs when a check box on a tree node is about to be checked or unchecked.
sr: Происходит непосредственно перед установкой или очисткой флажка проверки в узле дерева.

# TreeViewBeforeCollapseDescr
source: Occurs when a node is about to be collapsed.
sr: Происходит непосредственно перед сворачиванием узла.

# TreeViewBeforeEditDescr
source: Occurs when the text of a node is about to be edited by the user.
sr: Происходит непосредственно перед редактированием текста узла пользователем.

# TreeViewBeforeExpandDescr
source: Occurs when a node is about to be expanded.
sr: Происходит непосредственно перед развертыванием узла.

# TreeViewBeforeSelectDescr
source: Occurs when the selection is about to change.
sr: Происходит непосредственно перед изменением выбора.

# TreeViewCheckBoxesDescr
source: Indicates whether check boxes are displayed beside nodes.
sr: Указывает, отображаются ли флажки проверки рядом с узлами.

# TreeViewDrawModeDescr
source: Controls whether the system or the user paints the nodes.
sr: Определяет, будет ли система или пользователь отрисовывать узлы.

# TreeViewDrawNodeEventDescr
source: Occurs in owner-draw mode, when a node needs to be drawn.
sr: Возникает в режиме отрисовки владельцем, когда нужно отрисовать узел.

# TreeViewFullRowSelectDescr
source: Indicates whether the highlight spans the width of the TreeView.
sr: Указывает, распространяется ли выделение на всю ширину TreeView.

# TreeViewHideSelectionDescr
source: Removes highlight from the selected node when control does not have focus.
sr: Удаляет выделение выбранного узла, когда на данный элемент управления не переключен фокус.

# TreeViewHotTrackingDescr
source: Indicates whether nodes give feedback when the mouse is moved over them.
sr: Указывает, реагируют ли узлы на перемещение курсора мыши над ними.

# TreeViewImageIndexDescr
source: The default image index for nodes.
sr: Индекс изображений по умолчанию для узлов.

# TreeViewImageKeyDescr
source: The default image key for nodes.
sr: Ключ изображения по умолчанию для узлов.

# TreeViewImageListDescr
source: The ImageList control from which node images are taken.
sr: Элемент управления 'список изображений', из которого извлекаются изображения узлов.

# TreeViewIndentDescr
source: The indentation width of child nodes in pixels.
sr: Величина отступа для дочерних узлов (в пикселях).

# TreeViewItemHeightDescr
source: The height of every node in the TreeView.
sr: Высота каждого из элементов в представлении иерархической структуры дерева.

# TreeViewLabelEditDescr
source: Indicates whether the user can edit the label text of nodes.
sr: Указывает, может ли пользователь редактировать текст подписей к узлам.

# TreeViewLineColorDescr
source: The color of the lines that connect the nodes of the TreeView.
sr: Цвет линий, соединяющих узлы в TreeView.

# TreeViewNodeMouseClickDescr
source: Occurs when a node is clicked with the mouse.
sr: Возникает при щелчке мыши на узле.

# TreeViewNodeMouseDoubleClickDescr
source: Occurs when a node is double-clicked with the mouse.
sr: Возникает при двойном щелчке мыши на узле.

# TreeViewNodeMouseHoverDescr
source: Occurs when the mouse hovers over a TreeNode.
sr: Возникает при наведении указателя мыши на TreeNode.

# TreeViewNodeSorterDescr
source: The sorting comparer for the TreeView.
sr: Сортирующий блок сравнения для TreeView.

# TreeViewNodesDescr
source: The root nodes in the TreeView control.
sr: Корневые узлы в элементе управления TreeView.

# TreeViewPathSeparatorDescr
source: The string delimiter used for the path returned by a node's FullPath property.
sr: Разделитель строк в пути, возвращаемом свойством FullPath узла.

# TreeViewScrollableDescr
source: Indicates whether the control will display scroll bars if it contains more nodes than can fit in the visible area.
sr: Указывает, будут ли в элементе управления отображаться полосы прокрутки, если он содержит больше узлов, чем помещается в видимую область.

# TreeViewSelectedImageIndexDescr
source: The default image index for selected nodes.
sr: Индекс изображений по умолчанию для выбранных узлов.

# TreeViewSelectedImageKeyDescr
source: The default image for selected nodes.
sr: Изображение по умолчанию для выбранных узлов.

# TreeViewSelectedNodeDescr
source: The currently selected node, or null if no node is selected.
sr: Выбранный в текущий момент узел или NULL при отсутствии выбора.

# TreeViewShowLinesDescr
source: Indicates whether lines are displayed between sibling nodes and between parent and child nodes.
sr: Указывает, отображаются ли линии между родительскими и дочерними узлами, а также между узлами, имеющими общего родителя.

# TreeViewShowPlusMinusDescr
source: Indicates if plus/minus buttons are shown next to parent nodes.
sr: Указывает, отображаются ли рядом с родительскими узлами кнопки 'плюс'/'минус'.

# TreeViewShowRootLinesDescr
source: Indicates whether lines are displayed between root nodes.
sr: Указывает, отображаются ли линии между корневыми узлами.

# TreeViewShowShowNodeToolTipsDescr
source: Indicates whether ToolTips will be displayed on the nodes.
sr: Указывает, отображаются ли подсказки на узлах.

# TreeViewSortedDescr
source: Indicates whether nodes are sorted.
sr: Указывает, сохраняются ли узлы.

# TreeViewStateImageListDescr
source: The ImageList control used by the TreeView for custom states.
sr: Элемент ImageList, используемый TreeView для пользовательских состояний.

# TreeViewTopNodeDescr
source: The first visible node in the TreeView.
sr: Первый видимый узел в TreeView.

# TreeViewVisibleCountDescr
source: The number of visible nodes in the TreeView.
sr: Число видимых узлов в TreeView.

# TypeLoadException
source: Type {0} in the data at line {1}, position {2} cannot be located.
sr: Тип {0} в данных в строке {1}, позиция {2}, не найден.

# TypeLoadExceptionShort
source: Type {0} cannot be located.
sr: Тип {0} не найден.

# TypedControlCollectionShouldBeOfType
source: Controls added to this collection must be of type '{0}'.
sr: Элементы управления, добавляемые к данной коллекции, должны иметь тип '{0}'.

# TypedControlCollectionShouldBeOfTypes
source: Controls added to this collection must be of type '{0}' or '{1}'.
sr: Элементы управления, добавляемые к данной коллекции, должны иметь тип '{0}' или '{1}'.

# UnableToInitComponent
source: Unable to initialize component.
sr: Не удалось инициализировать компонент.

# UnableToSetPanelText
source: Unable to set the panel text.
sr: Не удается задать текст панели.

# UnexpectedClipboardType
source: Clipboard contains an unexpected type.
sr: Буфер обмена содержит непредвиденный тип.

# UnexpectedTypeForClipboardFormat
source: The specified Clipboard format is not compatible with '{0}' type.
sr: Указанный формат буфера обмена не совместим с типом "{0}".

# UnknownAttr
source: Unknown ATTRIBUTE type.
sr: Неизвестный тип ATTRIBUTE.

# UnknownInputLanguageLayout
source: Unknown layout
sr: Неизвестный макет

# UnsafeNativeMethodsNotImplemented
source: Not implemented.
sr: Не реализовано.

# UpDownBaseAlignmentDescr
source: Indicates how the up-down control will position the up and down buttons relative to its edit box.
sr: Указывает, как в поле со стрелками 'вверх/вниз' расположены кнопки со стрелками относительно поля редактирования.

# UpDownBaseBorderStyleDescr
source: Indicates the border style of the up-down control.
sr: Указывает стиль границы поля со стрелками 'вверх/вниз'.

# UpDownBaseDownButtonAccName
source: Down
sr: Вниз

# UpDownBaseInterceptArrowKeysDescr
source: Indicates whether the up-down control will increment and decrement the value when the UP ARROW and DOWN ARROW keys are pressed.
sr: Указывает, увеличивается/уменьшается ли значение поля со стрелками 'вверх/вниз' при нажатии клавиш 'стрелка вверх' и 'стрелка вниз'.

# UpDownBasePreferredHeightDescr
source: The preferred height of this control.
sr: Предпочтительная высота данного элемента управления.

# UpDownBaseReadOnlyDescr
source: Indicates whether the edit box is read-only.
sr: Указывает, является ли поле редактирования доступным только для чтения.

# UpDownBaseTextAlignDescr
source: Indicates how the text should be aligned in the edit box.
sr: Задает выравнивание текста в данной области редактирования.

# UpDownBaseUpButtonAccName
source: Up
sr: Вверх

# UseCompatibleTextRenderingDescr
source: Specifies whether text rendering should be compatible with previous releases of Windows Forms.
sr: Определяет, должен ли отображаемый текст быть совместимым с предыдущими версиями Windows Forms.

# UserControlBorderStyleDescr
source: Indicates whether the panel should have a border.
sr: Показывает, должны ли у панели быть границы.

# UserControlOnLoadDescr
source: Occurs whenever the user control loads.
sr: Происходит при каждой загрузке пользовательского элемента управления.

# VisualStyleHandleCreationFailed
source: Visual Style handle creation operation did not succeed.
sr: Операция создания дескриптора Visual Style не удалась.

# VisualStyleNotActive
source: Visual Styles-related operation resulted in an error because no visual style is currently active.
sr: Операция с Visual Styles привела к ошибке, поскольку сейчас нет активных стилей отображения.

# VisualStylesDisabledInClientArea
source: Visual Styles-related operation resulted in an error because visual styles are currently disabled in the client area.
sr: Операция с Visual Styles привела к ошибке, поскольку сейчас в клиентской области стили отображения отключены.

# VisualStylesInvalidCombination
source: Given combination of Class, Part, and State is not defined by the current visual style.
sr: Данная комбинация Class, Part и State не определена текущим стилем отображения.

# WebBrowserAllowDropNotSupported
source: The WebBrowser control does not support AllowDrop. Use AllowWebBrowserDrop to allow the WebBrowser to process drag/drop.
sr: Элемент управления "Веб-браузер" не поддерживает AllowDrop. Используйте AllowWebBrowserDrop, чтобы разрешить для веб-браузера обработку перетаскивания.

# WebBrowserAllowNavigationDescr
source: Specifies whether the WebBrowser control can browse to another page after initially loading.
sr: Указывает, может ли элемент управления "Веб-браузер" переходить на другую страницу после первой загрузки.

# WebBrowserAllowWebBrowserDropDescr
source: Specifies whether the WebBrowser control will receive drop notifications.
sr: Указывает, может ли элемент управления "Веб-браузер" получать уведомления о перетаскивании.

# WebBrowserBackgroundImageLayoutNotSupported
source: The WebBrowser control does not support the BackgroundImageLayout property.
sr: Элемент управления "Веб-браузер" не поддерживает свойство BackgroundImageLayout.

# WebBrowserBackgroundImageNotSupported
source: The WebBrowser control does not support the BackgroundImage property.
sr: Элемент управления "Веб-браузер" не поддерживает свойство BackgroundImage.

# WebBrowserCanGoBackChangedDescr
source: Occurs when the availability of a previous page in the Web browser navigation history changes.
sr: Возникает при изменении доступности предыдущей страницы в журнале навигации веб-браузера.

# WebBrowserCanGoForwardChangedDescr
source: Occurs when the availability of a next page in the Web browser navigation history changes.
sr: Возникает при изменении доступности следующей страницы в журнале навигации веб-браузера.

# WebBrowserCursorNotSupported
source: The WebBrowser control does not support the Cursor property.
sr: Элемент управления "Веб-браузер" не поддерживает свойство Cursor.

# WebBrowserDocumentCompletedDescr
source: Occurs when the document hosted in the Web browser control is fully loaded.
sr: Происходит, когда документ, вызванный элементом управления "Веб-браузер", загружен полностью.

# WebBrowserDocumentTitleChangedDescr
source: Occurs whenever the title text changes.
sr: Возникает при каждом изменении текста заголовка.

# WebBrowserEnabledNotSupported
source: The WebBrowser control does not support the Enabled property.
sr: Элемент управления "Веб-браузер" не поддерживает свойство Enabled.

# WebBrowserEncryptionLevelChangedDescr
source: Occurs whenever encryption level changes.
sr: Возникает при каждом изменении уровня шифрования.

# WebBrowserFileDownloadDescr
source: Occurs when a file download occurs.
sr: Возникает при скачивании файлов.

# WebBrowserInIENotSupported
source: Adding a WebBrowser control in Internet Explorer is not supported.
sr: Добавление элемента управления "Веб-браузер" в Internet Explorer не поддерживается.

# WebBrowserIsOfflineDescr
source: Determines whether the Web browser control operates in offline mode.
sr: Определяет, работает ли элемент управления "Веб-браузер" вне сети.

# WebBrowserIsWebBrowserContextMenuEnabledDescr
source: Indicates whether to use the context menu of the native web browser.
sr: Указывает, следует ли использовать контекстное меню собственного веб-браузера.
