Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# DataGridView_ColumnResizableDescr
source: Indicates whether the column is resizable.
sr: Указывает, можно ли изменять размер столбца.

# DataGridView_ColumnSortModeDescr
source: The sort mode for the column.
sr: Режим сортировки столбца.

# DataGridView_ColumnStateChangedDescr
source: Occurs when a column changes state, such as gaining or losing focus.
sr: Возникает при изменении состояния столбца (например, при получении или потере фокуса).

# DataGridView_ColumnToolTipTextChangedDescr
source: Occurs when the DataGridViewColumn.ToolTipText property value changes for a column in the DataGridView.
sr: Возникает при изменении значения свойства DataGridViewColumn.ToolTipText для столбца в DataGridView.

# DataGridView_ColumnToolTipTextDescr
source: The text used for ToolTips.
sr: Текст, используемый для подсказок.

# DataGridView_ColumnVisibleDescr
source: Indicates whether the column is visible.
sr: Указывает, является ли столбец видимым.

# DataGridView_ColumnWidthChangedDescr
source: Occurs when the value of the DataGridViewColumn.Width property for a column changes.
sr: Возникает при изменении значения свойства DataGridViewColumn.Width для столбца.

# DataGridView_ColumnWidthDescr
source: The current width of the column.
sr: Текущая ширина столбца.

# DataGridView_ComboBoxColumnAutoCompleteDescr
source: Indicates whether cells in the column will match the characters being entered in the cell with one from the possible selections.
sr: Указывает, будут ли в столбце выбираться ячейки, соответствующие символам, введенным в ячейку.

# DataGridView_ComboBoxColumnDataSourceDescr
source: The data source that populates the selections for the combo boxes.
sr: Источник данных, представляющий варианты выбора для полей со списком.

# DataGridView_ComboBoxColumnDisplayMemberDescr
source: A string that specifies the property or column from which to retrieve strings for display in the combo boxes.
sr: Строка, определяющая свойство или столбец, из которого извлекаются строки для отображения в полях со списком.

# DataGridView_ComboBoxColumnDisplayStyleDescr
source: Determines how the combo box is displayed when not editing.
sr: Определяет отображение поля со списком в тот момент, когда редактирование не производится.

# DataGridView_ComboBoxColumnDisplayStyleForCurrentCellOnlyDescr
source: Indicates if the display style only applies to the current cell.
sr: Указывает, применяется ли стиль отображения только к текущей ячейке.

# DataGridView_ComboBoxColumnDropDownWidthDescr
source: The width of the drop-down lists of the combo boxes.
sr: Ширина раскрывающихся списков полей со списком.

# DataGridView_ComboBoxColumnFlatStyleDescr
source: The flat style appearance of the column's cells.
sr: Плоское отображение ячеек столбца.

# DataGridView_ComboBoxColumnItemsDescr
source: The collection of objects used as selections in the combo boxes.
sr: Коллекция объектов, использующихся как варианты выбора в полях со списком.

# DataGridView_ComboBoxColumnMaxDropDownItemsDescr
source: The maximum number of items in the drop-down list of the cells in the column.
sr: Максимальное число элементов в раскрывающемся списке ячеек столбца.

# DataGridView_ComboBoxColumnSortedDescr
source: Indicates whether the items in the combo box are sorted.
sr: Указывает, упорядочены ли элементы в поле со списком.

# DataGridView_ComboBoxColumnValueMemberDescr
source: A string that specifies the property or column from which to get values that correspond to the selections in the drop-down list.
sr: Строка, определяющая свойство или столбец, из которых извлекаются значения, соответствующие вариантам в раскрывающемся списке.

# DataGridView_CommitFailedCannotCompleteOperation
source: Operation cannot be completed because the current cell could not be committed.
sr: Завершение операции невозможно: не удалось передать текущую ячейку.

# DataGridView_CurrencyManagerRowCannotBeInvisible
source: Row associated with the currency manager's position cannot be made invisible.
sr: Строку, связанную с положением CurrencyManager, нельзя сделать невидимой.

# DataGridView_CurrentCellCannotBeInvisible
source: Current cell cannot be set to an invisible cell.
sr: Текущую ячейку нельзя сделать невидимой.

# DataGridView_CurrentCellChangedDescr
source: Occurs when DataGridView.CurrentCell changes.
sr: Возникает при изменении DataGridView.CurrentCell.

# DataGridView_CurrentCellDirtyStateChangedDescr
source: Occurs when the state of a cell changes in relation to a change in its contents.
sr: Возникает при изменении состояния ячейки в связи с изменением ее содержимого.

# DataGridView_CustomCellBorderStyleInvalid
source: Value DataGridViewCellBorderStyle. Custom cannot be used to set the {0} property.
sr: Значение DataGridViewCellBorderStyle. Нельзя использовать Custom для установки свойства {0}.

# DataGridView_DataBindingCompleteDescr
source: Event raised whenever the data source list changes.
sr: Событие возникает при каждом изменении списка источников данных.

# DataGridView_DataErrorDescr
source: Occurs when an external data-parsing or validation operation throws an exception, or when an attempt to commit data to a data source does not succeed.
sr: Возникает, когда внешняя операция разбора данных или проверки корректности создает исключение, а также при неудачной попытке передачи данных в источник данных.

# DataGridView_DefaultCellStyleDescr
source: The DataGridViewBand.DefaultCellStyle to be applied to the DataGridView if no other style is set.
sr: Значение DataGridViewBand.DefaultCellStyle для DataGridView, если не задан другой стиль.

# DataGridView_DefaultValuesNeededDescr
source: Occurs when the user enters the row for new records so that it can be populated with default values.
sr: Возникает, когда пользователь вводит строку для новых записей, которая должна заполняться значениями по умолчанию.

# DataGridView_DisabledClipboardCopy
source: Generating Clipboard content is not supported when the ClipboardCopyMode property is Disable.
sr: Генерация содержимого буфера обмена не поддерживается, когда значением свойства ClipboardCopyMode является Disable.

# DataGridView_EditModeChangedDescr
source: Occurs when the value of the DataGridView.EditMode property changes.
sr: Возникает при изменении значения свойства DataGridView.EditMode.

# DataGridView_EditModeDescr
source: Identifies the mode that determines how cell editing is started.
sr: Задает режим, определяющий начало редактирования ячейки.

# DataGridView_EditingControlShowingDescr
source: Occurs when a control for editing a cell is showing.
sr: Возникает при отображении элемента управления для редактирования ячейки.

# DataGridView_EmptyColor
source: Value '{0}' cannot be set to an empty value.
sr: Значение '{0}' не может быть пустым.

# DataGridView_EnableHeadersVisualStylesDescr
source: Indicates whether row and column headers use the visual styles of the user's current theme if visual styles are enabled for the application.
sr: Указывает, используются ли для заголовков строк и столбцов визуальные стили текущей темы пользователя, если в приложении включены визуальные стили.

# DataGridView_ErrorMessageCaption
source: DataGridView Default Error Dialog
sr: Окно сообщения об ошибке DataGridView по умолчанию

# DataGridView_ErrorMessageText_NoException
source: Exception occurred in the DataGridView. To replace this default dialog box, handle the DataError event.
sr: Исключение в DataGridView. Чтобы заменить это окно, включите обработку события DataError.

# DataGridView_ErrorMessageText_WithException
source: The following exception occurred in the DataGridView: {0} To replace this default dialog please handle the DataError event.
sr: Исключение в DataGridView: {0} Для замены этого окна по умолчанию обработайте событие DataError.

# DataGridView_FirstDisplayedCellCannotBeAHeaderOrSharedCell
source: First displayed cell cannot be set to a header or shared cell.
sr: Первая отображаемая ячейка не может быть заголовком или совместно используемой ячейкой.

# DataGridView_FirstDisplayedCellCannotBeInvisible
source: First displayed cell cannot be set to an invisible cell.
sr: Первая отображаемая ячейка не может быть невидимой.

# DataGridView_FirstDisplayedScrollingColumnCannotBeFrozen
source: FirstDisplayedScrollingColumnIndex property cannot be set to a frozen column.
sr: Свойство FirstDisplayedScrollingColumnIndex нельзя задать для фиксированного столбца.

# DataGridView_FirstDisplayedScrollingColumnCannotBeInvisible
source: FirstDisplayedScrollingColumnIndex property cannot be set to an invisible column.
sr: Свойство FirstDisplayedScrollingColumnIndex нельзя задать для невидимого столбца.

# DataGridView_FirstDisplayedScrollingRowCannotBeFrozen
source: FirstDisplayedScrollingRowIndex property cannot be set to a frozen row.
sr: Свойство FirstDisplayedScrollingRowIndex нельзя задать для фиксированной строки.

# DataGridView_FirstDisplayedScrollingRowCannotBeInvisible
source: FirstDisplayedScrollingRowIndex property cannot be set to an invisible row.
sr: Свойство FirstDisplayedScrollingRowIndex нельзя задать для невидимой строки.

# DataGridView_ForbiddenOperationInEventHandler
source: Operation cannot be performed in this event handler.
sr: Выполнение операции в данном обработчике событий невозможно.

# DataGridView_FrozenColumnsPreventFirstDisplayedScrollingColumn
source: The frozen columns do not leave any room for a scrolling column to be displayed.
sr: Фиксированные столбцы не оставляют места для отображения прокручиваемого столбца.

# DataGridView_FrozenRowsPreventFirstDisplayedScrollingRow
source: The frozen rows do not leave any room for a scrolling row to be displayed.
sr: Фиксированные строки не оставляют места для отображения прокручиваемой строки.

# DataGridView_HeaderCellReadOnlyProperty
source: Property {0} of a DataGridViewHeaderCell cell cannot be set.
sr: Невозможно задать свойство {0} для ячейки DataGridViewHeaderCell.

# DataGridView_IBindingListNeedsToSupportSorting
source: DataGridView control cannot be sorted if it is bound to an IBindingList that does not support sorting.
sr: Элемент управления DataGridView нельзя упорядочить, если он привязан к IBindingList, не поддерживающему сортировку.

# DataGridView_InvalidDataGridViewElementStateCombination
source: Parameter {0} is not a valid combination of DataGridViewElementState flags.
sr: Параметр {0} не является допустимой комбинацией флагов DataGridViewElementState.

# DataGridView_InvalidDataGridViewPaintPartsCombination
source: Parameter {0} is not a valid combination of DataGridViewPaintParts flags.
sr: Параметр {0} не является допустимой комбинацией флагов DataGridViewPaintParts.

# DataGridView_InvalidEditingControl
source: EditType property of the current cell does not point to a class that derives from System.Windows.Forms.Control and implements the interface IDataGridViewEditingControl.
sr: Свойство EditType текущей ячейки не указывает на класс, производный от System.Windows.Forms.Control, и реализующий интерфейс IDataGridViewEditingControl.

# DataGridView_InvalidOperationInVirtualMode
source: Operation is not valid when the DataGridView control is in virtual mode.
sr: Выполнение операции невозможно, если элемент управления DataGridView находится в виртуальном режиме.

# DataGridView_InvalidOperationOnSharedCell
source: Operation cannot be performed on a cell of a shared row.
sr: Выполнение операции для ячейки совместно используемой строки невозможно.

# DataGridView_InvalidOperationOnSharedRow
source: Operation cannot be performed on a shared row.
sr: Выполнение операции для совместно используемой строки невозможно.

# DataGridView_InvalidPropertyGetOnSharedCell
source: Getting the {0} property of a cell in a shared row is not a valid operation.
sr: Получение свойства {0} ячейки совместно используемой строки является недопустимой операцией.

# DataGridView_InvalidPropertyGetOnSharedRow
source: Getting the {0} property of a shared row is not a valid operation.
sr: Получение свойства {0} совместно используемой строки является недопустимой операцией.

# DataGridView_InvalidPropertySetOnSharedRow
source: Setting the {0} property of a shared row is not a valid operation.
sr: Получение свойства {0} совместно используемой строки является недопустимой операцией.

# DataGridView_LinkColumnActiveLinkColorDescr
source: The color used to display an active link within cells in the column.
sr: Цвет, используемый для отображения активной ссылки в ячейках столбца.

# DataGridView_LinkColumnLinkBehaviorDescr
source: A value that represents the behavior of links within cells in the column.
sr: Значение, определяющее поведение ссылок в ячейках столбца.

# DataGridView_LinkColumnLinkColorDescr
source: The color used to display an unselected link within cells in the column.
sr: Цвет, используемый для отображения в ячейках столбца невыбранной ссылки.

# DataGridView_LinkColumnTextDescr
source: The link text displayed in all of the column's cells.
sr: Текст ссылки, отображаемый во всех ячейках столбца.

# DataGridView_LinkColumnTrackVisitedStateDescr
source: Indicates whether the link changes color if it has been visited.
sr: Указывает, изменяется ли цвет ссылок, которыми воспользовался пользователь.

# DataGridView_LinkColumnUseColumnTextForLinkValueDescr
source: Indicates whether the DataGridViewLinkColumn.Text property value is displayed as the link text.
sr: Указывает, отображается ли значение свойства DataGridViewLinkColumn.Text как текст ссылки.

# DataGridView_LinkColumnVisitedLinkColorDescr
source: The color used to display a link that has been previously visited.
sr: Цвет отображения ссылок, которыми воспользовался пользователь.

# DataGridView_MultiSelectDescr
source: Indicates whether the user is allowed to select more than one cell, row, or column of the DataGridView at a time.
sr: Указывает, может ли пользователь одновременно выбрать более одной ячейки, строки или столбца DataGridView.

# DataGridView_NeedAutoSizingCriteria
source: Parameter {0} is not valid for this operation. This parameter value must specify a mode which AutoSizes.
sr: Параметр {0} является недопустимым для данной операции. Значение параметра должно определять режим автоматического изменения размеров.

# DataGridView_NeedColumnAutoSizingCriteria
source: Parameter {0} is not valid for this operation. It cannot be NotSet, None or Fill but needs to indicate a sizing criteria.
sr: Параметр {0} является недопустимым для данной операции. Он не может принимать значения NotSet, None или Fill, а должен указывать критерии установки размера.

# DataGridView_NewRowNeededDescr
source: Occurs when the DataGridView.VirtualMode property of the DataGridView is true and the user navigates to the new row at the bottom of the DataGridView.
sr: Возникает, когда свойство DataGridView.VirtualMode для DataGridView принимает значение true, и пользователь перемещается на новую строку в нижней части DataGridView.

# DataGridView_NoCurrentCell
source: Operation cannot be performed because there is no current cell. The CurrentCell property needs to be set first.
sr: Выполнение операции невозможно: отсутствует текущая ячейка. Сначала нужно задать свойство CurrentCell.

# DataGridView_NoRoomForDisplayedColumns
source: No room is available to display columns.
sr: Недостаточно места для отображения столбцов.

# DataGridView_NoRoomForDisplayedRows
source: No room is available to display rows.
sr: Недостаточно места для отображения строк.

# DataGridView_OperationDisabledInVirtualMode
source: Operation is not supported when VirtualMode is set to true.
sr: Если VirtualMode имеет значение true, данная операция не поддерживается.

# DataGridView_PreviousModesHasWrongLength
source: PreviousModes array has the wrong length. Its length must be equal to the number of columns in the DataGridView control.
sr: Недопустимая длина массива PreviousModes. Длина массива должна равняться числу столбцов в элементе управления DataGridView.

# DataGridView_PropertyMustBeZero
source: Property {0} must be set to 0.
sr: Для свойства {0} необходимо установить значение 0.

# DataGridView_ReadOnlyCollection
source: Operation not supported. Collection is read-only.
sr: Операция не поддерживается. Данная коллекция предназначена только для чтения.

# DataGridView_ReadOnlyDescr
source: Indicates whether the user can edit the cells of the DataGridView control.
sr: Указывает, может ли пользователь редактировать ячейки элемента управления DataGridView.

# DataGridView_RowAlreadyBelongsToDataGridView
source: Row provided already belongs to a DataGridView control.
sr: Указанная строка уже принадлежит к элементу управления DataGridView.

# DataGridView_RowContextMenuStripChangedDescr
source: Occurs when DataGridViewRow.ContextMenuStrip changes.
sr: Возникает при изменении DataGridViewRow.ContextMenuStrip.

# DataGridView_RowContextMenuStripDescr
source: The shortcut menu for the row.
sr: Меню быстрого доступа к строке.

# DataGridView_RowContextMenuStripNeededDescr
source: Occurs when the context menu strip is needed.
sr: Возникает, когда требуется полоса контекстного меню.

# DataGridView_RowDefaultCellStyleChangedDescr
source: Occurs when the value of the DataGridViewBand.DefaultCellStyle property for a row changes.
sr: Возникает при изменении значения свойства DataGridViewBand.DefaultCellStyle строки.

# DataGridView_RowDefaultCellStyleDescr
source: The default cell style to be applied to the DataGridViewRow if no other style is set.
sr: Стиль ячейки по умолчанию, используемый для DataGridViewRow, если не задан другой стиль.

# DataGridView_RowDirtyStateNeededDescr
source: Occurs when the DataGridView.VirtualMode property of the DataGridView control is true and the DataGridView needs to determine whether the current row has uncommitted changes.
sr: Возникает, когда свойство DataGridView.VirtualMode элемента управления DataGridView принимает значение true, и для DataGridView требуется определить наличие нереализованных изменений в строке.

# DataGridView_RowDividerDoubleClickDescr
source: Occurs when the user double-clicks the divider between two rows.
sr: Возникает при двойном щелчке на разделителе между двумя строками.

# DataGridView_RowDividerHeightChangedDescr
source: Occurs when the DataGridViewRow.DividerHeight property changes.
sr: Возникает при изменении свойства DataGridViewRow.DividerHeight.

# DataGridView_RowDividerHeightDescr
source: The height of the row divider in pixels.
sr: Высота разделителя строк (в пикселях).

# DataGridView_RowDoesNotBelongToDataGridView
source: Row provided does not belong to this DataGridView control.
sr: Указанная строка не принадлежит к данному элементу управления DataGridView.

# DataGridView_RowDoesNotYetBelongToDataGridView
source: Operation can only be performed on rows that belong to a DataGridView control.
sr: Выполнение операции возможно только для строк, принадлежащих к элементу управления DataGridView.

# DataGridView_RowEnterDescr
source: Occurs when a row receives input focus and becomes the current row.
sr: Возникает при получении фокуса данной строкой (строка становится текущей).

# DataGridView_RowErrorTextChangedDescr
source: Occurs when the DataGridViewRow.ErrorText property of a row changes.
sr: Возникает при изменении свойства DataGridViewRow.ErrorText строки.

# DataGridView_RowErrorTextDescr
source: The error message text for row-level errors.
sr: Текст сообщения об ошибке для ошибок на уровне строк.

# DataGridView_RowErrorTextNeededDescr
source: Occurs when the DataGridView.VirtualMode property of the DataGridView control is true and the DataGridViewRow.ErrorText property for a row requires a value.
sr: Возникает, когда свойство DataGridView.VirtualMode элемента управления DataGridView имеет значение true, и для свойства DataGridViewRow.ErrorText строки необходимо указать значение.

# DataGridView_RowHeaderCellAccDefaultAction
source: Press to select row
sr: Нажмите, чтобы выбрать строку.

# DataGridView_RowHeaderCellChangedDescr
source: Occurs when the user changes the contents of a row header cell.
sr: Возникает, когда пользователь изменяет содержимое ячейки заголовка строки.

# DataGridView_RowHeaderMouseClickDescr
source: Occurs when the user clicks within the boundaries of a row header.
sr: Возникает при щелчке в пределах заголовка строки.

# DataGridView_RowHeaderMouseDoubleClickDescr
source: Occurs when a row header is double-clicked.
sr: Возникает при двойном щелчке заголовка строки.

# DataGridView_RowHeadersBorderStyleChangedDescr
source: Occurs when the DataGridView.RowHeadersBorderStyle property changes.
sr: Возникает при изменении свойства DataGridView.RowHeadersBorderStyle.

# DataGridView_RowHeadersBorderStyleDescr
source: The border style of the row header cells.
sr: Стиль границ для ячеек заголовков строк.

# DataGridView_RowHeadersCannotBeInvisible
source: Row headers cannot be made invisible because the DataGridView control includes the row headers in its AutoSize mode.
sr: Заголовки строк нельзя сделать невидимыми, так как элемент управления DataGridView включает заголовки строк в режим AutoSize.

# DataGridView_RowHeadersDefaultCellStyleDescr
source: The default style applied to the row header cells.
sr: Стиль, использующийся для ячеек заголовков строк по умолчанию.

# DataGridView_RowHeadersWidthDescr
source: The width, in pixels, of the column that contains the row headers.
sr: Ширина (в пикселях) столбца, содержащего заголовки строк.

# DataGridView_RowHeadersWidthSizeModeChangedDescr
source: Occurs when the value of the RowHeadersWidthSizeMode property changes.
sr: Возникает при изменении значения свойства RowHeadersWidthSizeMode.

# DataGridView_RowHeadersWidthSizeModeDescr
source: Determines the behavior for adjusting the row headers width.
sr: Определяет поведение при изменении ширины заголовков строк.

# DataGridView_RowHeightChangedDescr
source: Occurs when the value of the DataGridViewRow.Height property for a row changes.
sr: Возникает при изменении значения свойства DataGridViewRow.Height строки.

# DataGridView_RowHeightDescr
source: The current height of the row.
sr: Текущая высота строки.

# DataGridView_RowHeightInfoNeededDescr
source: Occurs when information about row height is requested.
sr: Возникает, когда запрашивается информация о высоте строк.

# DataGridView_RowHeightInfoPushedDescr
source: Occurs when the user changes the height of a row.
sr: Возникает, когда пользователь изменяет высоту строки.

# DataGridView_RowLeaveDescr
source: Occurs when a row loses input focus and is no longer the current row.
sr: Возникает, когда строка теряет фокус (строка больше не является текущей).

# DataGridView_RowMinimumHeightChangedDescr
source: Occurs when the value of the DataGridViewRow.MinimumHeight property for a row changes.
sr: Возникает при изменении значения свойства DataGridViewRow.MinimumHeight строки.

# DataGridView_RowMinimumHeightDescr
source: The minimum height of the row.
sr: Минимальная высота строки.

# DataGridView_RowMustBeUnshared
source: Row provided must be unshared first.
sr: Сначала необходимо запретить совместное использование строки.

# DataGridView_RowPostPaintDescr
source: Event raised to perform row level painting, after all cell painting has occurred.
sr: Событие, вызываемое для прорисовки на уровне строк, после того как все ячейки были прорисованы.

# DataGridView_RowPrePaintDescr
source: Event raised to perform row level painting, before any cell painting has occurred.
sr: Событие, вызываемое для прорисовки на уровне строк, до прорисовки ячеек.

# DataGridView_RowReadOnlyDescr
source: Indicates whether the row is read-only.
sr: Указывает, предназначена ли строка только для чтения.
