Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# ControlCompanyNameDescr
source: Retrieves the company name for this control.
sr: Извлекает название компании для данного элемента управления.

# ControlContainsFocusDescr
source: Determines if this control or one if its children currently has the focus.
sr: Определяет, переключен ли в фокус на этот элемент управления или на один из его дочерних элементов.

# ControlContextMenuDescr
source: The shortcut menu to display when the user right-clicks the control.
sr: Меню быстрого доступа, отображаемое при щелчке правой кнопкой мыши на данном элементе управления.

# ControlContextMenuStripChangedDescr
source: Occurs when the value of the ContextMenuStrip property changes.
sr: Возникает при изменении значения свойства ContextMenuStrip.

# ControlControlsDescr
source: The collection of child controls within this control.
sr: Коллекция дочерних элементов управления в пределах данного элемента управления.

# ControlCreatedDescr
source: Determines if the control has been fully created.
sr: Определяет, создан ли данный элемент управления полностью.

# ControlCursorDescr
source: The cursor that appears when the pointer moves over the control.
sr: Курсор, отображаемый при наведении указателя мыши на данный элемент управления.

# ControlDisplayRectangleDescr
source: Retrieves the display rectangle of this control.
sr: Считывает прямоугольник, в котором отображается этот элемент управления.

# ControlDisposedDescr
source: Determines if this control has been disposed.
sr: Определяет, был ли ликвидирован этот элемент управления.

# ControlDisposingDescr
source: Determines whether this control is in the process of being disposed.
sr: Определяет, находится ли этот элемент управления в процессе ликвидации.

# ControlDockDescr
source: Defines which borders of the control are bound to the container.
sr: Указывает, какие границы элемента управления привязаны к контейнеру.

# ControlDoubleBufferedDescr
source: Indicates whether the control will be double buffered.
sr: Указывает, будет ли для данного элемента управления использоваться двойной буфер.

# ControlDpiChangeScale
source: Enable or disable automatic scaling of this control when dpi changes.
sr: Включение или отключение автоматического масштабирования этого элемента управления при изменении DPI.

# ControlEnabledDescr
source: Indicates whether the control is enabled.
sr: Указывает, включен ли элемент управления.

# ControlFocusedDescr
source: Determines if this control has focus.
sr: Определяет, переключен ли фокус на этот элемент управления.

# ControlFontDescr
source: The font used to display text in the control.
sr: Шрифт, используемый для отображения текста на элементе управления.

# ControlForeColorDescr
source: The foreground color of this component, which is used to display text.
sr: Цвет переднего плана для отображения текста в данном элементе управления.

# ControlHandleCreatedDescr
source: Indicates whether the control has a handle associated with it.
sr: Определяет, есть ли у этого элемента управления дескриптор.

# ControlHandleDescr
source: The native handle for this control.
sr: Собственный дескриптор этого элемента управления.

# ControlHasChildrenDescr
source: Indicates whether the control contains one or more child controls.
sr: Указывает, содержит ли данный элемент управления один или несколько дочерних элементов управления.

# ControlHeightDescr
source: The height of the user interface element, in pixels.
sr: Высота элемента интерфейса пользователя (в пикселях).

# ControlIMEModeDescr
source: Determines the IME (Input Method Editor) status of the object when selected.
sr: Определяет состояние IME (редактора метода ввода) данного объекта, когда он выбран.

# ControlInvalidLastScalingFactor
source: Scaling factor cannot be zero or empty.
sr: Коэффициент масштабирования не может равняться нулю или быть пустым.

# ControlInvokeRequiredDescr
source: Determines if Invoke or BeginInvoke should be used to access this control cross-thread.
sr: Определяет, требуется ли использовать Invoke или BeginInvoke для доступа к этому элементу управления в разных потоках.

# ControlIsAccessibleDescr
source: Indicates whether the control is visible to accessibility applications.
sr: Определяет, доступен ли этот элемент для приложений со специальными возможностями.

# ControlIsKeyLockedNumCapsScrollLockKeysSupportedOnly
source: Specified key is not supported.
sr: Указанная клавиша не поддерживается.

# ControlLeftDescr
source: The upper left of the control, in container coordinates.
sr: Левый верхний угол данного элемента управления в координатах контейнера.

# ControlLocationDescr
source: The coordinates of the upper-left corner of the control relative to the upper-left corner of its container.
sr: Координаты левого верхнего угла элемента управления относительно левого верхнего угла его контейнера.

# ControlMarginDescr
source: Specifies space between this control and another control's margin.
sr: Определяет промежуток между полями данного элемента управления и полями другого элемента управления.

# ControlMaximumSizeDescr
source: Specifies the maximum size of the control.
sr: Определяет максимальный размер элемента управления.

# ControlMetaFileDCWrapperSizeInvalid
source: Size cannot have negative width or height.
sr: Размер не может иметь отрицательные значения длины или ширины.

# ControlMinimumSizeDescr
source: Specifies the minimum size of the control.
sr: Определяет минимальный размер элемента управления.

# ControlNotChild
source: 'child' is not a child control of this parent.
sr: 'child' не является дочерним элементом управления этого родительского элемента.

# ControlOnAutoSizeChangedDescr
source: Occurs when the AutoSize property has changed.
sr: Возникает при изменении свойства AutoSize.

# ControlOnBackColorChangedDescr
source: Event raised when the value of the BackColor property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства BackColor.

# ControlOnBackgroundImageChangedDescr
source: Event raised when the value of the BackgroundImage property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства BackgroundImage.

# ControlOnBackgroundImageLayoutChangedDescr
source: Event raised when the value of the BackgroundImageLayout property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства BackgroundImageLayout.

# ControlOnBindingContextChangedDescr
source: Event raised when the value of the BindingContext property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства BindingContext.

# ControlOnCausesValidationChangedDescr
source: Event raised when the value of the CausesValidation property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства CausesValidation.

# ControlOnChangeUICuesDescr
source: Occurs when focus rectangles and keyboard cue underlines are being shown or hidden.
sr: Происходит, когда отображаются или скрываются прямоугольники фокуса и подчеркнутые знаки вызова с клавиатуры.

# ControlOnClickDescr
source: Occurs when the component is clicked.
sr: Возникает при щелчке элемента управления.

# ControlOnClientSizeChangedDescr
source: Event raised when the value of the ClientSize property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства ClientSize.

# ControlOnContextMenuChangedDescr
source: Occurs when the value of the ContextMenu property changes.
sr: Событие возникает, когда в Control изменяется значение свойства ContextMenu.

# ControlOnControlAddedDescr
source: Occurs when a control is added to this control.
sr: Происходит, когда к этому элементу управления добавляется другой элемент управления.

# ControlOnControlRemovedDescr
source: Occurs when a control is removed from this control.
sr: Происходит, когда из этого элемента управления удаляется другой элемент управления.

# ControlOnCreateHandleDescr
source: Occurs when the control's native handle is created.
sr: Происходит при создании собственного дескриптора данного элемента управления.

# ControlOnCursorChangedDescr
source: Event raised when the value of the Cursor property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства Cursor.

# ControlOnDestroyHandleDescr
source: Occurs when the control's native handle is destroyed.
sr: Происходит при ликвидации собственного дескриптора данного элемента управления.

# ControlOnDockChangedDescr
source: Event raised when the value of the Dock property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства Dock.

# ControlOnDoubleClickDescr
source: Occurs when the component is double-clicked.
sr: Возникает при двойном щелчке данного элемента управления.

# ControlOnDpiChangedAfterParentDescr
source: Occurs when the top level parent of this control is moved to a monitor with a different resolution and scaling level, or when parent's monitor scaling level is changed in Windows settings. Child windows receive this message after parent window receives DpiChanged event.
sr: Происходит, когда родительский элемент верхнего уровня для этого элемента управления перемещается на монитор с другим разрешением и уровнем масштабирования или когда уровень масштабирования монитора родительского элемента изменен в параметрах Windows. Дочерние окна получат это сообщение после того, как в родительском окне возникнет событие DpiChanged.

# ControlOnDpiChangedBeforeParentDescr
source: Occurs when the top level parent of this control is moved to a monitor with a different resolution and scaling level, or when parent's monitor scaling level is changed in Windows settings. Child windows receive this message before parent window receives DpiChanged event.
sr: Происходит, когда родительский элемент верхнего уровня для этого элемента управления перемещается на монитор с другим разрешением и уровнем масштабирования или когда уровень масштабирования монитора родительского элемента изменен в параметрах Windows. Дочерние окна получат это сообщение перед тем, как в родительском окне возникнет событие DpiChanged.

# ControlOnDragDropDescr
source: Occurs when a drag-and-drop operation is completed.
sr: Возникает при завершении операции перетаскивания.

# ControlOnDragEnterDescr
source: Occurs when the mouse drags an item into the client area for this Control.
sr: Происходит, когда элемент перетаскивается с помощью мыши в клиентскую область этого элемента управления.

# ControlOnDragLeaveDescr
source: Occurs when an object is dragged out of the control's bounds.
sr: Возникает, когда объект перетаскивается за пределы элемента управления.

# ControlOnDragOverDescr
source: Occurs when an object is dragged over the control's bounds.
sr: Возникает, когда объект перетаскивается на элемент управления.

# ControlOnEnabledChangedDescr
source: Occurs when the control's enabled state changes.
sr: Происходит, когда изменяется включенное состояние этого элемента управления.

# ControlOnEnterDescr
source: Occurs when the control becomes the active control of the form.
sr: Происходит, когда элемент управления становится активным элементом управления данной формы.

# ControlOnFontChangedDescr
source: Event raised when the value of the Font property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства Font.

# ControlOnForeColorChangedDescr
source: Event raised when the value of the ForeColor property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства ForeColor.

# ControlOnGiveFeedbackDescr
source: Occurs when the mouse drags an item. The system requests that the Control provide feedback to that effect.
sr: Происходит, когда элемент перетаскивается с помощью мыши. Система запрашивает у элемента управления обеспечение обратной связи с этим эффектом.

# ControlOnGotFocusDescr
source: Occurs when the control gets focus.
sr: Происходит при переключении фокуса на данный элемент управления.

# ControlOnHelpDescr
source: Occurs when the user invokes Help for the control.
sr: Возникает, когда пользователь вызывает справку для данного элемента управления.

# ControlOnImeModeChangedDescr
source: Occurs when the control's input method editor (IME) mode changes.
sr: Возникает, когда изменяется режим редактора метода ввода (IME) этого элемента управления.

# ControlOnInvalidateDescr
source: Occurs when a control's display requires redrawing.
sr: Возникает, когда для отображения элемента управления требуется перерисовка.

# ControlOnKeyDownDescr
source: Occurs when a key is first pressed.
sr: Происходит в момент первого нажатия клавиши.

# ControlOnKeyPressDescr
source: Occurs when the control has focus and the user presses and releases a key.
sr: Возникает, когда этот элемент управления находится в фокусе и пользователь нажимает и отпускает клавишу.

# ControlOnKeyUpDescr
source: Occurs when a key is released.
sr: Происходит в момент отпускания клавиши.

# ControlOnLayoutDescr
source: Occurs when the control is about to lay out its contents.
sr: Происходит, когда элемент управления готов к отображению своего содержимого.

# ControlOnLeaveDescr
source: Occurs when the control is no longer the active control of the form.
sr: Происходит, когда элемент управления перестает быть активным элементом управления данной формы.

# ControlOnLocationChangedDescr
source: Event raised when the value of the Location property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства Location.

# ControlOnLostFocusDescr
source: Occurs when the control loses focus.
sr: Возникает при потере фокуса элементом управления.

# ControlOnMarginChangedDescr
source: Occurs when the Margin property has changed.
sr: Возникает после изменения свойства Margin.

# ControlOnMouseCaptureChangedDescr
source: Occurs after the mouse capture is changed.
sr: Возникает после изменения перехвата сообщений от мыши.

# ControlOnMouseClickDescr
source: Occurs when the control is clicked by the mouse.
sr: Возникает при щелчке мышью элемента управления.

# ControlOnMouseDoubleClickDescr
source: Occurs when the control is double clicked by the mouse.
sr: Возникает при двойном щелчке мышью элемента управления.

# ControlOnMouseDownDescr
source: Occurs when the mouse pointer is over the component and a mouse button is pressed.
sr: Возникает в момент нажатия кнопки мыши, когда указатель мыши находится над компонентом.

# ControlOnMouseEnterDescr
source: Occurs when the mouse enters the visible part of the control.
sr: Происходит, когда указатель мыши входит в видимую часть данного элемента управления.

# ControlOnMouseHoverDescr
source: Occurs when the mouse remains stationary inside of the control for an amount of time.
sr: Происходит, когда указатель мыши остается неподвижным некоторое время в пределах данного элемента управления.

# ControlOnMouseLeaveDescr
source: Occurs when the mouse leaves the visible part of the control.
sr: Происходит, когда указатель мыши выходит за пределы видимой части данного элемента управления.

# ControlOnMouseMoveDescr
source: Occurs when the mouse pointer is moved over the component.
sr: Возникает при наведении указателя мыши на компонент.

# ControlOnMouseUpDescr
source: Occurs when the mouse pointer is over the component and a mouse button is released.
sr: Возникает в момент отпускания кнопки мыши, когда указатель мыши находится над компонентом.

# ControlOnMouseWheelDescr
source: Occurs when the mouse wheel moves while the control has focus.
sr: Возникает при прокручивании колеса мыши, если данный элемент управления находится в фокусе.

# ControlOnMoveDescr
source: Occurs when a control is moved.
sr: Происходит при перемещении элемента управления.

# ControlOnPaddingChangedDescr
source: Occurs when the Padding property has changed.
sr: Возникает после изменения свойства Padding.

# ControlOnPaintDescr
source: Occurs when a control needs repainting.
sr: Происходит при необходимости перерисовки элемента управления.

# ControlOnParentChangedDescr
source: Event raised when the value of the Parent property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства Parent.

# ControlOnQueryAccessibilityHelpDescr
source: Occurs when an Accessibility client invokes Help for the control.
sr: Возникает, когда клиент специальных возможностей вызывает справку для данного элемента управления.

# ControlOnQueryContinueDragDescr
source: Occurs when the mouse drags an item. The system requests whether the drag-and-drop operation should be allowed to continue.
sr: Происходит при перетаскивании элемента. Система запрашивает, можно ли продолжать операцию перетаскивания мышью.

# ControlOnResizeBeginDescr
source: Occurs when the control enters the sizing modal loop.
sr: Возникает, когда элемент управления входит в модальный цикл задания размеров.

# ControlOnResizeDescr
source: Occurs when a control is resized.
sr: Происходит при изменении размера элемента управления.

# ControlOnResizeEndDescr
source: Occurs when the control exits the sizing modal loop.
sr: Возникает, когда элемент управления выходит из модального цикла задания размеров.

# ControlOnRightToLeftChangedDescr
source: Occurs when the value of the RightToLeft property changes.
sr: Возникает при изменении значения свойства RightToLeft.

# ControlOnRightToLeftLayoutChangedDescr
source: Occurs when the value of the RightToLeftLayout property changes.
sr: Возникает при изменении значения свойства RightToLeftLayout.

# ControlOnSizeChangedDescr
source: Event raised when the value of the Size property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства Size.

# ControlOnStyleChangedDescr
source: Event raised when the window style of a Control is changed.
sr: Событие возникает, когда в Control изменяется стиль окна.

# ControlOnSystemColorsChangedDescr
source: Event raised when the system colors change.
sr: Событие возникает при изменении системной палитры.

# ControlOnTabIndexChangedDescr
source: Event raised when the value of the TabIndex property is changed.
sr: Событие возникает при изменении значения свойства TabIndex.

# ControlOnTabStopChangedDescr
source: Event raised when the value of the TabStop property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства TabStop.

# ControlOnTextChangedDescr
source: Event raised when the value of the Text property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства Text.

# ControlOnValidatedDescr
source: Occurs after a control has been successfully validated.
sr: Происходит после успешной проверки корректности в элементе управления.

# ControlOnValidatingDescr
source: Occurs when the control is validating.
sr: Возникает при проверке действительности элемента управления.

# ControlOnVisibleChangedDescr
source: Occurs when the control's visibility changes.
sr: Происходит, когда изменяется видимость этого элемента управления.

# ControlPaddingDescr
source: Specifies the interior spacing of a control.
sr: Определяет промежутки внутри элемента управления.

# ControlParentDescr
source: The parent of this control.
sr: Родительский элемент данного элемента управления.

# ControlProductNameDescr
source: Retrieves the name of the product associated with this component.
sr: Считывает имя продукта, соответствующее этому компоненту.

# ControlProductVersionDescr
source: Retrieves the version of the product associated with this component.
sr: Считывает версию продукта, соответствующую этому компоненту.

# ControlRecreatingHandleDescr
source: Determines if this control is in the process of recreating its handle.
sr: Определяет, находится ли этот элемент управления в процессе восстановления его дескриптора.

# ControlRegionChangedDescr
source: Event raised when the value of Region property is changed on Control.
sr: Событие возникает, когда в Control изменяется значение свойства Region.

# ControlRegionDescr
source: The region, or shape, of this control.
sr: Область или геометрическая форма этого элемента управления.

# ControlResizeRedrawDescr
source: Indicates whether the control should redraw itself when resized.
sr: Указывает, должен ли элемент управления перерисовывать себя при изменении его размера.

# ControlRightDescr
source: The distance, in pixels, between the right edge of the control and the left edge of its container's client area.
sr: Расстояние (в пикселях) между правой границей элемента управления и левой границей клиентской области его контейнера.

# ControlRightToLeftDescr
source: Indicates whether the component should draw right-to-left for RTL languages.
sr: Указывает, должен ли этот элемент управления для языков с вводом текста справа налево перерисовываться в том же направлении.

# ControlRightToLeftLayoutDescr
source: Indicates whether the control layout is right-to-left when the RightToLeft property is set to Yes.
sr: Указывает, должен ли макет элемента управления перерисовываться справа налево, если для свойства RightToLeft установлено значение Yes.

# ControlSizeDescr
source: The size of the control in pixels.
sr: Размер элемента управления в пикселях.

# ControlTabIndexDescr
source: Determines the index in the TAB order that this control will occupy.
sr: Задает индекс порядка переключения клавишей TAB для данного элемента управления.

# ControlTabStopDescr
source: Indicates whether the user can use the TAB key to give focus to the control.
sr: Указывает, может ли пользователь переключать фокус на этот элемент управления клавишей TAB.

# ControlTagDescr
source: User-defined data associated with the object.
sr: Определяемые пользователем данные, связанные с этим объектом.

# ControlTextDescr
source: The text associated with the control.
sr: Текст, связанный с элементом управления.

# ControlTopDescr
source: The top of the control, in container coordinates.
sr: Верхний край данного элемента управления в координатах контейнера.

# ControlTopLevelControlDescr
source: Retrieves the top-level control that contains this control.
sr: Извлекает элемент управления верхнего уровня, содержащий этот элемент управления.

# ControlUnsupportedProperty
source: Getting value of property '{0}' is not supported by this method.
sr: Данный метод не поддерживает получение значения свойства '{0}'.

# ControlUseWaitCursorDescr
source: When this property is true, the Cursor property of the control and its child controls is set to WaitCursor.
sr: Если для этого свойства установлено значение true, для свойства Cursor данного элемента управления и его дочерних элементов управления устанавливается значение WaitCursor.

# ControlUserPreferenceChangedDescr
source: Event raised when SystemInformation UserPreference changed event is raised
sr: Событие возникает при возникновении события SystemInformation UserPreference changed

# ControlUserPreferenceChangingDescr
source: Event raised when SystemInformation UserPreferenceChanging event is raised
sr: Событие возникает при возникновении события SystemInformation UserPreferenceChanging

# ControlVisibleDescr
source: Determines whether the control is visible or hidden.
sr: Определяет, отображается или скрыт данный элемент управления.

# ControlWidthDescr
source: The width of the control, in container coordinates.
sr: Ширина элемента управления в координатах контейнера.

# ControlWindowTargetDescr
source: The location where native messages will be routed.
sr: Местоположение, в которое должны направляться собственные сообщения.

# ControlWithScrollbarsPositionDescr
source: The coordinates of the upper-left corner of the control relative to the upper-left corner of its container.
sr: Координаты левого верхнего угла элемента управления относительно левого верхнего угла его контейнера.
