Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# PDallowPagesDescr
source: Enables and disables the Pages option button.
sr: Активирует и дезактивирует кнопку режима Pages.

# PDallowPrintToFileDescr
source: Enables and disables the Print To File check box.
sr: Включает и отключает флажок проверки 'Печать в файл'.

# PDallowSelectionDescr
source: Enables and disables the Selection option button.
sr: Активирует и дезактивирует кнопку режима Selection.

# PDcantShowWithoutPrinter
source: PrintDialog needs a PrinterSettings object to display. Set PrintDialog.Document (preferred) or PrintDialog.PrinterSettings.
sr: Для отображения элементу PrintDialog требуется объект PrinterSettings. Задайте параметр Set PrintDialog.Document (предпочтительно) или PrintDialog.PrinterSettings.

# PDdocumentDescr
source: The PrintDocument to get printer settings from.
sr: PrintDocument, из которого извлекаются параметры печати.

# PDpageOutOfRange
source: Value {0} is out of range.
sr: Значение {0} находится за пределами диапазона.

# PDprintToFileDescr
source: Determines whether the Print To File check box is selected.
sr: Определяет, установлен ли флажок Print To File.

# PDprinterSettingsDescr
source: The PrinterSettings to use.
sr: Используемое свойство PrinterSettings.

# PDshowHelpDescr
source: Controls whether the Help button is displayed.
sr: Определяет, отображается ли кнопка 'Справка'.

# PDshowNetworkDescr
source: Controls whether the Network button is displayed.
sr: Определяет, отображается ли кнопка 'Сеть'.

# PDuseEXDialog
source: Gets or sets a value indicating whether the print dialog box in the Windows XP style should be shown for systems running Windows XP and later.
sr: Считывает или задает значение, определяющее, будет ли диалоговое окно печати отображаться в стиле Windows XP для систем под управлением Windows XP и более поздних.

# PSDallowMarginsDescr
source: Enables and disables editing of margins.
sr: Включает и отключает редактирование полей.

# PSDallowOrientationDescr
source: Enables and disables the Orientation radio buttons.
sr: Включает и отключает переключатель 'Ориентация'.

# PSDallowPaperDescr
source: Enables and disables editing of paper size.
sr: Включает и отключает редактирование формата бумаги.

# PSDallowPrinterDescr
source: Enables and disables Printer button.
sr: Включает и отключает кнопку 'Принтер'.

# PSDcantShowWithoutPage
source: PageSetupDialog needs a PageSettings object to display. Set PageSetupDialog.Document (preferred), PageSetupDialog.PrinterSettings, or PageSetupDialog.PageSettings.
sr: Элементу PageSetupDialog требуется для отображения объект PageSettings. Задайте параметры PageSetupDialog.Document (предпочтительно), PageSetupDialog.PrinterSettings или PageSetupDialog.PageSettings.

# PSDenableMetricDescr
source: Gets or sets a value indicating whether the margin settings, when displayed in millimeters, should be automatically converted to and from hundredths of an inch.
sr: Считывает или задает значение, указывающее, должны ли параметры полей, указанные в миллиметрах, автоматически преобразовываться в сотые доли дюйма и обратно.

# PSDminMarginsDescr
source: The smallest margins the user is allowed to select.
sr: Минимальная ширина полей, которую пользователь может выбрать.

# PSDpageSettingsDescr
source: The PageSettings the dialog box will modify.
sr: Параметр PageSettings, который будет изменен данным диалоговым окном.

# PSDprinterSettingsDescr
source: The PrinterSettings the dialog box will modify when the user clicks the Printer button.
sr: Параметр PrinterSettings, который будет изменен данным диалоговым окном, когда пользователь нажмет кнопку Printer.

# PSDshowHelpDescr
source: Controls whether the Help button is displayed.
sr: Определяет, отображается ли кнопка 'Справка'.

# PSDshowNetworkDescr
source: Controls whether the Network button is displayed.
sr: Определяет, отображается ли кнопка 'Сеть'.

# PaddingAllDescr
source: Number of pixels along all borders to pad docked controls.
sr: Количество пикселей вдоль всех границ, стыкующихся с элементами управления.

# PaddingBottomDescr
source: Number of pixels along the bottom border to pad docked controls.
sr: Количество пикселей вдоль нижней границы, стыкующейся с элементами управления.

# PaddingLeftDescr
source: Number of pixels along the left border to pad docked controls.
sr: Число пикселей вдоль левой границы для размещения пристыкованных элементов управления.

# PaddingRightDescr
source: Number of pixels along the right border to pad docked controls.
sr: Число пикселей вдоль правой границы для размещения пристыкованных элементов управления.

# PaddingTopDescr
source: Number of pixels along the top border to pad docked controls.
sr: Число пикселей вдоль верхней границы для размещения пристыкованных элементов управления.

# PanelBorderStyleDescr
source: Indicates whether the panel should have a border.
sr: Показывает, должны ли у панели быть границы.

# PictureBoxBorderStyleDescr
source: Controls what type of border the PictureBox should have.
sr: Определяет тип границы для PictureBox.

# PictureBoxCancelAsyncDescr
source: Attempts to cancel any current image-loading operation.
sr: Пытается прекратить все текущие операции загрузки изображений.

# PictureBoxErrorImageDescr
source: Image to display when the load of another image fails.
sr: Изображение, отображаемое при невозможности загрузки другого изображения.

# PictureBoxImageDescr
source: The image displayed in the PictureBox.
sr: Изображение, отображаемое в PictureBox.

# PictureBoxImageLocationDescr
source: Disk or Web location to load image from.
sr: Местоположение на диске или в Интернете для загрузки изображения.

# PictureBoxInitialImageDescr
source: Image to display while another image is loading.
sr: Изображение, отображаемое во время загрузки другого изображения.

# PictureBoxLoad0Descr
source: Loads the image from the location specified in ImageLocation.
sr: Загружает изображение из местоположения, указанного в параметре ImageLocation.

# PictureBoxLoad1Descr
source: Loads the image from the provided location.
sr: Загружает изображение из предоставленного местоположения.

# PictureBoxLoadAsync0Descr
source: Initiates asynchronous loading of the image from the location specified in ImageLocation.
sr: Инициирует асинхронную загрузку изображения из местоположения, указанного в параметре ImageLocation.

# PictureBoxLoadAsync1Descr
source: Initiates asynchronous loading of the image from the provided location.
sr: Инициирует асинхронную загрузку изображения из предоставленного местоположения.

# PictureBoxLoadCompletedDescr
source: Event raised when loading into a PictureBox finishes.
sr: Событие, возникающее при окончании загрузки в PictureBox.

# PictureBoxLoadProgressChangedDescr
source: Event raised when progress is reported during loading into a PictureBox.
sr: Событие, возникающее при сигнале об изменении хода процесса во время загрузки в PictureBox.

# PictureBoxLoadProgressDescr
source: Indicates the progress of the background download task.
sr: Показывает ход выполнения фонового задания скачивания.

# PictureBoxNoImageLocation
source: ImageLocation must be set.
sr: Необходимо задать параметр ImageLocation.

# PictureBoxOnSizeModeChangedDescr
source: Event raised when the value of the SizeMode property is changed on the PictureBox.
sr: Событие, возникающее при изменении свойства SizeMode в элементе PictureBox.

# PictureBoxSizeModeDescr
source: Controls how the PictureBox will handle image placement and control sizing.
sr: Определяет, как будет обрабатываться размещение рисунка в данной области рисунка и изменение размеров элемента управления.

# PictureBoxWaitOnLoadDescr
source: Controls whether processing will stop until the image is loaded.
sr: Указывает, будет ли обработка приостановлена до окончания загрузки изображения.

# PopupControlBadParentArgument
source: Cannot set the ParentPopup to be yourself.
sr: Нельзя задать ParentPopup принадлежащим самому себе.

# PreviewKeyDownDescr
source: Occurs before the KeyDown event when a key is pressed while focus is on this control.
sr: Возникает при нажатии клавиши перед событием KeyDown, если фокус находится на данном элементе управления.

# PrintControllerWithStatusDialog_Cancel
source: Cancel
sr: Отмена

# PrintControllerWithStatusDialog_Canceling
source: Canceling Print...
sr: Выполняется отмена печати...

# PrintControllerWithStatusDialog_DialogTitlePreview
source: Generating Previews
sr: Подготовка к предварительному просмотру

# PrintControllerWithStatusDialog_DialogTitlePrint
source: Printing
sr: Печать

# PrintControllerWithStatusDialog_NowPrinting
source: Page {0} of {1}
sr: Страница {0} из {1}

# PrintPreviewAntiAliasDescr
source: Controls if the print preview will be rendered with anti-aliasing. Using AntiAlias provides a more accurate display of the document, but it is slower.
sr: Задает режим отображения предварительного изображения печати с фильтрацией-сглаживанием. Режим AntiAlias обеспечивает более точное отображение документа, но работает медленнее.

# PrintPreviewAutoZoomDescr
source: Determines whether to automatically adjust zoom to fill available space.
sr: Определяет, подбирать ли автоматически увеличение для заполнения всего доступного пространства.

# PrintPreviewColumnsDescr
source: Number of pages across.
sr: Число страниц по горизонтали.

# PrintPreviewControlZoomNegative
source: Zoom must be 0 or greater. Negative values are not permitted.
sr: Коэффициент увеличения должен быть 0 или больше. Отрицательные значения недопустимы.

# PrintPreviewDialog_PrintPreview
source: Print preview
sr: Предварительный просмотр

# PrintPreviewDocumentDescr
source: PrintDocument to be previewed.
sr: Предварительно просматриваемый PrintDocument.

# PrintPreviewExceptionPrinting
source: Document cannot be displayed.
sr: Документ нельзя отобразить.

# PrintPreviewNoPages
source: Document does not contain any pages.
sr: Документ не содержит ни одной страницы.

# PrintPreviewPrintPreviewControlDescr
source: PrintPreviewControl to use as the dialog's core.
sr: Элемент управления PrintPreviewControl для использования в качестве основы данного диалога.

# PrintPreviewRowsDescr
source: The number of pages displayed vertically down the screen.
sr: Число страниц, отображаемое по вертикали сверху вниз.

# PrintPreviewStartPageDescr
source: Indicates the page number to start previewing.
sr: Указывает число страниц в начале предварительного просмотра.

# PrintPreviewZoomDescr
source: Indicates how large the pages will appear.
sr: Увеличение.

# ProfessionalColorsButtonCheckedGradientBeginDescr
source: Starting color of the gradient used when the button is checked.
sr: Начальный цвет градиента, используемый при выборе этой кнопки.

# ProfessionalColorsButtonCheckedGradientEndDescr
source: End color of the gradient used when the button is checked.
sr: Последний цвет градиента, используемый при выборе этой кнопки.

# ProfessionalColorsButtonCheckedGradientMiddleDescr
source: Middle color of the gradient used when the button is checked.
sr: Средний цвет градиента, используемый при выборе этой кнопки.

# ProfessionalColorsButtonCheckedHighlightBorderDescr
source: Border color to use with ButtonCheckedHighlight.
sr: Цвет границы для использования с ButtonCheckedHighlight.

# ProfessionalColorsButtonCheckedHighlightDescr
source: Solid color used when the button is checked.
sr: Однородный цвет, используемый при выборе этой кнопки.

# ProfessionalColorsButtonPressedBorderDescr
source: Border color to use with the pressed button gradient colors (ButtonPressedGradient*).
sr: Цвет границы для использования вместе с градиентом цветов нажатой кнопки (ButtonPressedGradient*).

# ProfessionalColorsButtonPressedGradientBeginDescr
source: Starting color of the gradient used when the button is pressed.
sr: Начальный цвет градиента, используемый при нажатии этой кнопки.

# ProfessionalColorsButtonPressedGradientEndDescr
source: End color of the gradient used when the button is pressed.
sr: Последний цвет градиента, используемый при нажатии этой кнопки.

# ProfessionalColorsButtonPressedGradientMiddleDescr
source: Middle color of the gradient used when the button is pressed.
sr: Средний цвет градиента, используемый при нажатии этой кнопки.

# ProfessionalColorsButtonPressedHighlightBorderDescr
source: Border color to use with ButtonPressedHighlight.
sr: Цвет границы для использования с ButtonPressedHighlight.

# ProfessionalColorsButtonPressedHighlightDescr
source: Solid color used when the button is pressed.
sr: Однородный цвет, используемый при нажатии кнопки.

# ProfessionalColorsButtonSelectedBorderDescr
source: Border color to use with the selected button gradient colors (ButtonCheckedGradient*).
sr: Цвет границы для использования совместно с градиентом цветов (ButtonCheckedGradient*).

# ProfessionalColorsButtonSelectedGradientBeginDescr
source: Starting color of the gradient used when the button is selected.
sr: Начальный цвет градиента, используемый при выборе этой кнопки.

# ProfessionalColorsButtonSelectedGradientEndDescr
source: End color of the gradient used when the button is selected.
sr: Последний цвет градиента, используемый при выборе этой кнопки.

# ProfessionalColorsButtonSelectedGradientMiddleDescr
source: Middle color of the gradient used when the button is selected.
sr: Средний цвет градиента, используемый при выборе этой кнопки.

# ProfessionalColorsButtonSelectedHighlightBorderDescr
source: Border color to use with ButtonSelectedHighlight.
sr: Цвет границы для использования с ButtonSelectedHighlight.

# ProfessionalColorsButtonSelectedHighlightDescr
source: Solid color used when the button is selected.
sr: Однородный цвет, используемый при выборе этой кнопки.

# ProfessionalColorsCheckBackgroundDescr
source: Solid color to use when the button is checked and gradients are being used.
sr: Однородный цвет, когда выбрана кнопка и используются градиенты.

# ProfessionalColorsCheckPressedBackgroundDescr
source: Solid color to use when the button is checked and selected and gradients are being used.
sr: Однородный цвет, когда кнопка отмечена и выбрана и используются градиенты.

# ProfessionalColorsCheckSelectedBackgroundDescr
source: Solid color to use when the button is checked and selected and gradients are being used.
sr: Однородный цвет, когда кнопка отмечена и выбрана и используются градиенты.

# ProfessionalColorsGripDarkDescr
source: Color to use to for shadow effects on the grip.
sr: Цвет для эффекта теней на захвате.

# ProfessionalColorsGripLightDescr
source: Color to use to for highlight effects on the grip.
sr: Цвет для эффекта подсветки на захвате.

# ProfessionalColorsImageMarginGradientBeginDescr
source: Starting color of the gradient used in the image margin.
sr: Начальный цвет градиента, используемый на полях изображения.

# ProfessionalColorsImageMarginGradientEndDescr
source: End color of the gradient used in the image margin.
sr: Последний цвет градиента, используемый на полях изображения.

# ProfessionalColorsImageMarginGradientMiddleDescr
source: Middle color of the gradient used in the image margin.
sr: Средний цвет градиента, используемый на полях изображения.

# ProfessionalColorsImageMarginRevealedGradientBeginDescr
source: Starting color of the gradient used in the image margin when an item is revealed.
sr: Начальный цвет градиента, используемый на полях изображения, когда оно отображено.

# ProfessionalColorsImageMarginRevealedGradientEndDescr
source: End color of the gradient used in the image margin when an item is revealed.
sr: Последний цвет градиента, используемый на полях изображения, когда оно отображено.

# ProfessionalColorsImageMarginRevealedGradientMiddleDescr
source: Middle color of the gradient used in the image margin when an item is revealed.
sr: Средний цвет градиента, используемый на полях изображения, когда оно отображено.

# ProfessionalColorsMenuBorderDescr
source: The border color to use around the edge of a drop-down menu.
sr: Цвет границы вокруг выпадающего меню.

# ProfessionalColorsMenuItemBorderDescr
source: The border color to use with MenuItem.
sr: Цвет границы для использования с MenuItem.

# ProfessionalColorsMenuItemPressedGradientBeginDescr
source: Starting color of the gradient used when a top level menu item is pressed.
sr: Начальный цвет градиента, используемый нажатии пункта меню верхнего уровня.

# ProfessionalColorsMenuItemPressedGradientEndDescr
source: End color of the gradient used when a top level menu item is pressed.
sr: Последний цвет градиента, используемый нажатии пункта меню верхнего уровня.

# ProfessionalColorsMenuItemPressedGradientMiddleDescr
source: Middle color of the gradient used when a top level menu item is pressed.
sr: Средний цвет градиента, используемый нажатии пункта меню верхнего уровня.

# ProfessionalColorsMenuItemSelectedDescr
source: Solid color to use when a non-top level menu item is selected
sr: Однородный цвет, используемый при выборе пункта меню не верхнего уровня.

# ProfessionalColorsMenuItemSelectedGradientBeginDescr
source: Starting color of the gradient used when the menu item is selected.
sr: Начальный цвет градиента, используемый при выборе этого пункта меню.

# ProfessionalColorsMenuItemSelectedGradientEndDescr
source: End color of the gradient used when the menu item is selected.
sr: Последний цвет градиента, используемый при выборе этого пункта меню.

# ProfessionalColorsMenuStripGradientBeginDescr
source: Starting color of the gradient used in the MenuStrip.
sr: Начальный цвет градиента, используемый в MenuStrip.

# ProfessionalColorsMenuStripGradientEndDescr
source: Middle color of the gradient used in the MenuStrip.
sr: Последний цвет градиента, используемый в MenuStrip.

# ProfessionalColorsOverflowButtonGradientBeginDescr
source: Starting color of the gradient used in the overflow button.
sr: Начальный цвет градиента, используемый в кнопке переполнения.

# ProfessionalColorsOverflowButtonGradientEndDescr
source: End color of the gradient used in the overflow button.
sr: Последний цвет градиента, используемый в кнопке переполнения.

# ProfessionalColorsOverflowButtonGradientMiddleDescr
source: Middle color of the gradient used in the overflow button.
sr: Средний цвет градиента, используемый в кнопке переполнения.

# ProfessionalColorsRaftingContainerGradientBeginDescr
source: Starting color of the gradient used in the RaftingContainer.
sr: Начальный цвет градиента, используемый в RaftingContainer.

# ProfessionalColorsRaftingContainerGradientEndDescr
source: End color of the gradient used in the RaftingContainer.
sr: Последний цвет градиента, используемый в RaftingContainer.

# ProfessionalColorsSeparatorDarkDescr
source: Color to use to for shadow effects on the separator.
sr: Цвет для эффекта теней на разделителе.

# ProfessionalColorsSeparatorLightDescr
source: Color to use to for highlight effects on the separator.
sr: Цвет для эффекта подсветки на разделителе.

# ProfessionalColorsStatusStripGradientBeginDescr
source: Starting color of the gradient used in the StatusStrip.
sr: Начальный цвет градиента, используемый в StatusStrip.

# ProfessionalColorsStatusStripGradientEndDescr
source: End color of the gradient used in the StatusStrip.
sr: Последний цвет градиента, используемый в StatusStrip.

# ProfessionalColorsToolStripBorderDescr
source: Border color to use on the bottom edge of the ToolStrip.
sr: Цвет границы, используемый на нижнем крае ToolStrip.

# ProfessionalColorsToolStripContentPanelGradientBeginDescr
source: Starting color of the gradient used in the ToolStripContentPanel.
sr: Начальный цвет градиента, используемый в ToolStripContentPanel.

# ProfessionalColorsToolStripContentPanelGradientEndDescr
source: End color of the gradient used in the ToolStripContentPanel.
sr: Последний цвет градиента, используемый в ToolStripContentPanel.

# ProfessionalColorsToolStripDropDownBackgroundDescr
source: Solid background color of the ToolStripDropDown.
sr: Однородный цвет фона для ToolStripDropDown.

# ProfessionalColorsToolStripGradientBeginDescr
source: Starting color of the gradient used in the ToolStrip background.
sr: Начальный цвет градиента, используемый для фона ToolStrip.

# ProfessionalColorsToolStripGradientEndDescr
source: End color of the gradient used in the ToolStrip background.
sr: Последний цвет градиента, используемый для фона ToolStrip.

# ProfessionalColorsToolStripGradientMiddleDescr
source: Middle color of the gradient used in the ToolStrip background.
sr: Средний цвет градиента, используемый для фона ToolStrip.

# ProfessionalColorsToolStripPanelGradientBeginDescr
source: Starting color of the gradient used in the ToolStripPanel.
sr: Начальный цвет градиента, используемый в ToolStripPanel.

# ProfessionalColorsToolStripPanelGradientEndDescr
source: End color of the gradient used in the ToolStripPanel.
sr: Последний цвет градиента, используемый в ToolStripPanel.

# ProgressBarIncrementMarqueeException
source: Increment should not be called if the style is Marquee.
sr: Нельзя вызывать Increment при использовании стиля Marquee.

# ProgressBarMarqueeAnimationSpeed
source: The speed of the marquee animation in milliseconds.
sr: Скорость анимации области выделения в миллисекундах.

# ProgressBarMaximumDescr
source: The upper bound of the range this ProgressBar is working with.
sr: Верхняя граница диапазона, в котором действует ProgressBar.

# ProgressBarMinimumDescr
source: The lower bound of the range this ProgressBar is working with.
sr: Нижняя граница диапазона, в котором действует ProgressBar.

# ProgressBarPerformStepMarqueeException
source: PerformStep should not be called if the style is Marquee.
sr: Нельзя вызывать PerformStep при использовании стиля Marquee.

# ProgressBarStepDescr
source: The amount to increment the current value of the control by when the PerformStep() method is called.
sr: Величина приращения текущего значения элемента управления, после которого вызывается метод PerformStep().

# ProgressBarStyleDescr
source: This property allows the user to set the style of the ProgressBar.
sr: Данное свойство позволяет пользователю задать стиль элемента ProgressBar.

# ProgressBarValueDescr
source: The current value for the ProgressBar, in the range specified by the minimum and maximum properties.
sr: Текущее значение ProgressBar в диапазоне, указанном в свойствах максимума и минимума.

# ProgressBarValueMarqueeException
source: Value must not be set if the style is Marquee.
sr: Нельзя задать значение при использовании стиля Marquee.

# PropertyCategoryAppearance
source: Appearance
sr: Внешний вид

# PropertyCategoryBehavior
source: Behavior
sr: Поведение

# PropertyCategoryData
source: Data
sr: Данные

# PropertyCategoryFont
source: Font
sr: Шрифт

# PropertyCategoryList
source: List
sr: Список

# PropertyCategoryMisc
source: Misc
sr: Прочее

# PropertyCategoryPosition
source: Position
sr: Положение

# PropertyCategoryScale
source: Scale
sr: Масштаб

# PropertyCategoryText
source: Text
sr: Текст

# PropertyGridBadTabIndex
source: Tab index not valid.
sr: Индекс вкладки недействителен.

# PropertyGridCanShowCommandsDesc
source: Sets whether the commands window will be displayed for components with commands.
sr: Определяет, должно ли для компонентов, использующих команды, отображаться окно команд.

# PropertyGridCanShowVisualStyleGlyphsDesc
source: Sets whether OS-enabled visual style glyphs can be used for the expansion nodes in the grid area.
sr: Указывает, можно ли использовать глифы визуального стиля с поддержкой ОС для раскрытия узлов в области таблицы.

# PropertyGridCategoryForeColorDesc
source: The text color used for category headings. The background color is determined by the LineColor property.
sr: Цвет текста для заголовков категорий. Цвет фона определяется свойством LineColor.

# PropertyGridCategorySplitterColorDesc
source: The color of the line that separates categories.
sr: Цвет линии, разделяющей категории.
