Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# SplitContainerPanel2MinSizeDescr
source: Determines the minimum distance of pixels of the splitter from the right or the bottom edge of Panel2.
sr: Определяет минимальное расстояние в пикселях от разделителя до правого или нижнего края Panel2.

# SplitContainerPanelHeight
source: The SplitterPanel's height cannot be set explicitly. Set the SplitterDistance on the SplitContainer instead.
sr: Высоту SplitterPanel нельзя задавать явно. Вместо этого задайте параметр SplitterDistance для данного SplitContainer.

# SplitContainerPanelWidth
source: The SplitterPanel's width cannot be set explicitly. Set the SplitterDistance on the SplitContainer instead.
sr: Ширину SplitterPanel нельзя задавать явно. Вместо этого задайте параметр SplitterDistance для данного SplitContainer.

# SplitContainerSplitterDistanceDescr
source: Determines pixel distance of the splitter from the left or top edge.
sr: Определяет расстояние в пикселях от разделителя до левого или верхнего края.

# SplitContainerSplitterIncrementDescr
source: Determines the number of pixels the splitter moves in increments. Default is 1.
sr: Определяет число пикселей, на которое разделитель перемещается при увеличении. По умолчанию оно равно 1.

# SplitContainerSplitterRectangleDescr
source: Determines the rectangle bounds of the splitter.
sr: Определяет прямоугольные границы разделителя.

# SplitContainerSplitterWidthDescr
source: Determines the thickness of the splitter.
sr: Определяет толщину разделителя.

# SplitterBorderStyleDescr
source: The border type of the control.
sr: Определяет тип границы для этого разделителя.

# SplitterDistanceNotAllowed
source: SplitterDistance must be between Panel1MinSize and Width - Panel2MinSize.
sr: Параметр SplitterDistance должен быть в границах Panel1MinSize и Width - Panel2MinSize.

# SplitterInvalidDockEnum
source: Splitter control must be docked left, right, top, or bottom.
sr: Элемент управления Splitter может пристыковываться налево, направо, наверх и вниз.

# SplitterMinExtraDescr
source: Specifies the minimum size of the undocked area.
sr: Указывает минимальный размер непристыкованной области.

# SplitterMinSizeDescr
source: Specifies the minimum size of the control being resized.
sr: Указывает минимальный размер элемента управления, размер которого сейчас изменяется.

# SplitterSplitPositionDescr
source: The current position of the splitter, or -1 if it is not bound to a control.
sr: Текущее положение разделителя или -1 (если он не привязан к элементу управления).

# SplitterSplitterMovedDescr
source: Occurs when the splitter is done being moved.
sr: Происходит при завершении перемещения разделителя.

# SplitterSplitterMovingDescr
source: Occurs when the splitter is being moved.
sr: Происходит при перемещении разделителя.

# StandardOleMarshalObjectGetMarshalerFailed
source: Failed to get marshaler for IID {0}.
sr: Не удалось получить упаковщик ("маршалер") для IID {0}.

# StatusBarAddFailed
source: Adding the panel to the native status bar control has not succeeded.
sr: Добавление панели к исходной строке состояния не удалось.

# StatusBarBadStatusBarPanel
source: Parameter must be of type StatusBarPanel.
sr: Параметр должен быть типа StatusBarPanel.

# StatusBarDrawItem
source: Occurs whenever a panel in the StatusBar needs to be painted.
sr: Происходит при необходимости прорисовать панель в StatusBar.

# StatusBarOnPanelClickDescr
source: Occurs when a panel within the status bar is clicked.
sr: Возникает при щелчке панели в строке состояния.

# StatusBarPanelAlignmentDescr
source: The alignment of the panel's text.
sr: Выравнивание текста панели.

# StatusBarPanelAutoSizeDescr
source: Determines how a panel will resize when the parent changes size.
sr: Определяет принцип изменения размера панели при изменении размера родительского окна.

# StatusBarPanelBorderStyleDescr
source: Determines what type of border a panel has.
sr: Задает тип границы панели.

# StatusBarPanelIconDescr
source: Determines what icon is displayed in the panel.
sr: Задает значок, отображаемый на данной панели.

# StatusBarPanelMinWidthDescr
source: The minimum width of the panel.
sr: Минимальная ширина данной панели.

# StatusBarPanelNameDescr
source: The name of the panel.
sr: Имя этой панели.

# StatusBarPanelStyleDescr
source: The style of the panel.
sr: Стиль данной панели.

# StatusBarPanelTextDescr
source: The text displayed in the panel.
sr: Заголовок на панели.

# StatusBarPanelToolTipTextDescr
source: The panel's ToolTip text.
sr: Текст подсказки для данной панели.

# StatusBarPanelWidthDescr
source: The width of the panel.
sr: Ширина данной панели.

# StatusBarPanelsDescr
source: The panels in the status bar.
sr: Панели в строке состояния.

# StatusBarShowPanelsDescr
source: Determines if a status bar displays panels, or if it displays a single line of text.
sr: Указывает, отображать в строке состояния панели или только одну строку текста.

# StatusBarSizingGripDescr
source: Determines whether a status bar has a sizing grip.
sr: Определяет, содержит ли строка состояния захват для изменения размера окна.

# StatusStripPanelBorderSidesDescr
source: Specifies the sides of the panel that should display borders.
sr: Задает стороны панели, на которых должны отображаться границы.

# StatusStripPanelBorderStyleDescr
source: Specifies the border style for the panel.
sr: Определяет стиль границ панели.

# StatusStripSizingGripDescr
source: Determines whether a StatusStrip has a sizing grip.
sr: Определяет наличие у StatusStrip инструмента изменения в размерах.

# SystemInformationFeatureNotSupported
source: Feature not supported with this operating system.
sr: Функция не поддерживается в данной ОС.

# TabControlTabPageNotOnTabControl
source: TabPage cannot be added to a '{0}'. TabPages can only be added to TabControls.
sr: TabPage нельзя добавить к '{0}'. TabPages можно добавлять только к TabControls.

# TabControlTabPageOnTabPage
source: TabPage cannot be added to another TabPage. TabPages can only be added to TabControls.
sr: TabPage нельзя добавить к другой TabPage. TabPages можно добавлять только к TabControls.

# TYPEINFOPROCESSORGetDocumentationFailed
source: ITypeInfo::GetDocumentation for DISPID 0x{0:X} returned hr=0x{1:X}, which will cause this property to be ignored. S_OK must be returned. Component={2}
sr: ITypeInfo::GetDocumentation для DISPID 0x{0:X} возвратил hr=0x{1:X}. В результате это свойство будет проигнорировано. Должно быть возвращено значение S_OK. Компонент={2}

# TYPEINFOPROCESSORGetRefTypeInfoFailed
source: ITypeInfo::GetRefTypeInfo returned hr={0:X}, so the data type cannot be retrieved.
sr: ITypeInfo::GetRefTypeInfo возвратил hr={0:X}, поэтому невозможно извлечь тип данных.

# TYPEINFOPROCESSORGetTypeAttrFailed
source: ITypeInfo::GetTypeAttr returned hr={0:X}, so the data type cannot be retrieved.
sr: ITypeInfo::GetTypeAttr возвратил hr={0:X}, поэтому невозможно извлечь тип данных.

# TabBaseAlignmentDescr
source: Determines whether the tabs appear on the top, bottom, left, or right side of the Control (left or right are implicitly multilined).
sr: Задает местоположение вкладок - сверху, снизу, слева или справа от элемента управления (слева и справа - многострочные по умолчанию).

# TabBaseAppearanceDescr
source: Indicates whether the tabs are painted as buttons or regular tabs.
sr: Указывает, прорисовываются ли вкладки как кнопки или как обычные вкладки.

# TabBaseDrawModeDescr
source: Indicates whether the user or the system paints the captions.
sr: Указывает, кто организует прорисовку заголовков - пользователь или система.

# TabBaseHotTrackDescr
source: Indicates whether the tabs visually change when the mouse passes over them.
sr: Указывает, изменяется ли вид вкладок при перемещении над ними курсора мыши.

# TabBaseImageListDescr
source: The ImageList object from which this tab takes its images.
sr: Объект ImageList, из которого получаются изображения этой вкладки.

# TabBaseItemSizeDescr
source: Determines the width of fixed-width or owner-draw tabs and the height of all tabs.
sr: Задает ширину вкладок фиксированной ширины или вкладок, прорисовываемых владельцем, а также высоту всех вкладок.

# TabBaseMultilineDescr
source: Indicates if more than one row of tabs is allowed.
sr: Указывает, разрешено ли несколько рядов вкладок.

# TabBasePaddingDescr
source: Indicates how much extra space should be added around the text/image in the tab.
sr: Указывает, какое дополнительное расстояние необходимо добавить по краям текста/изображения вкладки, если свойство drawMode имеет значение Fixed.

# TabBaseRowCountDescr
source: The number of rows currently being displayed in the tab strip.
sr: Число строк, отображаемых в текущий момент на полосе вкладок.

# TabBaseShowToolTipsDescr
source: Indicates whether ToolTips should be shown for tabs that have their ToolTips set.
sr: Указывает, должны ли отображаться подсказки для вкладок, имеющих свой набор подсказок.

# TabBaseSizeModeDescr
source: Indicates how tabs are sized.
sr: Указывает, как определяется размер вкладок.

# TabBaseTabCountDescr
source: The number of tabs in the tab strip.
sr: Число вкладок на полосе вкладок.

# TabControlDeselectedEventDescr
source: Occurs after a tab page is deselected as the topmost tab page.
sr: Происходит после отмены выбора вкладки в качестве главной.

# TabControlDeselectingEventDescr
source: Occurs when a tab page is being deselected.
sr: Происходит при отмене выбора вкладки.

# TabControlInvalidTabPageType
source: Cannot add '{0}' to TabControl. Only TabPages can be directly added to TabControls.
sr: Невозможно добавить {0} к TabControl. К TabControls могут напрямую добавляться только TabPage.

# TabControlSelectedEventDescr
source: Occurs after a tab page is selected as the topmost tab page.
sr: Происходит после выбора вкладки в качестве главной.

# TabControlSelectedTabDescr
source: The currently selected tab page.
sr: Выбранная в данный момент вкладка.

# TabControlSelectingEventDescr
source: Occurs when a tab page is being selected.
sr: Происходит при выборе вкладки.

# TabControlTabsDescr
source: The TabPages in the TabControl.
sr: Число TabPages в TabControl.

# TabItemImageIndexDescr
source: Identifies the image displayed on the tab.
sr: Указывает на изображение в соответствующем ImageList, которое используется для этой вкладки.

# TabItemToolTipTextDescr
source: The text that is shown when the mouse hovers over this tab.
sr: Текст, отображаемый при задержке курсора мыши над этой вкладкой.

# TabItemUseVisualStyleBackColorDescr
source: Determines if the background is drawn using visual styles, if supported.
sr: Определяет, будет ли фон выводиться с использованием стилей отображения, если они поддерживаются.

# TableBeginMustBeCalledPrior
source: TableBegin() must be called before using this method.
sr: Перед использованием данного метода нужно вызвать TableBegin().

# TableBeginNotCalled
source: No table is currently being printing. TableBegin() has not been called.
sr: В данный момент не печатается ни одной таблицы. Функция TableBegin() не была вызвана.

# TableLayoutPanelCellBorderStyleDescr
source: Indicates the appearance of cell borders in a table.
sr: Задает внешний вид границ ячеек в таблице.

# TableLayoutPanelFullDesc
source: Additional Rows or Columns cannot be created. TableLayoutPanel is full and GrowStyle is 'FixedSize'.
sr: Не удается создать дополнительные элементы Rows или Columns. TableLayoutPanel заполнена, а для параметра GrowStyle задано значение FixedSize.

# TableLayoutPanelGrowStyleDescr
source: Indicates whether a TableLayoutPanel will expand to include new cells when all existing cells are occupied.
sr: Указывает, может ли TableLayoutPanel расширяться и включать новые ячейки, если все существующие ячейки заняты.

# TableLayoutPanelOnPaintCellDescr
source: Occurs when a cell needs repainting.
sr: Возникает, когда для ячейки требуется перерисовка.

# TableLayoutPanelSpanDesc
source: TableLayoutPanel cannot expand to contain the control, because the panel's GrowStyle property is set to 'FixedSize'.
sr: TableLayoutPanel нельзя расширить, чтобы включить данный элемент, поскольку для свойства GrowStyle данной панели задано значение FixedSize.

# TableLayoutSettingSettingsIsNotSupported
source: Directly setting TableLayoutSettings is not supported. Use individual properties instead.
sr: Задание TableLayoutSettings напрямую не поддерживается. Вместо этого используйте отдельные свойства.

# TableLayoutSettingsGetCellPositionDescr
source: Indicates the row and column of the cell.
sr: Указывает строку и столбец данной ячейки.

# TableLayoutSettingsSetCellPositionDescr
source: Sets the row and column of the cell.
sr: Задает строку и столбец данной ячейки.

# TablePrintLayoutFromDifferentDocument
source: TablePrintLayout instance specified was constructed for a different document.
sr: Указанный экземпляр TablePrintLayout был создан для другого документа.

# TextBoxAcceptsReturnDescr
source: Indicates if return characters are accepted as input for multiline edit controls.
sr: Указывает, разрешен ли ввод символов возврата для многострочных полей редактирования.

# TextBoxAcceptsTabDescr
source: Indicates if tab characters are accepted as input for multiline edit controls.
sr: Указывает, разрешен ли ввод символов табуляции для многострочных полей редактирования.

# TextBoxAutoCompleteCustomSourceDescr
source: The StringCollection to use when the AutoCompleteSource property is set to CustomSource.
sr: Используемая StringCollection, когда свойство AutoCompleteSource равно CustomSource.

# TextBoxAutoCompleteModeDescr
source: Indicates the text completion behavior of the text box.
sr: Задает поведение при заполнении текстом в текстовом поле.

# TextBoxAutoCompleteSourceDescr
source: The autocomplete source, which can be one of the values from AutoCompleteSource enumeration.
sr: Источник для автозаполнения, может быть одним из значений в AutoCompleteSource.

# TextBoxAutoCompleteSourceNoItems
source: The value AutoCompleteSource.ListItems is not applicable to the TextBox control.
sr: Значение AutoCompleteSource.ListItems неприменимо к элементу TextBox.

# TextBoxAutoSizeDescr
source: Enables automatic resizing based on font size for single-line edit controls.
sr: Включает автоматическое изменение размеров однострочных полей редактирования в соответствии с размером шрифта.

# TextBoxBaseOnAcceptsTabChangedDescr
source: Occurs when the value of the AcceptsTab property changes.
sr: Возникает при изменении значения свойства AcceptsTab.

# TextBoxBaseOnAutoSizeChangedDescr
source: Event raised when the value of the AutoSize property is changed on TextBoxBase.
sr: Событие создается, когда для TextBoxBase изменяется значение свойства AutoSize.

# TextBoxBaseOnBorderStyleChangedDescr
source: Occurs when the value of the BorderStyle property changes.
sr: Возникает при изменении значения свойства BorderStyle .

# TextBoxBaseOnHideSelectionChangedDescr
source: Occurs when the value of the HideSelection property changes.
sr: Возникает при изменении значения свойства HideSelection.

# TextBoxBaseOnModifiedChangedDescr
source: Occurs when the value of the Modified property changes.
sr: Возникает при изменении значения свойства Modified.

# TextBoxBaseOnMultilineChangedDescr
source: Occurs when the value of the Multiline property changes.
sr: Возникает при изменении значения свойства Multiline.

# TextBoxBaseOnReadOnlyChangedDescr
source: Occurs when the value of the ReadOnly property changes.
sr: Возникает при изменении значения свойства ReadOnly.

# TextBoxBorderDescr
source: Indicates whether the edit control should have a border.
sr: Указывает, должны ли у текстового поля быть границы.

# TextBoxCanUndoDescr
source: Indicates if the edit control can undo the previous action.
sr: Указывает, возможна ли отмена предыдущего действия в поле редактирования.

# TextBoxCharacterCasingDescr
source: Indicates if all characters should be left alone or converted to uppercase or lowercase.
sr: Указывает, должны ли символы оставаться без изменения или преобразовываться в верхний/нижний регистр.

# TextBoxHideSelectionDescr
source: Indicates that the selection should be hidden when the edit control loses focus.
sr: Указывает, что при переключении фокуса из поля редактирования выделение должно быть скрыто.

# TextBoxLinesDescr
source: The lines of text in a multiline edit, as an array of String values.
sr: Строки текста в многострочном поле редактирования как массив строковых значений.

# TextBoxMaxLengthDescr
source: Specifies the maximum number of characters that can be entered into the edit control.
sr: Задает максимальное число символов, которые можно ввести в поле редактирования.

# TextBoxModifiedDescr
source: Indicates if the text in the edit control has been modified by the user.
sr: Указывает, был ли текст в поле редактирования изменен пользователем.

# TextBoxMultilineDescr
source: Controls whether the text of the edit control can span more than one line.
sr: Указывает, может ли текст в поле редактирования занимать несколько строк.

# TextBoxPasswordCharDescr
source: Indicates the character to display for password input for single-line edit controls.
sr: Указывает символ для отображения пароля при вводе в однострочном поле редактирования.

# TextBoxPlaceholderTextDescr
source: Specifies the PlaceholderText of the TextBox control. The PlaceholderText is displayed in the control when the Text property is null or empty and can be used to guide the user what input is expected by the control.
sr: Задает текст заполнителя PlaceholderText для элемента управления TextBox. Текст заполнителя PlaceholderText отображается в элементе управления, когда свойство Text имеет значение NULL или является пустым. Текст заполнителя PlaceholderText можно использовать для информирования пользователя о том, какие входные данные ожидаются элементом управления.

# TextBoxPreferredHeightDescr
source: The preferred height of this control.
sr: Предпочтительная высота данного элемента управления.

# TextBoxReadOnlyDescr
source: Controls whether the text in the edit control can be changed or not.
sr: Задает, может ли изменяться текст в поле редактирования.

# TextBoxScrollBarsDescr
source: Indicates, for multiline edit controls, which scroll bars will be shown for this control.
sr: Для многострочного поля редактирования задает полосу прокрутки, которая будет отображаться в данном поле редактирования.

# TextBoxSelectedTextDescr
source: The currently selected text.
sr: Текущий выбранный текст.

# TextBoxSelectionLengthDescr
source: The length of the currently selected text.
sr: Длина текущего выбранного текста.

# TextBoxSelectionStartDescr
source: The beginning of the currently selected text.
sr: Начало текущего выбранного текста.

# TextBoxShortcutsEnabledDescr
source: Indicates whether shortcuts defined for the control are enabled.
sr: Указывает, активны ли "горячие клавиши", определенные для данного элемента управления.

# TextBoxTextAlignDescr
source: Indicates how the text should be aligned for edit controls.
sr: Задает выравнивание текста в полях редактирования.

# TextBoxUseSystemPasswordCharDescr
source: Indicates if the text in the edit control should appear as the default password character.
sr: Указывает, должен ли текст в текстовом поле отображаться символами пароля по умолчанию.

# TextBoxWordWrapDescr
source: Indicates if lines are automatically word-wrapped for multiline edit controls.
sr: Указывает, выполняется ли автоматический перенос на новую строку в многострочных полях редактирования.

# TextParseFailedFormat
source: Parse of Text("{0}") expected text in the format "{1}" did not succeed.
sr: Разбор Text("{0}"), ожидавшегося как текст в формате "{1}", не удался.

# ThreadMustBeSTA
source: Current thread must be set to single thread apartment (STA) mode before OLE calls can be made. Ensure that your Main function has STAThreadAttribute marked on it.
sr: Текущий поток должен быть задан как поток однопоточного контейнера (STA), чтобы вызовы OLE стали возможны. Проверьте, что ваша функция Main помечена атрибутом STAThreadAttribute.

# ThreadNoLongerValid
source: An error occurred invoking the method. The destination thread no longer exists.
sr: При вызове данного метода произошла ошибка. Поток-получатель больше не существует.

# ThreadNotPumpingMessages
source: An error occurred invoking the method. A message loop is required to marshal the thread call.
sr: При вызове данного метода произошла ошибка. Цикл обработки сообщений требуется для упаковки вызова потока.

# TimerEnabledDescr
source: Enables generation of Elapsed events.
sr: Разрешает создавать события Elapsed.

# TimerIntervalDescr
source: The frequency of Elapsed events in milliseconds.
sr: Интервал межу событиями Elapsed в миллисекундах.

# TimerInvalidInterval
source: Value '{0}' is not a valid value for Interval. Interval must be greater than {1}.
sr: Значение '{0}' недопустимо для параметра Interval. Interval должен быть больше {1}.

# TimerTimerDescr
source: Occurs whenever the specified interval time elapses.
sr: Происходит по истечении заданного временного интервала.

# TooManyResumeUpdateMenuHandles
source: Too many calls to ResumeUpdateMenuHandles.
sr: Недопустимо большое число вызовов ResumeUpdateMenuHandles.

# ToolStripAllowItemReorderAndAllowDropCannotBeSetToTrue
source: AllowItemReorder and AllowDrop cannot both be true.
sr: AllowItemReorder и AllowDrop не могут одновременно иметь значение true.

# ToolStripAllowItemReorderDescr
source: Allows the items to be reordered when the ALT key is pressed.
sr: Позволяет упорядочение элементов при нажатии клавиши ALT.

# ToolStripAllowMergeDescr
source: Allow the items to be merged.
sr: Допускает слияние элементов.

# ToolStripBackColorDescr
source: Specifies the background color of the ToolStrip.
sr: Задает цвет фона для ToolStrip.

# ToolStripButtonCheckOnClickDescr
source: Indicates whether the item should toggle its selected state when clicked.
sr: Показывает, должен ли элемент менять свое состояние выбора при щелчке мыши.

# ToolStripButtonCheckedDescr
source: Indicates whether the ToolStripButton is pressed in or not pressed in.
sr: Показывает, нажата или не нажата ToolStripButton.

# ToolStripCanOnlyPositionItsOwnItems
source: ToolStrip cannot position another ToolStrip's items.
sr: ToolStrip не может определить положение других элементов ToolStrip.

# ToolStripCanOverflowDescr
source: Indicates whether items can be sent to an overflow menu.
sr: Указывает, можно ли посылать элементы в меню переполнения.

# ToolStripCollectionMustInsertAndRemove
source: You must explicitly insert one item and remove the other.
sr: Нужно явно вставить один элемент и удалить другой.

# ToolStripContainerBottomToolStripPanelDescr
source: The bottom panel of the ToolStripContainer. This area is used for moving ToolStrips, MenuStrips and StatusStrips.
sr: Нижняя панель ToolStripContainer. Эта область используется для перемещения ToolStrips, MenuStrips и StatusStrips.

# ToolStripContainerBottomToolStripPanelVisibleDescr
source: Specifies the visibility of the bottom panel of the ToolStripContainer.
sr: Указывает, будет ли видна нижняя панель ToolStripContainer.

# ToolStripContainerContentPanelDescr
source: The center panel of the ToolStripContainer.
sr: Центральная панель ToolStripContainer.

# ToolStripContainerDesc
source: Provides panels on each side of the form that can contain one or more ToolStrip, MenuStrip, or StatusStrip controls.
sr: Создает по обеим сторонам формы панели, которые могут содержать один и больше элементов ToolStrip, MenuStrip или StatusStrip.

# ToolStripContainerLeftToolStripPanelDescr
source: The left panel of the ToolStripContainer. This area is used for moving ToolStrips, MenuStrips and StatusStrips.
sr: Левая панель ToolStripContainer. Эта область используется для перемещения ToolStrips, MenuStrips и StatusStrips.
