Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# ToolStripContainerLeftToolStripPanelVisibleDescr
source: Specifies the visibility of the left panel of the ToolStripContainer.
sr: Указывает, будет ли видна левая панель ToolStripContainer.

# ToolStripContainerRightToolStripPanelDescr
source: The right panel of the ToolStripContainer. This area is used for moving ToolStrips, MenuStrips and StatusStrips.
sr: Правая панель ToolStripContainer. Эта область используется для перемещения ToolStrips, MenuStrips и StatusStrips.

# ToolStripContainerRightToolStripPanelVisibleDescr
source: Specifies the visibility of the right panel of the ToolStripContainer.
sr: Указывает, будет ли видна правая панель ToolStripContainer.

# ToolStripContainerTopToolStripPanelDescr
source: The top panel of the ToolStripContainer. This area is used for moving ToolStrips, MenuStrips and StatusStrips.
sr: Верхняя панель ToolStripContainer. Эта область используется для перемещения ToolStrips, MenuStrips и StatusStrips.

# ToolStripContainerTopToolStripPanelVisibleDescr
source: Specifies the visibility of the top panel of the ToolStripContainer.
sr: Указывает, будет ли видна верхняя панель ToolStripContainer.

# ToolStripContainerUseContentPanel
source: Adding controls directly to the ToolStripContainer is not supported. Use the 'ContentPanel.Controls' property instead.
sr: Явное добавление элементов управления к ToolStripContainer не поддерживается. Используйте вместо этого свойство 'ContentPanel.Controls'.

# ToolStripContentPanelOnLoadDescr
source: Occurs whenever the content panel loads.
sr: Происходит при загрузке содержимого панели.

# ToolStripDefaultDropDownDirectionDescr
source: Specifies the default direction for DropDowns to open.
sr: Задает направление открытия элементов DropDown по умолчанию.

# ToolStripDoesntSupportAutoScroll
source: ToolStrip doesn't support the AutoScroll property.
sr: ToolStrip не поддерживает свойство AutoScroll.

# ToolStripDropDownAutoCloseDescr
source: Specifies whether the DropDown automatically closes through user action.
sr: Указывает, будет ли DropDown автоматически закрываться при действиях пользователя.

# ToolStripDropDownButtonShowDropDownArrowDescr
source: Specifies whether or not an arrow should be shown on the drop down button.
sr: Указывает, будет ли на кнопке открытия выпадающего списка отображаться стрелка.

# ToolStripDropDownClosedDecr
source: Occurs when the DropDown has closed.
sr: Происходит при закрытии DropDown.

# ToolStripDropDownClosingDecr
source: Occurs when the DropDown is about to close.
sr: Происходит, когда DropDown должен закрыться.

# ToolStripDropDownDescr
source: Specifies a ToolStripDropDown to show when the item is clicked.
sr: Указывается, будет ли отображаться ToolStripDropDown при щелчке данного элемента.

# ToolStripDropDownItemDropDownDirectionDescr
source: Specifies the direction in which to drop the drop down.
sr: Задает направление, в котором раскрывается список.

# ToolStripDropDownItemsDescr
source: Specifies a ToolStripItem to display when the item is clicked.
sr: Указывается, будет ли отображаться ToolStripItem при щелчке данного элемента.

# ToolStripDropDownMenuShowCheckMarginDescr
source: Specifies whether the check margin will be shown.
sr: Указывает, будут ли отображаться поля флажка.

# ToolStripDropDownMenuShowImageMarginDescr
source: Specifies whether the image margin will be shown.
sr: Указывает, будут ли отображаться поля изображения.

# ToolStripDropDownOpenedDescr
source: Occurs when the DropDown has opened.
sr: Возникает, когда DropDown открыт.

# ToolStripDropDownOpeningDescr
source: Occurs when the DropDown is opening.
sr: Возникает при открытии DropDown.

# ToolStripDropDownPreferredWidthDescr
source: Specifies the PreferredWidth of the ToolStripDropDown when it is shown.
sr: Задает PreferredWidth элемента ToolStripDropDown при его отображении.

# ToolStripDropDownsCantBeRafted
source: ToolStripDropDown does not support rafting.
sr: ToolStripDropDown не поддерживает rafting.

# ToolStripGripAccessibleName
source: Grip
sr: Захват

# ToolStripGripDisplayStyleDescr
source: Specifies the orientation of the grip on the ToolStrip.
sr: Задает ориентацию захвата на ToolStrip.

# ToolStripGripMargin
source: Specifies the external spacing between the grip and the padding of the ToolStrip and the displayed item.
sr: Задает внешнее расстояние между захватом и полем ToolStrip и отображаемым элементом.

# ToolStripGripStyleDescr
source: Specifies visibility of the grip on the ToolStrip.
sr: Задает видимость ползунка на ToolStrip.

# ToolStripImageListDescr
source: Specifies the ImageList on the ToolStrip.
sr: Задает ImageList для ToolStrip.

# ToolStripImageScalingSizeDescr
source: Specifies the size of images on items. To control the scaling of items, use the 'ToolStripItem.ImageScaling' property.
sr: Задает размер изображений на элементах. Для управления масштабом элементов служит свойство 'ToolStripItem.ImageScaling'.

# ToolStripItemAccessibilityObjectDescr
source: The AccessibleObject assigned to the control.
sr: AccessibleObject, назначенный данному элементу.

# ToolStripItemAccessibleDefaultActionDescr
source: The default action description of the item.
sr: Описание действия данного элемента по умолчанию.

# ToolStripItemAccessibleDescriptionDescr
source: The description that will be reported to accessibility clients.
sr: Описание, текст которого будет передаваться клиентам специальных возможностей.

# ToolStripItemAccessibleNameDescr
source: The name that will be reported to accessibility clients.
sr: Имя, которое будет сообщаться клиентам специальных возможностей.

# ToolStripItemAccessibleRoleDescr
source: The role that will be reported to accessibility clients.
sr: Роль, которая будет сообщаться клиентам специальных возможностей.

# ToolStripItemAddedDescr
source: Occurs when a ToolStripItem has been added to the ToolStrip's item collection.
sr: Происходит при добавлении ToolStripItem к коллекции элементов ToolStrip.

# ToolStripItemAlignment
source: The alignment of the item with respect to it's owner ToolStrip.
sr: Выравнивание элемента по отношению к владеющему им ToolStrip.

# ToolStripItemAlignmentDescr
source: Indicates whether the item aligns toward the beginning or end of the ToolStrip.
sr: Указывает, будет ли элемент выравниваться по отношению к началу или концу ToolStrip.

# ToolStripItemAllowDropDescr
source: Determines if the item will receive drag-drop notifications.
sr: Определяет получение элементом уведомлений о перетаскивании мышью.

# ToolStripItemAutoSizeDescr
source: Determines whether the item should automatically size based on its image and text.
sr: Определяет, должен ли элемент автоматически изменять размеры в зависимости от размеров его изображения или текста.

# ToolStripItemAutoToolTipDescr
source: Specifies whether to use the Text or ToolTipText property to display on the ToolTip.
sr: Определяет, значение какого свойства, Text или ToolTipText, будет отображаться на подсказке.

# ToolStripItemAvailableDescr
source: Specifies whether or not an item should be placed on a ToolStrip.
sr: Определяет, будет ли элемент помещаться на подсказке или нет.

# ToolStripItemBackColorDescr
source: The background color used to display text and graphics in the control.
sr: Фоновый цвет для отображения текста и графики в данном элементе управления.

# ToolStripItemCircularReference
source: Cannot add owner item to the drop-down items collection.
sr: Нельзя добавлять элемент-владелец к коллекции элементов выпадающего списка.

# ToolStripItemCollectionIsReadOnly
source: Collection of ToolStripItems is read-only.
sr: Коллекция ToolStripItems предназначена только для чтения.

# ToolStripItemDisplayStyleDescr
source: Specifies whether the image and text are rendered.
sr: Определяет, будут ли отрисовываться изображение и текст.

# ToolStripItemDoubleClickedEnabledDescr
source: Specifies whether the DoubleClick event will occur.
sr: Определяет, будет ли генерироваться событие DoubleClick.

# ToolStripItemDrawModeDescr
source: Specifies the drawing mode of the ToolStrip item.
sr: Определяем режим рисования элемента ToolStrip.

# ToolStripItemEnabledChangedDescr
source: Occurs when the enabled state of the item has changed.
sr: Происходит при изменении допустимого размера данного элемента.

# ToolStripItemEnabledDescr
source: Indicates whether the control is enabled.
sr: Указывает, включен ли элемент управления.

# ToolStripItemFontDescr
source: The font used to display text in the item.
sr: Шрифт для отображения текста данного элемента.

# ToolStripItemForeColorDescr
source: The foreground color used to display text and graphics in the item.
sr: Цвет переднего плана для отображения текста и рисунка данного элемента.

# ToolStripItemImageAlignDescr
source: The alignment of the image that will be displayed on the item.
sr: Выравнивание рисунка, отображаемого на данном элементе.

# ToolStripItemImageDescr
source: The image that will be displayed on the item.
sr: Рисунок, отображаемый на данном элементе.

# ToolStripItemImageIndexDescr
source: The index of the image in the ImageList to display on the item.
sr: Индекс рисунка, отображаемого на данном элементе, в ImageList.

# ToolStripItemImageKeyDescr
source: The key representing the image in the ImageList to display on the item.
sr: Ключ, представляющий рисунок, отображаемый на данном элементе, в ImageList.

# ToolStripItemImageList
source: The ImageList to get the image to display on the item.
sr: ImageList, содержащий рисунок для отображения на данном элементе.

# ToolStripItemImageScalingDescr
source: Specifies whether the image on the item will size to fit on the ToolStrip. To control the image size, use the 'ToolStrip.ImageScalingSize' property.
sr: Определяет, будет ли рисунок данного элемента масштабироваться под размер ToolStrip. Для управления масштабом рисунка служит свойство 'ToolStrip.ImageScalingSize'.

# ToolStripItemImageTransparentColorDescr
source: Specifies the transparent color on the item's image for images that support transparency.
sr: Определяет прозрачный цвет изображения данного элемента для изображений, поддерживающих прозрачность.

# ToolStripItemMarginDescr
source: Specifies the spacing between this item and an adjacent item.
sr: Задает интервал между данным элементом и соседним.

# ToolStripItemOnAvailableChangedDescr
source: Occurs when the value of the Available property changes.
sr: Возникает при изменении значения свойства Available.

# ToolStripItemOnBackColorChangedDescr
source: Occurs when the value of the BackColor property is changed on the item.
sr: Возникает при изменении значения свойства BackColor для данного элемента.

# ToolStripItemOnClickDescr
source: Occurs when the item is clicked.
sr: Возникает при щелчке данного элемента.

# ToolStripItemOnDragDropDescr
source: Occurs when the mouse drags an item and the user releases the mouse indicating that the item should be 'dropped' into this item.
sr: Возникает, когда элемент зацепляют мышью, а потом отпускают, показывая, что элемент должен быть "опущен" на этот элемент.

# ToolStripItemOnDragEnterDescr
source: Occurs when the mouse drags an item into the client area for this item.
sr: Возникает при перетаскивании элемента в клиентскую область данного элемента.

# ToolStripItemOnDragLeaveDescr
source: Occurs when the mouse drags an item and is no longer over the client area for this item.
sr: Возникает при перетаскивании элемента за пределы клиентской области данного элемента.

# ToolStripItemOnDragOverDescr
source: Occurs when the mouse drags an item over the client area for this item.
sr: Возникает при перетаскивании элемента в клиентскую область данного элемента.

# ToolStripItemOnForeColorChangedDescr
source: Occurs when the value of the BackColor property is changed on the item.
sr: Возникает при изменении значения свойства BackColor для данного элемента.

# ToolStripItemOnGiveFeedbackDescr
source: Occurs when the mouse drags an item. The system requests that the Item provide feedback to that effect.
sr: Возникает при перетаскивании элемента. Система требует, чтобы элемент сигнализировал об этом.

# ToolStripItemOnGotFocusDescr
source: Occurs when the control gets focus.
sr: Происходит при переключении фокуса на данный элемент управления.

# ToolStripItemOnLocationChangedDescr
source: Occurs when the location of a ToolStripItem is updated.
sr: Возникает при изменении положения ToolStripItem.

# ToolStripItemOnLostFocusDescr
source: Occurs when the control loses focus.
sr: Возникает при потере фокуса элементом управления.

# ToolStripItemOnMouseDownDescr
source: Occurs when a mouse button is pressed.
sr: Возникает в момент нажатия кнопки мыши.

# ToolStripItemOnMouseEnterDescr
source: Occurs when the mouse enters the visible part of the item.
sr: Возникает, когда курсор мыши наводится над видимой частью элемента.

# ToolStripItemOnMouseHoverDescr
source: Occurs when the mouse remains stationary inside of the item for an amount of time.
sr: Возникает, когда мышь остается неподвижной внутри данного элемента в течение определенного времени.

# ToolStripItemOnMouseLeaveDescr
source: Occurs when the mouse leaves the visible part of the item.
sr: Происходит, когда курсор мыши выходит из видимой части элемента.

# ToolStripItemOnMouseMoveDescr
source: Occurs when the mouse is moved.
sr: Возникает при перемещении указателя мыши.

# ToolStripItemOnMouseUpDescr
source: Occurs when a mouse button is released.
sr: Возникает в момент отпускания кнопки мыши.

# ToolStripItemOnPaintDescr
source: Occurs when an item needs repainting.
sr: Происходит, когда для элемента требуется перерисовка.

# ToolStripItemOnQueryAccessibilityHelpDescr
source: Occurs when an Accessibility client invokes help for the item.
sr: Происходит, когда клиент Accessibility вызывает справку для данного элемента.

# ToolStripItemOnQueryContinueDragDescr
source: Occurs when the mouse drags an item. The system requests whether the drag-and-drop operation should be allowed to continue.
sr: Происходит при перетаскивании элемента. Система запрашивает, можно ли продолжать операцию перетаскивания мышью.

# ToolStripItemOnRightToLeftChangedDescr
source: Event raised when the value of the RightToLeft property is changed on this item.
sr: Событие, генерируемое при изменении свойства RightToLeft для данного элемента.

# ToolStripItemOnTextChangedDescr
source: Occurs when the Text property is changed on the item.
sr: Происходит при изменении свойства Text данного элемента.

# ToolStripItemOnVisibleChangedDescr
source: Occurs when the visibility of an item has changed.
sr: Происходит при изменении видимости элемента.

# ToolStripItemOverflow
source: Specifies whether an item will always be sent to the overflow, never be sent to the overflow, or sent to the overflow as needed.
sr: Определяет, будет ли элемент всегда посылаться на переполнение, никогда на посылаться на переполнение или посылаться на переполнение по мере необходимости.

# ToolStripItemOverflowDescr
source: Specifies whether the item will always move to the overflow, move to the overflow as needed, or never move to the overflow.
sr: Определяет, будет ли элемент всегда перемещаться на переполнение, перемещаться на переполнение по мере необходимости или никогда на перемещаться на переполнение.

# ToolStripItemOwnerChangedDescr
source: Occurs when the value of the Owner property changes.
sr: Происходит при изменении значения свойства Owner.

# ToolStripItemPaddingDescr
source: Specifies the internal spacing within this item.
sr: Определяет внутренние интервалы в данном элементе.

# ToolStripItemRemovedDescr
source: Occurs when a ToolStripItem has been removed from the ToolStrip's item collection.
sr: Происходит при удалении ToolStripItem из коллекции элементов ToolStrip.

# ToolStripItemRightToLeftAutoMirrorImageDescr
source: Specifies whether the image should mirror when the RightToLeft property equals RightToLeft.Yes.
sr: Определяет, должно ли изображение зеркально отражаться, если свойство RightToLeft равно RightToLeft.Yes.

# ToolStripItemRightToLeftDescr
source: Indicates whether the item should draw right-to-left for RTL languages.
sr: Определяет, будет ли элемент отображаться справа налево для RTL-языков (с направлением письма справа налево).

# ToolStripItemSize
source: The size of the item.
sr: Размер элемента.

# ToolStripItemSizeDescr
source: The size of the item in pixels.
sr: Размер элемента в пикселях.

# ToolStripItemTagDescr
source: User-defined data associated with the item.
sr: Пользовательские данные, связанные с данным элементом.

# ToolStripItemTextAlignDescr
source: The alignment of the text that will be displayed on the item.
sr: Выравнивание текста, отображаемого на данном элементе.

# ToolStripItemTextDescr
source: The text to display on the item.
sr: Текст, отображаемый на элементе.

# ToolStripItemTextImageRelationDescr
source: Specifies the relative location of the image to the text on the item.
sr: Определяет положение изображения относительно текста на элементе.

# ToolStripItemToolTipTextDescr
source: Specifies the text to show on the ToolTip.
sr: Определяет текст, отображаемый на подсказке.

# ToolStripItemVisibleDescr
source: Determines whether the item is visible or hidden.
sr: Определяет, будет элемент видимым или скрытым.

# ToolStripItemsDescr
source: Collection of items to display on the ToolStrip.
sr: Коллекция элементов для отображения на ToolStrip.

# ToolStripLabelActiveLinkColorDescr
source: Specifies the color of the link when the link is active.
sr: Определяет цвет ссылки, когда она активна.

# ToolStripLabelIsLinkDescr
source: Specifies whether the label acts as a link.
sr: Определяет, будет ли данная метка работать, как ссылка.

# ToolStripLabelLinkBehaviorDescr
source: The underlining behavior of the link.
sr: Режим подчеркивания ссылки.

# ToolStripLabelLinkColorDescr
source: Specifies the color of the link.
sr: Определяет цвет ссылки.

# ToolStripLabelLinkVisitedDescr
source: Determines if the hyperlink should be rendered as visited.
sr: Определяет, должна ли данная гиперссылка отображаться как посещенная.

# ToolStripLabelVisitedLinkColorDescr
source: Specifies the color of the link when the link has been visited.
sr: Определяет цвет ссылки после того, как она была открыта.

# ToolStripLayoutCompleteDescr
source: Occurs after layout and placement of items on the ToolStrip.
sr: Происходит после выравнивания и размещения элементов на ToolStrip.

# ToolStripLayoutStyle
source: Specifies the layout orientation of the ToolStrip.
sr: Задает ориентацию макета для ToolStrip.

# ToolStripLayoutStyleChangedDescr
source: Occurs when the layout style of the ToolStrip has changed.
sr: Происходит при изменении стиля макета ToolStrip.

# ToolStripMenuItemShortcutKeyDisplayStringDescr
source: The string to be displayed as the shortcut key.
sr: Строка, отображаемая, как "горячая" клавиша.

# ToolStripMergeActionDescr
source: Specifies what action to take if match is successful.
sr: Определяет действие в случае совпадения.

# ToolStripMergeImpossibleIdentical
source: Operation impossible. Source and target are identical.
sr: Операция невыполнима. Источник и цель должны быть одинаковыми.

# ToolStripMergeIndexDescr
source: Used for matching and positioning within target ToolStrip.
sr: Используется для поиска совпадений и размещения в целевой ToolStrip.

# ToolStripMustSupplyItsOwnComboBox
source: Call the empty ToolStripComboBox constructor, which will provide a ComboBox.
sr: Вызывает пустой конструктор ToolStripComboBox, который создаст объект ComboBox.

# ToolStripMustSupplyItsOwnTextBox
source: Call the empty ToolStripTextBox constructor, which will provide a TextBox.
sr: Вызывает пустой конструктор ToolStripTextBox, который создаст объект TextBox.

# ToolStripOnBeginDrag
source: Occurs when the ToolStrip has started to move within a ToolStripPanel.
sr: Возникает, когда ToolStrip начал перемещение внутри ToolStripPanel.

# ToolStripOnEndDrag
source: Occurs when the ToolStrip has stopped moving within a ToolStripPanel.
sr: Возникает, когда ToolStrip закончил перемещение внутри ToolStripPanel.

# ToolStripOptions
source: ToolBar Options
sr: Параметры ToolBar

# ToolStripPaintGripDescr
source: Occurs when the move handle needs repainting.
sr: Возникает, когда обработка перемещения требует перерисовки.

# ToolStripPanelRowControlCollectionIncorrectIndexLength
source: Offset and length were out of bounds for the array or count is greater than the number of elements from index to the end of the source collection.
sr: Смещение и длина вышли за границы массива или значение счетчика превышает количество элементов от указателя до конца исходной коллекции.

# ToolStripPanelRowsDescr
source: A collection of rows in the panel.
sr: Коллекция строк в панели.

# ToolStripRenderModeDescr
source: The painting styles applied to the control.
sr: Стили рисования, примененные к данному элементу управления.

# ToolStripRenderModeUseRendererPropertyInstead
source: The RenderMode property cannot directly be set to 'Custom', to use a custom ToolStripRenderer, set the Renderer property instead.
sr: Свойство RenderMode нельзя явно задать равным 'Custom', для использования пользовательского ToolStripRenderer нужно вместо этого задать свойство Renderer.

# ToolStripRendererChanged
source: Occurs when the value of the Renderer property changes.
sr: Возникает при изменении значения свойства Renderer.

# ToolStripSaveSettingsDescr
source: Specifies whether the ToolStrip should persist user settings via IPersistComponentSettings.
sr: Определяет, должен ли элемент ToolStrip сохранять пользовательские настройки при помощи IPersistComponentSettings.

# ToolStripSettingsKeyDescr
source: Specifies the settings key to use to save settings.
sr: Определяет клавишу настройки для сохранения параметров.

# ToolStripShowDropDownInvalidOperation
source: DropDown is the same as the Parent ToolStrip. Cannot Drop Down.
sr: Элемент DropDown такой же, как Parent ToolStrip. Нельзя выполнить Drop Down.

# ToolStripShowItemToolTipsDescr
source: Specifies whether to display ToolTips on items.
sr: Определяет, отображать ли ToolTips для элементов.

# ToolStripSplitButtonDropDownButtonWidthDescr
source: Specifies how much space to give to the DropDownButton portion of the ToolStripSplitButton.
sr: Определяет, сколько места отвести для части DropDownButton элемента ToolStripSplitButton.

# ToolStripSplitButtonOnButtonClickDescr
source: Occurs when the button portion of the split button has been clicked.
sr: Возникает, когда кнопку элемента кнопки разделения щелкают мышью.

# ToolStripSplitButtonOnButtonDoubleClickDescr
source: Occurs when the button portion of the split button has been double clicked.
sr: Возникает, когда кнопку элемента кнопки разделения дважды щелкают мышью.

# ToolStripSplitButtonOnDefaultItemChangedDescr
source: Occurs when the DefaultItem property has changed.
sr: Возникает при изменении свойства DefaultItem.

# ToolStripSplitButtonSplitterWidthDescr
source: Specifies the width of the split section between the default and drop-down button.
sr: Определяет ширину зоны разделения между стандартной кнопкой и кнопкой выпадающего списка.

# ToolStripSplitStackLayoutContainerMustBeAToolStrip
source: Container must be a ToolStrip.
sr: Контейнер должен быть объектом ToolStrip.

# ToolStripStatusLabelBorderSidesDescr
source: Specifies the sides of the panel that should display borders.
sr: Задает стороны панели, на которых должны отображаться границы.

# ToolStripStatusLabelBorderStyleDescr
source: Specifies the border style for the panel.
sr: Определяет стиль границ панели.

# ToolStripStatusLabelSpringDescr
source: Specifies whether the item fills up the remaining space.
sr: Определяет, будет ли элемент заполнять оставшееся место.
