Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# ListViewTileViewDoesNotSupportCheckBoxes
source: Tile view does not support CheckBoxes. Choose a different view or set CheckBoxes to false.
sr: Представление Tile не поддерживает CheckBoxes. Выберите другое представление либо установите для CheckBoxes значение false.

# ListViewTopItemDescr
source: The first item that is visible to the user.
sr: Первый элемент, видимый пользователю.

# ListViewViewDescr
source: Selects one of five different views that items can be shown in.
sr: Выбирает одно из пяти различных представлений, в которых могут отображаться элементы.

# ListViewVirtualItemRequired
source: ListView virtualization requires a valid ListViewItem to be provided by the RetrieveVirtualItem event or in the OnRetrieveVirtualItem method.
sr: Для виртуализации ListView требуется допустимое значение ListViewItem, предоставленное событием RetrieveVirtualItem или методом OnRetrieveVirtualItem.

# ListViewVirtualItemStateChangedDescr
source: Occurs whenever the state of a virtual item is changed.
sr: Происходит при каждом изменении состояния виртуального элемента.

# ListViewVirtualItemsSelectionRangeChangedDescr
source: Event raised when the selection state of a range of items has changed. This event in raised only in virtual mode.
sr: Событие создается после изменения состояния выделения диапазона элементов. Данное событие создается только в виртуальном режиме.

# ListViewVirtualListSizeDescr
source: Sets the count of the item collection when the ListView is in virtual mode.
sr: Устанавливает счетчик коллекции элементов, когда ListView находится в виртуальном режиме.

# ListViewVirtualListSizeInvalidArgument
source: Value of '{1}' is not valid for '{0}'. {0} should be greater than or equal to 0.
sr: Значение '{1}' недопустимо для '{0}'. {0} должно быть больше или равно 0.

# ListViewVirtualListViewRequiresNoCheckedItems
source: Cannot set VirtualMode=true on a list whose checked items collection is not empty.
sr: Не удается задать VirtualMode=true для списка, в коллекции отмеченных элементов которого присутствуют элементы.

# ListViewVirtualListViewRequiresNoItems
source: Cannot set VirtualMode=true on a ListView that has items.
sr: Не удается задать VirtualMode=true для ListView, в котором есть элементы.

# ListViewVirtualListViewRequiresNoSelectedItems
source: Cannot set VirtualMode=true on a ListView whose selected items collection is not empty.
sr: Не удается задать VirtualMode=true для ListView, в коллекции отмеченных элементов которого присутствуют элементы.

# ListViewVirtualModeCantAccessSubItem
source: When in VirtualMode the ListView RetrieveVirtualListItem event needs a list view SubItem for each ListView column.
sr: В режиме VirtualMode событие RetrieveVirtualListItem для ListView требует наличия подэлемента представления списка для каждого столбца ListView.

# ListViewVirtualModeDescr
source: Enables ListView virtual mode.
sr: Активирует виртуальный режим ListView.

# LiveRegionAutomationLiveSettingDescr
source: The politeness level that a client should use to notify the user of changes to this live region.
sr: Уровень "вежливости", который клиент должен использовать для уведомления пользователя об изменениях в этой динамической области.

# LoadDLLError
source: Cannot load the "{0}" DLL into memory.
sr: Загрузка "{0}" DLL в память невозможна.

# LoadTextError
source: Cannot load the text.
sr: Не удается загрузить текст.

# MDIChildAddToNonMDIParent
source: MDI child forms can be added only to an MdiClient.
sr: Формы-потомки MDI можно добавлять только к MdiClient.

# MDIChildSystemMenuItemAccessibleName
source: System
sr: Система

# MDIContainerMustBeTopLevel
source: MDI container forms must be top-level.
sr: Формы контейнера MDI должны принадлежать верхнему уровню.

# MDIMenuMoreWindows
source: &More Windows...
sr: Остал&ьные окна...

# MDIParentNotContainer
source: Form that was specified to be the MdiParent for this form is not an MdiContainer.
sr: Форма, указанная как MdiParent для данной формы, не является MdiContainer.

# MaskedTextBoxAllowPromptAsInputDescr
source: Indicates whether the prompt character is valid as input.
sr: Указывает, является ли символ, введенный в окне приглашения, допустимым.

# MaskedTextBoxAsciiOnlyDescr
source: Indicates whether only ASCII characters are accepted as valid input.
sr: Указывает, являются ли допустимыми только символы ASCII.

# MaskedTextBoxBeepOnErrorDescr
source: Indicates whether the control will beep when an invalid character is typed.
sr: Указывает, оповещает ли элемент управления пользователя о вводе недопустимого символа.

# MaskedTextBoxCultureDescr
source: The culture that determines the value of the localizable mask language separators and placeholders.
sr: Культура, определяющая значение разделителей и местозаполнителей языка локализуемой маски.

# MaskedTextBoxCutCopyMaskFormat
source: Indicates whether the text to be copied to the clipboard includes literals and/or prompt characters.
sr: Указывает, содержит ли текст, который будет скопирован в буфер обмена, буквенные символы и/или символы приглашения.

# MaskedTextBoxHidePromptOnLeaveDescr
source: Indicates whether prompt characters are displayed when the control does not have focus.
sr: Указывает, отображаются ли символы подсказки, когда фокус не переключен на элемент управления.

# MaskedTextBoxIncompleteMsg
source: Mask input is not complete.
sr: Неполный ввод маски.

# MaskedTextBoxInsertKeyModeDescr
source: Indicates the masked text box input character typing mode.
sr: Указывает режим ввода символа в поле маскируемого текста.

# MaskedTextBoxInvalidCharError
source: Specified character value is not allowed for this property.
sr: Указанное значение символа недопустимо для данного свойства.

# MaskedTextBoxIsOverwriteModeChangedDescr
source: Occurs when the value of IsOverwriteMode property changes.
sr: Происходит при изменении значения свойства IsOverwriteMode.

# MaskedTextBoxMaskChangedDescr
source: Occurs when the value of Mask property changes.
sr: Происходит при изменении значения свойства Mask.

# MaskedTextBoxMaskDescr
source: Sets the string governing the input allowed for this control.
sr: Задает строку, управляющую вводом для данного элемента управления.

# MaskedTextBoxMaskInputRejectedDescr
source: Occurs when the input character or text does not comply with the mask specification.
sr: Происходит, если введенный символ или текст не соответствуют заданным параметрам маски.

# MaskedTextBoxMaskInvalidChar
source: Specified mask contains characters that are not valid.
sr: Указанная маска содержит недопустимые символы.

# MaskedTextBoxPasswordAndPromptCharError
source: PasswordChar and PromptChar values cannot be the same.
sr: Значения PasswordChar и PromptChar не могут быть одинаковыми.

# MaskedTextBoxPasswordCharDescr
source: Indicates the character to display for password input.
sr: Указывает символ, отображаемый при вводе пароля.

# MaskedTextBoxPromptCharDescr
source: Indicates the character used as the placeholder.
sr: Указывает символ, использующийся как местозаполнитель.

# MaskedTextBoxRejectInputOnFirstFailureDescr
source: If true, the input text is rejected whenever a character fails to comply with the mask; otherwise, characters in the text are processed one by one as individual inputs.
sr: Если имеет значение true, то вводимый текст не принимается, если хоть один символ не соответствует маске; в противном случае символы текста обрабатываются по очереди как введенные по отдельности.

# MaskedTextBoxResetOnPrompt
source: Specifies whether to reset and skip the current position if editable, when the input character has the same value as the prompt.
sr: Указывает, сбрасывать ли и пропускать текущую позицию, допускающую редактирование, когда введенный символ совпадает с образцом.

# MaskedTextBoxResetOnSpace
source: Specifies whether to reset and skip the current position if editable, when the input is the space character.
sr: Указывает, сбрасывать ли и пропускать текущую позицию, допускающую редактирование, когда вводится пробел.

# MaskedTextBoxSkipLiterals
source: Specifies whether to skip the current position if non-editable and the input character has the same value as the literal at that position.
sr: Указывает, пропускать ли текущую позицию, не допускающую редактирование, когда введенный символ совпадает с символом в этой позиции.

# MaskedTextBoxTextMaskFormat
source: Indicates whether the string returned from the Text property includes literals and/or prompt characters.
sr: Указывает, содержит ли строка из свойства Text символы и/или символы приглашения.

# MaskedTextBoxTypeValidationCompletedDescr
source: Occurs when the ValidatingType object has completed parsing the input text.
sr: Происходит, когда объект ValidatingType завершил разбор входного текста.

# MaskedTextBoxTypeValidationSucceeded
source: Type validation succeeded.
sr: Тип подтвержден.

# MaskedTextBoxUseSystemPasswordCharDescr
source: Indicates if the text in the edit control should appear as the default password character.
sr: Указывает, должен ли текст в текстовом поле отображаться символами пароля по умолчанию.

# MaskedTextBoxValidatedValueChangedDescr
source: Occurs when the ValidatedValue changes after type validation has been completed.
sr: Происходит, когда после подтверждения типа изменяется значение ValidatedValue.

# MaskedTextBoxValidatingTypeDescr
source: Specifies the Type of the object to be used for parsing the input text when the control looses focus.
sr: Указывает Type для объекта, который будет использоваться для разбора вводимого текста при потере фокуса элементом управления.

# MenuStripMdiWindowListItem
source: Specifies the item whose DropDown will show the list of MDI windows.
sr: Указывает пункт, чья функция DropDown будет отображать список окон MDI.

# MenuStripMenuActivateDescr
source: Occurs when the user has started accessing the menu through the keyboard or mouse.
sr: Происходит, когда пользователь начинает открывать данное меню с помощью клавиатуры или мыши.

# MenuStripMenuDeactivateDescr
source: Occurs when the user has finished accessing the menu through the keyboard or mouse.
sr: Происходит, когда пользователь прекращает работать с данным меню с помощью клавиатуры или мыши.

# MonthCalendarAnnuallyBoldedDatesDescr
source: Indicates which annual dates should be boldface.
sr: Показывает, будут ли даты отображаться жирным шрифтом.

# MonthCalendarDimensionsDescr
source: The number of rows and columns of months in a month calendar.
sr: Число строк и столбцов для месяца в месячном календаре.

# MonthCalendarFirstDayOfWeekDescr
source: The first day of the week.
sr: Первый день недели.

# MonthCalendarForeColorDescr
source: The color used to display text within a month.
sr: Цвет для отображения текста в области месяца.

# MonthCalendarInvalidDimensions
source: Calendar dimensions ({0}, {1}) are not valid.
sr: Размеры календаря ({0}, {1}) недопустимы.

# MonthCalendarMaxDateDescr
source: The maximum date that can be selected for a month calendar control.
sr: Максимальное значение даты, которое можно выбрать для элемента управления 'календарь на месяц'.

# MonthCalendarMaxSelCount
source: Unable to set the MonthCalendar maximum selection count to {0}.
sr: Невозможно установить максимальное значение счетчика MonthCalendar равным {0}.

# MonthCalendarMaxSelectionCountDescr
source: The total number of days that can be selected for the control.
sr: Общее число дней, которое можно выбрать в данном элементе управления.

# MonthCalendarMinDateDescr
source: The minimum date that can be selected for a month calendar control.
sr: Минимальное значение даты, которое можно выбрать для элемента управления 'календарь на месяц'.

# MonthCalendarMonthBackColorDescr
source: The background color displayed within the month.
sr: Фоновый цвет, отображаемый в области месяца.

# MonthCalendarMonthlyBoldedDatesDescr
source: Indicates which monthly dates to bold.
sr: Указывает, какие числа месяца выделять жирным шрифтом.

# MonthCalendarOnDateChangedDescr
source: Occurs when the range of dates changes due to user selection, or through next/previous month navigation.
sr: Происходит при изменении пользователем выбранного диапазона дат путем выделения или выбора предыдущего/следующего месяца.

# MonthCalendarOnDateSelectedDescr
source: Occurs when the user selects a date or a range of dates.
sr: Происходит при выборе пользователем даты или диапазона дат.

# MonthCalendarRange
source: Unable to set the MonthCalendar range from {0} to {1}.
sr: Невозможно установить диапазон MonthCalendar от {0} до {1}.

# MonthCalendarRangeSelected
source: {0} to {1} selected.
sr: Выбрано: {0}–{1}.

# MonthCalendarScrollChangeDescr
source: The number of months that a single click on a next/previous button moves the display by.
sr: Число месяцев, на которое смещается окно отображения при нажатии кнопок Далее/Назад.

# MonthCalendarSelectionEndDescr
source: The end date in a range of dates selected in a month calendar control.
sr: Конечная дата диапазона, выбранного в элементе управления 'календарь на месяц'.

# MonthCalendarSelectionRangeDescr
source: The range of dates selected in a month calendar control.
sr: Диапазон дат, выбранный в элементе управления 'календарь на месяц'.

# MonthCalendarSelectionStartDescr
source: The start date in a range of dates selected in a month calendar control.
sr: Начальная дата диапазона, выбранного в элементе управления 'календарь на месяц'.

# MonthCalendarShowTodayCircleDescr
source: Indicates whether the month calendar control will circle the \"today\" date.
sr: Указывает, выделяется ли текущая дата кружком в элементе управления \"календарь на месяц\".

# MonthCalendarShowTodayDescr
source: Indicates whether the month calendar control will display the \"today\" date at the bottom of the control.
sr: Указывает, отображается ли текущая дата в элементе управления \"календарь на месяц\" в нижней части данного элемента управления.

# MonthCalendarShowWeekNumbersDescr
source: Indicates whether the month calendar control will display week numbers (1 to 52) to the left of each row of days.
sr: Показывает, будет ли управляющий элемент календаря отображать номера недель (с 1 по 52) слева от каждой строки дней.

# MonthCalendarSingleDateSelected
source: {0} selected.
sr: Выбрано: {0}.

# MonthCalendarSingleDecadeSelected
source: Decade {0} selected.
sr: Выбрана декада {0}.

# MonthCalendarSingleMonthSizeDescr
source: The minimum size required to display a full month.
sr: Минимальный размер, требуемый для отображения месяца полностью.

# MonthCalendarSingleYearSelected
source: Year {0} selected.
sr: Выбран год {0}.

# MonthCalendarTitleBackColorDescr
source: The background color displayed in the calendar's title.
sr: Фоновый цвет заглавия календаря.

# MonthCalendarTitleForeColorDescr
source: The color used to display text within the calendar's title.
sr: Цвет для отображения текста в заглавии календаря.

# MonthCalendarTodayDateDescr
source: The current day.
sr: Текущая дата.

# MonthCalendarTodayDateSetDescr
source: Indicates if the current day has been set.
sr: Указывает, задана ли текущая дата.

# MonthCalendarTrailingForeColorDescr
source: The color used to display the previous and following months that appear on the month calendar.
sr: Цвет для отображения предыдущих и следующих месяцев, отображаемых в элементе управления 'календарь на месяц'.

# MonthCalendarYearRangeSelected
source: Year {0} to {1} selected.
sr: Выбраны года с {0} по {1}.

# NoAllowNewOnReadOnlyList
source: AllowNew can only be set to true on an IBindingList or on a read-write list with a default public constructor.
sr: При использовании публичного конструктора по умолчанию значение параметра AllowNew можно установить равным true только в IBindingList или в списке для чтения и записи.

# NoAllowRemoveOnReadOnlyList
source: AllowRemove can only be set to true on an IBindingList or on a read-write list.
sr: Значение параметра AllowRemove можно установить равным true только в IBindingList или в списке для чтения и записи.

# NoDefaultConstructor
source: Type '{0}' must have a public constructor, without parameters, to be serialized.
sr: Для сериализации у типа Type '{0}' должен быть открытый конструктор без параметров.

# NoMoreColumns
source: There are no more columns in the table. Use NextRow() to start printing on the next row.
sr: В этой таблице больше нет столбцов. Используйте NextRow() для начала печати в следующей строке.

# NonTopLevelCantHaveOwner
source: Only top-level controls can have an owner.
sr: Только у элементов высшего уровня может быть владелец.

# NotAvailable
source: n/a
sr: неприменимо

# NotSerializableType
source: Item named '{0}' of type '{1}' cannot be added to the resource file because it is not serializable.
sr: Элемент с именем '{0}' типа '{1}' нельзя добавить к файлу ресурсов, поскольку он не может быть сериализован.

# NotSortedAccessibleStatus
source: Not sorted.
sr: Не отсортировано.

# NotSupported
source: The type {0} on line {1}, position {2} threw the following exception while being converted: {3}
sr: При преобразовании типа {0} в строке {1} в позиции {2} возникло следующее исключение: {3}

# NotifyIconBalloonTipIconDescr
source: The icon to associate with the balloon ToolTip.
sr: Значок для связывания с подсказкой.

# NotifyIconBalloonTipTextDescr
source: The text to associate with the balloon ToolTip.
sr: Текст для связывания с подсказкой.

# NotifyIconBalloonTipTitleDescr
source: The title of the balloon ToolTip.
sr: Заголовок подсказки.

# NotifyIconEmptyOrNullTipText
source: Balloon tip text must have a non-empty value.
sr: Текст подсказки не должен быть пустым.

# NotifyIconIconDescr
source: The icon to display in the system tray.
sr: Значок, отображаемый в системной корзине.

# NotifyIconMenuDescr
source: The shortcut menu to show when the user right-clicks the icon.
sr: Всплывающее меню, отображаемое при щелчке правой кнопкой мыши на данном значке.

# NotifyIconMouseClickDescr
source: Occurs when the component is clicked with the mouse.
sr: Происходит при щелчке данного компонента.

# NotifyIconMouseDoubleClickDescr
source: Occurs when the component is double-clicked with the mouse.
sr: Происходит при двойном щелчке данного компонента.

# NotifyIconOnBalloonTipClickedDescr
source: Occurs when a balloon ToolTip is clicked.
sr: Происходит при щелчке подсказки.

# NotifyIconOnBalloonTipClosedDescr
source: Occurs when a balloon ToolTip is closed.
sr: Происходит при закрытии подсказки.

# NotifyIconOnBalloonTipShownDescr
source: Occurs when a balloon tip is shown.
sr: Происходит при выводе подсказки на экран.

# NotifyIconTextDescr
source: The text that will be displayed when the mouse hovers over the icon.
sr: Текст, отображаемый при задержке указателя мыши над данным значком.

# NotifyIconVisDescr
source: Determines whether the control is visible or hidden.
sr: Определяет, отображается или скрыт данный элемент управления.

# NumericUpDownAccelerationCollectionAtLeastOneEntryIsNull
source: At least one of the NumericUpDownAcceleration elements is null.
sr: Как минимум один из элементов NumericUpDownAcceleration пуст.

# NumericUpDownAccelerationCompareException
source: Argument is null or is not a NumericUpDownAcceleration object.
sr: Аргумент пуст или не является объектом NumericUpDownAcceleration.

# NumericUpDownDecimalPlacesDescr
source: Indicates the number of decimal places to display.
sr: Указывает число отображаемых десятичных разрядов.

# NumericUpDownHexadecimalDescr
source: Indicates whether the numeric up-down should display its value in hexadecimal.
sr: Указывает, должно ли значение числового поля со стрелками 'вверх/вниз' отображаться в шестнадцатеричном формате.

# NumericUpDownIncrementDescr
source: Indicates the amount to increment or decrement on each button click.
sr: Показывает величину уменьшения или увеличения при каждом щелчке мышью.

# NumericUpDownLessThanZeroError
source: Parameter value must be greater than or equal to 0.
sr: Значение параметра должно быть больше или равно 0.

# NumericUpDownMaximumDescr
source: Indicates the maximum value for the numeric up-down control.
sr: Указывает максимальное значение для числового поля со стрелками 'вверх/вниз'.

# NumericUpDownMinimumDescr
source: Indicates the minimum value for the numeric up-down control.
sr: Указывает минимальное значение для числового поля со стрелками 'вверх/вниз'.

# NumericUpDownOnValueChangedDescr
source: Occurs when the value in the up-down control changes.
sr: Происходит при изменении значения данного поля со стрелками 'вверх/вниз'.

# NumericUpDownThousandsSeparatorDescr
source: Indicates whether the thousands separator will be inserted between every three decimal digits.
sr: Указывает, должен ли отображаться разделитель тысяч между группами из трех цифр.

# NumericUpDownValueDescr
source: The current value of the numeric up-down control.
sr: Текущее значение числового поля со стрелками 'вверх/вниз'.

# OFDcheckFileExistsDescr
source: Indicates whether a warning appears when the user specifies a file that does not exist.
sr: Перед возвратом из диалогового окна проверяет, что заданный файл существует.

# OFDmultiSelectDescr
source: Controls whether multiple files can be selected in the dialog.
sr: Определяет, возможен ли в данном диалоговом окне выбор нескольких файлов.

# OFDreadOnlyCheckedDescr
source: The state of the read-only check box in the dialog.
sr: Состояние доступного только для чтения флажка проверки в данном диалоговом окне.

# OFDshowReadOnlyDescr
source: Controls whether to show the read-only check box in the dialog.
sr: Задает, отображается ли доступный только для чтения флажок проверки в данном диалоговом окне.

# OKCaption
source: OK
sr: ОК

# ObjectDisposed
source: Disposed '{0}' can no longer be used.
sr: Выгруженный '{0}' больше использовать нельзя.

# ObjectHasParent
source: Object already has a parent.
sr: Объект уже имеет родителя.

# OnlyOneControl
source: Cannot add or insert the item '{0}' in more than one place. You must first remove it from its current location or clone it.
sr: Невозможно добавить или вставить элемент '{0}' в несколько позиций. Сначала удалите его из текущей позиции или создайте его клон.

# OperationRequiresIBindingList
source: This operation requires an IBindingList.
sr: Для данной операции нужен IBindingList.

# OperationRequiresIBindingListView
source: This operation requires an IBindingListView.
sr: Для данной операции нужен IBindingListView.

# OutOfMemory
source: Cannot allocate needed memory.
sr: Невозможно выделить необходимую память.

# OwnerControlIsNotALiveRegion
source: Owner control of the accessible object must implement IAutomationLiveRegion interface.
sr: Элемент управления — владелец объекта со специальными возможностями должен реализовывать интерфейс IAutomationLiveRegion.

# OwnsSelfOrOwner
source: Form {0} tried to set an ineligible form as its owner. Forms cannot own themselves or their owners.
sr: Форма {0} пыталась установить в качестве своего владельца недействительную форму. Формы не могут быть владельцами самих себя или своих владельцев.

# PBRSDocCommentPaneTitle
source: Description
sr: Описание

# PBRSErrorInvalidPropertyValue
source: Property value is not valid.
sr: Недопустимое значение свойства.

# PBRSErrorTitle
source: Properties Window
sr: Окно свойств

# PBRSFormatExceptionMessage
source: Drop-down list option is not valid.
sr: Недопустимый параметр раскрывающегося списка.

# PBRSToolTipAlphabetic
source: Alphabetical
sr: В алфавитном порядке

# PBRSToolTipCategorized
source: Categorized
sr: По категориям

# PBRSToolTipEvents
source: Events
sr: События

# PBRSToolTipProperties
source: Properties
sr: Свойства

# PBRSToolTipPropertyPages
source: Property Pages
sr: Страницы свойств

# PDallowCurrentPageDescr
source: Enables and disables the Current Page option button.
sr: Активирует и дезактивирует кнопку режима Current Page.
