Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# ControlWithScrollbarsVirtualSizeDescr
source: The size of the control if the screen were infinitely large.
sr: Размеры данного элемента управления при бесконечном размере экрана.

# CurrencyManagerCantAddNew
source: The list must be an IBindingList to AddNew.
sr: Данный список должен быть IBindingList для AddNew.

# CursorCannotCovertToBytes
source: System cursors cannot be converted to byte[].
sr: Системные курсоры невозможно привести к типу byte[].

# CursorCannotCovertToString
source: Custom cursors cannot be converted to string.
sr: Пользовательские курсоры невозможно привести к типу string.

# CursorNonSerializableHandle
source: Stock cursors cannot be serialized.
sr: Невозможно сериализовать Stock курсоры.

# DataBindingAddNewNotSupportedOnPropertyManager
source: AddNew is not supported for property to property binding.
sr: Метод AddNew не поддерживается для привязки свойства к другому свойству.

# DataBindingCycle
source: Detected a property binding cycle for the property '{0}'
sr: Для свойства '{0}' обнаружена циклическая привязка свойств

# DataBindingPushDataException
source: DataBinding cannot find a row in the list that is suitable for all bindings.
sr: DataBinding не может найти в списке строку, подходящую для всех привязок.

# DataBindingRemoveAtNotSupportedOnPropertyManager
source: RemoveAt is not supported for property-to-property binding.
sr: Метод RemoveAt не поддерживается для привязки свойства к другому свойству.

# DataGridViewAlternatingRowsDefaultCellStyleChangedDescr
source: Occurs when the value of the AlternatingRowsDefaultCellStyle property changes.
sr: Возникает при изменении значения свойства AlternatingRowsDefaultCellStyle.

# DataGridViewAutoSizeColumnModeChangedDescr
source: Occurs when the value of the AutoSizeMode property of a column changes.
sr: Возникает при изменении значения свойства AutoSizeMode столбца.

# DataGridViewAutoSizeColumnsModeChangedDescr
source: Occurs when the value of the AutoSizeColumnsMode property changes.
sr: Возникает при изменении значения свойства AutoSizeColumnsMode.

# DataGridViewAutoSizeRowsModeChangedDescr
source: Occurs when the value of the AutoSizeRowsMode property changes.
sr: Возникает при изменении значения свойства AutoSizeRowsMode.

# DataGridViewBackgroundColorChangedDescr
source: Occurs when the value of the DataGridView.BackgroundColor property changes.
sr: Возникает при изменении значения свойства DataGridView.BackgroundColor.

# DataGridViewBackgroundColorDescr
source: The background color of the DataGridView.
sr: Фоновый цвет для DataGridView.

# DataGridViewBand_CannotSelect
source: Selected property cannot be altered before this object is added to a DataGridView control.
sr: Невозможно изменить выбранное свойство до добавления данного объекта в элемент управления DataGridView.

# DataGridViewBand_MinimumHeightSmallerThanOne
source: Minimum height provided cannot be smaller than {0}.
sr: Минимальная высота не может быть меньше {0}.

# DataGridViewBand_MinimumWidthSmallerThanOne
source: Minimum width provided cannot be smaller than {0}.
sr: Минимальная ширина не может быть меньше {0}.

# DataGridViewBand_NewRowCannotBeInvisible
source: Uncommitted new row cannot be made invisible.
sr: Непереданные новые строки нельзя сделать невидимыми.

# DataGridViewBeginInit
source: BeginInit() has already been called without an EndInit().
sr: Метод BeginInit() был вызван ранее без вызова метода EndInit().

# DataGridViewBorderStyleChangedDescr
source: Occurs when the value of the BorderStyle property changes.
sr: Возникает при изменении значения свойства BorderStyle .

# DataGridViewCellAccessibleObject_OwnerAlreadySet
source: The owning DataGridViewCell object is already set.
sr: Объект-владелец для DataGridViewCell уже задан.

# DataGridViewCellAccessibleObject_OwnerNotSet
source: The owning DataGridViewCell object has not been set.
sr: Не задан объект-владелец для DataGridViewCell.

# DataGridViewCellCollection_AtLeastOneCellIsNull
source: At least one of the provided cells is null.
sr: Как минимум одна из указанных ячеек имеет пустое значение.

# DataGridViewCellCollection_CannotAddIdenticalCells
source: At least two provided cells are identical. Each provided cell must be unique.
sr: Как минимум две указанные ячейки идентичны. Каждая ячейка должна быть уникальной.

# DataGridViewCellCollection_CellAlreadyBelongsToDataGridView
source: Cell provided already belongs to a grid. This operation is not valid.
sr: Указанные ячейки уже принадлежат к сетке. Выполнение операции невозможно.

# DataGridViewCellCollection_CellAlreadyBelongsToDataGridViewRow
source: Cell provided already belongs to a row. This operation is not valid.
sr: Указанная ячейка уже принадлежит к сетке. Выполнение операции невозможно.

# DataGridViewCellCollection_CellNotFound
source: Cell provided cannot be found in the collection.
sr: Указанная ячейка не найдена в коллекции.

# DataGridViewCellCollection_OwningRowAlreadyBelongsToDataGridView
source: Collection already belongs to a DataGridView control. This operation is no longer valid.
sr: Данная коллекция уже принадлежит к элементу управления DataGridView. Операция больше не является допустимой.

# DataGridViewCellStyleAlignmentDescr
source: Indicates the position of the content within a cell.
sr: Определяет положение содержимого внутри ячейки.

# DataGridViewCellStyle_TransparentColorNotAllowed
source: DataGridViewCellStyle does not support transparent {0}.
sr: DataGridViewCellStyle не поддерживает прозрачный {0}.

# DataGridViewCell_CannotSetReadOnlyState
source: ReadOnly property of a cell cannot be set before it is added to a row.
sr: Невозможно задать свойство ReadOnly ячейки до того, как она будет добавлена в строку.

# DataGridViewCell_CannotSetSelectedState
source: Selected property of a cell cannot be set before the cell is added to a DataGridView control.
sr: Невозможно изменить выбранное свойство ячейки до того, как ячейка будет добавлена в элемент управления DataGridView.

# DataGridViewCell_FormattedValueHasWrongType
source: Formatted value of the cell has a wrong type.
sr: Недопустимый тип значения, определяющего форматирование ячейки.

# DataGridViewCell_FormattedValueTypeNull
source: FormattedValueType property of a cell cannot be null.
sr: Свойство FormattedValueType ячейки не может принимать пустое значение.

# DataGridViewCell_ValueTypeNull
source: ValueType property of a cell in a grid cannot be null.
sr: Свойство ValueType ячейки в сетке не может принимать пустое значение.

# DataGridViewCheckBoxCell_ClipboardChecked
source: Selected
sr: Выбрано

# DataGridViewCheckBoxCell_ClipboardIndeterminate
source: Indeterminate
sr: Неопределенное

# DataGridViewCheckBoxCell_ClipboardUnchecked
source: Cleared
sr: Флажок снят

# DataGridViewCheckBoxCell_InvalidValueType
source: The value provided for the DataGridViewCheckBoxCell has the wrong type.
sr: Недопустимый тип значения для DataGridViewCheckBoxCell.

# DataGridViewColumnCollection_ColumnNotFound
source: Column named {0} cannot be found.
sr: Не удается найти столбец с именем {0}.

# DataGridViewColumnHeaderCell_SortModeAndSortGlyphDirectionClash
source: Column header's SortGlyphDirection cannot be set to {0} while the column's SortMode is set to NotSortable.
sr: SortGlyphDirection заголовка столбца не может иметь значение {0}, если для SortMode столбца выбрано значение NotSortable.

# DataGridViewColumnHeadersDefaultCellStyleChangedDescr
source: Occurs when the value of the ColumnHeadersDefaultCellStyle property changes.
sr: Возникает при изменении значения свойства ColumnHeadersDefaultCellStyle.

# DataGridViewColumnHeadersHeightChangedDescr
source: Occurs when the value of the ColumnHeadersHeight property changes.
sr: Возникает при изменении значения свойства ColumnHeadersHeight.

# DataGridViewColumnHeadersVisibleDescr
source: Indicates whether the column headers row is displayed.
sr: Указывает, отображается ли строка заголовков столбцов.

# DataGridViewColumnSortModeChangedDescr
source: Occurs when the value of the SortMode property for a column changes.
sr: Возникает при изменении значения свойства SortMode столбца.

# DataGridViewColumn_AutoSizeCriteriaCannotUseInvisibleHeaders
source: Column AutoSize mode cannot be based on the column headers alone while they are invisible.
sr: Режим AutoSize столбцов не может основываться только на заголовках столбцов, пока они невидимы.

# DataGridViewColumn_AutoSizeModeDescr
source: Determines the auto size mode for this column.
sr: Определяет режим автоматического изменения размера для данного столбца.

# DataGridViewColumn_CellTemplateRequired
source: Operation cannot be completed because this DataGridViewColumn does not have a CellTemplate.
sr: Выполнение операции невозможно, так как у данного DataGridViewColumn отсутствует CellTemplate.

# DataGridViewColumn_DisplayIndexExceedsColumnCount
source: The DisplayIndex property of a DataGridViewColumn must be smaller than the number of columns.
sr: Значение свойства DisplayIndex для DataGridViewColumn должно быть меньше числа столбцов.

# DataGridViewColumn_DisplayIndexNegative
source: DisplayIndex property of a DataGridViewColumn cannot be negative.
sr: Значение свойства DisplayIndex для DataGridViewColumn не может быть отрицательным.

# DataGridViewColumn_DisplayIndexTooLarge
source: DisplayIndex property of a DataGridViewColumn must be smaller than {0}.
sr: Значение свойства DisplayIndex для DataGridViewColumn должно быть меньше {0}.

# DataGridViewColumn_DisplayIndexTooNegative
source: The DisplayIndex property of a detached DataGridViewColumn cannot be smaller than -1.
sr: Значение свойства DisplayIndex для неприсоединенного DataGridViewColumn не может быть меньше -1.

# DataGridViewColumn_FillWeightDescr
source: The weight that is used when sizing this column in the Fill auto size mode.
sr: Плотность, используемая при задании размера данного столбца в режиме автоматической установки размера Fill.

# DataGridViewColumn_FrozenColumnCannotAutoFill
source: Column's AutoSize mode cannot be set to Fill when it is also a frozen column.
sr: Для режима AutoSize фиксированного столбца невозможно установить значение Fill.

# DataGridViewColumn_SortModeAndSelectionModeClash
source: Column's SortMode cannot be set to {0} while the DataGridView control's SelectionMode is set to {1}.
sr: SortMode столбца не может иметь значение {0}, если для SelectionMode элемента управления DataGridView установлено значение {1}.

# DataGridViewComboBoxCell_DropDownWidthOutOfRange
source: DropDownWidth value cannot be smaller than {0}.
sr: Значение DropDownWidth не может быть меньше {0}.

# DataGridViewComboBoxCell_FieldNotFound
source: Field called {0} does not exist.
sr: Поле с именем {0} не существует.

# DataGridViewComboBoxCell_InvalidValue
source: DataGridViewComboBoxCell value is not valid.
sr: Недопустимое значение DataGridViewComboBoxCell.

# DataGridViewComboBoxCell_MaxDropDownItemsOutOfRange
source: MaxDropDownItems value cannot be smaller than {0} or larger than {1}.
sr: Значение MaxDropDownItems не может быть меньше {0} или больше {1}.

# DataGridViewDataMemberChangedDescr
source: Occurs when the value of the DataMember property changes.
sr: Возникает при изменении значения свойства DataMember.

# DataGridViewDataMemberDescr
source: Indicates a sub-list of the DataSource to show in the DataGridView control.
sr: Указывает подсписок DataSource, отображаемый в элементе управления DataGridView.

# DataGridViewDataSourceChangedDescr
source: Occurs when the value of the DataSource property changes.
sr: Возникает при изменении значения свойства DataSource.

# DataGridViewDataSourceDescr
source: Indicates the source of data for the DataGridView control.
sr: Указывает источник данных для элемента управления DataGridView.

# DataGridViewDefaultCellStyleChangedDescr
source: Occurs when the value of the DefaultCellStyle property changes.
sr: Возникает при изменении значения свойства DefaultCellStyle.

# DataGridViewEditingPanelUiaProviderDescription
source: DataGridView EditingPanel UI Automation provider
sr: Поставщик автоматизации пользовательского интерфейса для EditingPanel в DataGridView

# DataGridViewElementPaintingEventArgs_ColumnIndexOutOfRange
source: ColumnIndex property is out of range.
sr: Значение свойства ColumnIndex не принадлежит допустимому диапазону.

# DataGridViewElementPaintingEventArgs_RowIndexOutOfRange
source: RowIndex property is out of range.
sr: Значение свойства RowIndex не принадлежит допустимому диапазону.

# DataGridViewGridColorDescr
source: The color of the grid lines separating the cells of the DataGridView.
sr: Цвет линий сетки, разделяющих ячейки DataGridView.

# DataGridViewImageColumn_DescriptionDescr
source: User-defined text associated with the image.
sr: Заданный пользователем текст, связанный с данным изображением.

# DataGridViewImageColumn_IconDescr
source: The icon displayed in the cells of this column when the cell's DataGridViewCell.Value property is not set and the cell's DataGridViewImageCell.ValueIsIcon property is set to true.
sr: Значок, отображаемый в ячейках данного столбца, если свойство DataGridViewCell.Value не задано, а свойство DataGridViewImageCell.ValueIsIcon ячейки имеет значение true.

# DataGridViewImageColumn_ImageDescr
source: The image displayed in the cells of this column when the cell's DataGridViewCell.Value property is not set and the cell's DataGridViewImageCell.ValueIsIcon property is set to false.
sr: Изображение, отображаемое в ячейках данного столбца, если свойство DataGridViewCell.Value не задано, а свойство DataGridViewImageCell.ValueIsIcon ячейки имеет значение true.

# DataGridViewImageColumn_ImageLayoutDescr
source: The image layout in the cells for this column.
sr: Макет изображения для ячеек данного столбца.

# DataGridViewImageColumn_ValuesAreIconsDescr
source: Indicates whether cells in this column display System.Drawing.Icon values.
sr: Указывает, отображаются ли значения System.Drawing.Icon в ячейках данного столбца.

# DataGridViewOnAllowUserToAddRowsChangedDescr
source: Occurs when the value of the AllowUserToAddRows property changes.
sr: Возникает при изменении значения свойства AllowUserToAddRows.

# DataGridViewOnAllowUserToDeleteRowsChangedDescr
source: Occurs when the value of the AllowUserToDeleteRows property changes.
sr: Возникает при изменении значения свойства AllowUserToDeleteRows.

# DataGridViewOnAllowUserToOrderColumnsChangedDescr
source: Occurs when the value of the AllowUserToOrderColumns property changes.
sr: Возникает при изменении значения свойства AllowUserToOrderColumns.

# DataGridViewOnAllowUserToResizeColumnsChangedDescr
source: Occurs when the value of the AllowUserToResizeColumns property changes.
sr: Возникает при изменении значения свойства AllowUserToResizeColumns.

# DataGridViewOnAllowUserToResizeRowsChangedDescr
source: Occurs when the value of the AllowUserToResizeRows property changes.
sr: Возникает при изменении значения свойства AllowUserToResizeRows.

# DataGridViewOnGridColorChangedDescr
source: Occurs when the value of the GridColor property changes.
sr: Возникает при изменении значения свойства GridColor.

# DataGridViewOnMultiSelectChangedDescr
source: Occurs when the value of the MultiSelect property changes.
sr: Возникает при изменении значения свойства MultiSelect.

# DataGridViewOnReadOnlyChangedDescr
source: Occurs when the value of the ReadOnly property changes.
sr: Возникает при изменении значения свойства ReadOnly.

# DataGridViewRowAccessibleObject_OwnerAlreadySet
source: Owning DataGridViewRow object is already set.
sr: Объект-владелец DataGridViewRow уже задан.

# DataGridViewRowAccessibleObject_OwnerNotSet
source: Owning DataGridViewRow object has not been set.
sr: Не задан объект-владелец DataGridViewRow.

# DataGridViewRowCollection_AddUnboundRow
source: Rows cannot be programmatically added to the DataGridView's rows collection when the control is data-bound.
sr: Строки нельзя программным способом добавить в коллекцию строк DataGridView, если элемент управления привязан к данным.

# DataGridViewRowCollection_CannotAddOrInsertSelectedRow
source: Selected row cannot be added to or inserted into the DataGridView control. The row must be deselected first.
sr: Выбранные строки нельзя добавить или вставить в элемент управления DataGridView. Сначала необходимо снять выделение.

# DataGridViewRowCollection_CannotDeleteNewRow
source: Uncommitted new row cannot be deleted.
sr: Удаление непереданной новой строки невозможно.

# DataGridViewRowCollection_CantClearRowCollectionWithWrongSource
source: Rows collection cannot be programmatically cleared when the DataGridView control is data-bound to anything else than an IBindingList that supports change notification and allows deletion.
sr: Коллекцию строк нельзя очистить программно, если элемент управления DataGridView привязан к данным объекта, отличного от IBindingList, который поддерживает уведомление об изменении и допускает удаление.

# DataGridViewRowCollection_CantRemoveRowsWithWrongSource
source: Rows cannot be programmatically removed unless the DataGridView is data-bound to an IBindingList that supports change notification and allows deletion.
sr: Cтроки нельзя удалить программно, за исключением случая, когда элемент управления DataGridView привязан к данным объекта IBindingList, который поддерживает уведомление об изменении и допускает удаление.

# DataGridViewRowCollection_CountOutOfRange
source: Number of copies to create must be strictly positive.
sr: Число копий, которые необходимо создать, должно быть только положительным.

# DataGridViewRowCollection_EnumFinished
source: Enumeration already finished.
sr: Перечисление уже завершено.

# DataGridViewRowCollection_EnumNotStarted
source: Enumeration has not started. Call MoveNext.
sr: Перечисление не начато. Вызовите MoveNext.

# DataGridViewRowCollection_IndexDestinationOutOfRange
source: Index of the destination row is out of range.
sr: Индекс конечной строки находится вне допустимого диапазона.

# DataGridViewRowCollection_IndexSourceOutOfRange
source: Index of the row to copy is out of range.
sr: Индекс строки, которую необходимо скопировать, находится вне допустимого диапазона.

# DataGridViewRowCollection_NoColumns
source: No row can be added to a DataGridView control that does not have columns. Columns must be added first.
sr: Невозможно добавить строки в элемент управления DataGridView, в котором нет столбцов. Сначала необходимо добавить столбцы.

# DataGridViewRowCollection_NoInsertionAfterNewRow
source: No row can be inserted after the uncommitted new row.
sr: Невозможно вставить строку после непереданной новой строки.

# DataGridViewRowCollection_NoRowToDuplicate
source: No row exists to make a copy of. A first row must be added to the DataGridView control before you can add copies of it.
sr: Отсутствует строка для копирования. Необходимо добавить первую строку в элемент управления DataGridView, а затем добавлять ее копии.

# DataGridViewRowCollection_RowIndexOutOfRange
source: Row index provided is out of range.
sr: Указанный индекс строки находится вне допустимого диапазона.

# DataGridViewRowCollection_RowTemplateTooManyCells
source: The RowTemplate row contains more cells than there are columns.
sr: Строка RowTemplate содержит больше ячеек, чем число столбцов.

# DataGridViewRowCollection_TooManyCells
source: Provided row contains more cells than there are columns.
sr: Указанная строка содержит больше ячеек, чем число столбцов.

# DataGridViewRowHeadersDefaultCellStyleChangedDescr
source: Occurs when the value of the RowHeadersDefaultCellStyle property changes.
sr: Возникает при изменении значения свойства RowHeadersDefaultCellStyle.

# DataGridViewRowHeadersVisibleDescr
source: Indicates whether the column that contains row headers is displayed.
sr: Указывает, отображается ли столбец, содержащий заголовки строк.

# DataGridViewRowHeadersWidthChangedDescr
source: Occurs when the value of the RowHeadersWidth property changes.
sr: Возникает при изменении значения свойства RowHeadersWidth.

# DataGridViewRowsDefaultCellStyleChangedDescr
source: Occurs when the value of the RowsDefaultCellStyle property changes.
sr: Возникает при изменении значения свойства RowsDefaultCellStyle.

# DataGridViewSortedAscendingAccessibleStatusFormat
source: Sorted ascending by {0}.
sr: Отсортировано по возрастанию: {0}.

# DataGridViewSortedDescendingAccessibleStatusFormat
source: Sorted descending by {0}.
sr: Отсортировано по убыванию: {0}.

# DataGridViewTopRowAccessibleObject_OwnerAlreadySet
source: The owning DataGridView control is already set.
sr: Элемент управления владелец DataGridViewуже задан.

# DataGridViewTopRowAccessibleObject_OwnerNotSet
source: The owning DataGridView control has not been set.
sr: Не задан элемент управления владелец DataGridView.

# DataGridViewTypeColumn_WrongCellTemplateType
source: Value provided for CellTemplate must be of type {0} or derive from it.
sr: Значение CellTemplate должно иметь тип {0}, либо производный от него тип.

# DataGridViewVirtualModeDescr
source: Indicates whether you have provided your own data-management operations for the DataGridView control.
sr: Указывает, предоставил ли пользователь собственные операции управления данными для элемента управления DataGridView.

# DataGridView_AColumnHasNoCellTemplate
source: At least one of the DataGridView control's columns has no cell template.
sr: Как минимум один из столбцов элемента управления DataGridView не имеет шаблона ячейки.

# DataGridView_AccButtonCellDefaultAction
source: Press
sr: Нажать

# DataGridView_AccCellDefaultAction
source: Edit
sr: Редактировать

# DataGridView_AccCheckBoxCellDefaultActionCheck
source: Press to check
sr: Установить флажок

# DataGridView_AccCheckBoxCellDefaultActionUncheck
source: Press to uncheck
sr: Снять флажок

# DataGridView_AccColumnHeaderCellDefaultAction
source: Press to sort column
sr: Сортировать столбец

# DataGridView_AccColumnHeaderCellSelectDefaultAction
source: Press to select column
sr: Выбрать столбец

# DataGridView_AccDataGridViewCellName
source: {0} Row {1}
sr: {0} Строка {1}

# DataGridView_AccEditingControlAccName
source: Editing Control
sr: Правка

# DataGridView_AccEditingPanelAccName
source: Editing Panel
sr: Панель редактирования

# DataGridView_AccHorizontalScrollBarAccName
source: Horizontal
sr: По горизонтали

# DataGridView_AccLinkCellDefaultAction
source: Click
sr: Щелчок

# DataGridView_AccRowCreateNew
source: (Create New)
sr: (Создать новый)

# DataGridView_AccRowName
source: Row {0}
sr: Строка {0}

# DataGridView_AccSelectedCellsName
source: Selected Cells
sr: Выбранные ячейки

# DataGridView_AccSelectedRowCellsName
source: Selected Row Cells
sr: Выбранные ячейки строк

# DataGridView_AccTopLeftColumnHeaderCellDefaultAction
source: Press to Select All
sr: Выбрать все

# DataGridView_AccTopLeftColumnHeaderCellName
source: Top Left Header Cell
sr: Ячейка левого верхнего заголовка

# DataGridView_AccTopLeftColumnHeaderCellNameRTL
source: Top Right Header Cell
sr: Ячейка правого верхнего заголовка

# DataGridView_AccTopRow
source: Top Row
sr: Верхняя строка

# DataGridView_AccVerticalScrollBarAccName
source: Vertical
sr: По вертикали

# DataGridView_AdvancedCellBorderStyleInvalid
source: Property {0} cannot be set to the advanced cell border style provided.
sr: Для свойства {0} невозможно установить дополнительный стиль границы ячейки.

# DataGridView_AllowUserToAddRowsDescr
source: Indicates whether the option to add rows is displayed to the user.
sr: Указывает, отображается ли возможность добавления строк.

# DataGridView_AllowUserToDeleteRowsDescr
source: Indicates whether the user is allowed to delete rows from the DataGridView.
sr: Указывает, может ли пользователь удалять строки из DataGridView.
