Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# PropertyGridCommandsActiveLinkColorDesc
source: The color of active links in the hot commands region.
sr: Цвет активных ссылок в области часто используемых команд.

# PropertyGridCommandsBackColorDesc
source: The background color of the hot commands region.
sr: Фоновый цвет области часто используемых команд.

# PropertyGridCommandsBorderColorDesc
source: The color of the border surrounding the hot commands region.
sr: Цвет границы вокруг области часто используемых команд.

# PropertyGridCommandsDisabledLinkColorDesc
source: The color of disabled links in the hot commands region.
sr: Цвет отключенных ссылок в области часто используемых команд.

# PropertyGridCommandsForeColorDesc
source: The foreground color of the hot commands region.
sr: Цвет переднего плана области часто используемых команд.

# PropertyGridCommandsLinkColorDesc
source: The color of enabled links in the hot commands region.
sr: Цвет включенных ссылок в области часто используемых команд.

# PropertyGridCommandsVisibleIfAvailable
source: Show the commands pane if the selected object exposes verbs.
sr: Отображать панель задач, если выбранный объект представляет предикаты.

# PropertyGridDefaultAccessibleName
source: Properties Window
sr: Окно свойств

# PropertyGridDefaultAccessibleNameTemplate
source: {0} Properties Window
sr: {0}: окно свойств

# PropertyGridDisabledItemForeColorDesc
source: The foreground color of disabled text in the grid area.
sr: Цвет переднего плана отключенного текста в области таблицы.

# PropertyGridDocCommentAccessibleNameTemplate
source: {0} Description
sr: {0}: описание

# PropertyGridDropDownButtonAccessibleName
source: Browse...
sr: Обзор…

# PropertyGridDropDownButtonComboBoxAccessibleName
source: Open
sr: Открыть

# PropertyGridExceptionInfo
source: Error Information
sr: Информация об ошибке

# PropertyGridExceptionWhilePaintingLabel
source: Exception has occurred while painting the label for property '{0}'. See below for details."
sr: При отрисовке надписи для свойства '{0}' возникло исключение. Подробную информацию см. ниже.»

# PropertyGridHelpBackColorDesc
source: The background color of the description pane.
sr: Фоновый цвет панели описания.

# PropertyGridHelpBorderColorDesc
source: The color of the border surrounding the description pane.
sr: Цвет границы вокруг области описания.

# PropertyGridHelpForeColorDesc
source: The foreground color of the description pane.
sr: Цвет переднего плана панели описания.

# PropertyGridHelpVisibleDesc
source: Sets whether to show the description pane.
sr: Устанавливает, должна ли отображаться панель описания.

# PropertyGridInternalNoProp
source: Get of properties did not succeed. Log at {0}
sr: Получение свойств не выполнено. Войти в {0}.

# PropertyGridInvalidGridEntry
source: GridItem specified to PropertyGrid.SelectedGridItem must be a valid GridItem.
sr: GridItem для PropertyGrid.SelectedGridItem должен быть допустимым значением GridItem.

# PropertyGridLargeButtonsDesc
source: Sets buttons to large (32x32) on the PropertyGrid tool bar.
sr: Устанавливает большой размер кнопок (32x32) на панели инструментов PropertyGrid.

# PropertyGridLineColorDesc
source: Sets the color of the borders and grid lines within the grid area.
sr: Устанавливает цвет границ и линий сетки в области сетки.

# PropertyGridNoBitmap
source: Tab '{0}' does not have a bitmap.
sr: Отсутствует растровое изображение для вкладки '{0}'.

# PropertyGridPropertySortChangedDescr
source: Occurs when the PropertySort property on the PropertyGrid has changed.
sr: Происходит при изменении свойства PropertySort объекта PropertyGrid.

# PropertyGridPropertySortDesc
source: Sets the type of sorting that the PropertyGrid will use to display properties.
sr: Назначает тип сортировки, которую использует PropertyGrid для отображения свойств.

# PropertyGridPropertyTabCollectionReadOnly
source: PropertyTabCollection is read-only.
sr: PropertyTabCollection предназначено только для чтения.

# PropertyGridPropertyTabchangedDescr
source: Occurs when a property tab changes.
sr: Происходит при смене вкладки свойств.

# PropertyGridPropertyValueChangedDescr
source: Occurs when a property value changes.
sr: Возникает при смене значения свойства.

# PropertyGridPropertyValueSelectedFormat
source: {0} selected.
sr: Выбрано: {0}.

# PropertyGridRemotedObject
source: Object {0} is being remoted by a proxy that does not support interface discovery. This type of remoted object is not supported.
sr: Объект {0} находится за прокси, не поддерживающим обнаружение интерфейса. Такой тип удаленного объекта не поддерживается.

# PropertyGridRemoveStaticTabs
source: Static tabs cannot be removed from the PropertyGrid.
sr: <невозможно найти строку ресурса "PropertyGridRemoveStaticTabs">

# PropertyGridResetValue
source: Reset property '{0}'
sr: Сбрасывает свойство '{0}'

# PropertyGridSelectedGridItemChangedDescr
source: Occurs when the selected grid item has changed.
sr: Возникает при изменении выбранного элемента сетки.

# PropertyGridSelectedItemWithFocusBackColorDesc
source: The background color of selected items that have focus.
sr: Цвет фона выделенных элементов, имеющих фокус.

# PropertyGridSelectedItemWithFocusForeColorDesc
source: The foreground color of selected items that have focus.
sr: Цвет переднего плана выделенных элементов, имеющих фокус.

# PropertyGridSelectedObjectDesc
source: Sets the currently selected object that the grid will browse.
sr: Назначает текущий выбранный объект, который будет просматриваться в сетке.

# PropertyGridSelectedObjectsChangedDescr
source: Occurs when the SelectedObjects property has changed.
sr: Возникает при изменении свойства SelectedObjects.

# PropertyGridSet
source: 'objs' array must have at least {0} members.
sr: Массив 'objs' должен содержать не менее {0} членов.

# PropertyGridSetNull
source: Item {0} in the 'objs' array is null. The array must begin with at least {1} members.
sr: Элемент {0} в массиве 'objs' пуст. Этот массив должен начинаться не менее, чем с {1} членов.

# PropertyGridSetValue
source: Set Property '{0}'
sr: Установка свойства "{0}"

# PropertyGridTabName
source: Tab '{0}' must have a valid name.
sr: У вкладки '{0}' должно быть допустимое имя.

# PropertyGridTabScope
source: TabScope must be TabScopeEnum.Component or TabScopeEnum.Document
sr: TabScope может принимать значения TabScopeEnum.Component и TabScopeEnum.Document

# PropertyGridToolbarVisibleDesc
source: Sets whether to display the ToolBar at the top of the PropertyGrid.
sr: Определяет, отображать ли панель инструментов в верхней части PropertyGrid.

# PropertyGridViewBackColorDesc
source: Sets the background color of the grid area.
sr: Задает фоновый цвет для области сетки.

# PropertyGridViewBorderColorDesc
source: The color of the border surrounding the grid area.
sr: Цвет границы вокруг области таблицы.

# PropertyGridViewEditorCreatedInvalidObject
source: Editor created an object that is not valid. The created object must be of type '{0}'.
sr: Элемент Editor создал недействительный объект. Созданный объект должен быть типа '{0}'.

# PropertyGridViewForeColorDesc
source: Sets the foreground color of the grid area.
sr: Задает цвет переднего плана для области сетки.

# PropertyManagerPropDoesNotExist
source: Property {0} does not exist in {1}.
sr: Свойство {0} в {1} не существует.

# PropertyValueInvalidEntry
source: One or more entries are not valid in the IDictionary parameter. Verify that all values match up to the object's properties.
sr: Недействительны одна или больше записей в параметре IDictionary. Проверьте, все ли значения соответствуют свойствам этого объекта.

# RadioButtonAppearanceDescr
source: Controls whether the RadioButton appears as normal or as a Windows PushButton.
sr: Указывает, будет ли RadioButton отображаться стандартно или как объект Windows PushButton.

# RadioButtonAutoCheckDescr
source: Causes the radio button to automatically change state when clicked.
sr: Вызывает автоматическое изменение состояния переключателя при его выборе.

# RadioButtonCheckAlignDescr
source: Determines the location of the check box inside the control.
sr: Определяет местоположение данного флажка проверки в элементе управления.

# RadioButtonCheckedDescr
source: Indicates whether the radio button is checked or not.
sr: Указывает состояние переключателя.

# RadioButtonOnAppearanceChangedDescr
source: Event raised when the value of the Appearance property is changed on RadioButton.
sr: Событие создается, когда для RadioButton изменяется значение свойства Appearance

# RadioButtonOnCheckedChangedDescr
source: Occurs whenever the 'checked' property changes value.
sr: Происходит при изменении значения свойства checked.

# RadioButtonOnStartPageChangedDescr
source: Event raised when the value of the StartPage property is changed on RadioButton.
sr: Событие создается, когда для RadioButton изменяется значение свойства StartPage.

# RadioButtonOnTextAlignChangedDescr
source: Occurs when the value of the TextAlign property changes
sr: Происходит при изменении значения свойства TextBoxTextAlign.

# ReadonlyControlsCollection
source: Collection is read only.
sr: Коллекция предназначена только для чтения.

# RegisterCFFailed
source: Clipboard format registration did not succeed.
sr: Регистрация формата буфера обмена не удалась.

# RelatedListManagerChild
source: Child list for field {0} cannot be created.
sr: Список потомков для поля {0} создать нельзя.

# ResXResourceWriterSaved
source: Resource writer has been saved. You may not edit it.
sr: Объект, выполняющий запись ресурсов, сохранен. Редактирование запрещено.

# RestartNotSupported
source: Restart method is not supported for this application type.
sr: Метод Restart не поддерживается для данного типа приложения.

# RichControlLresult
source: Lresult for the accessibility object cannot be obtained.
sr: Lresult для объекта специальных возможностей получить нельзя.

# RichTextBoxAutoWordSelection
source: Turns on/off automatic word selection.
sr: Включает/Отключает автоматический выбор слов.

# RichTextBoxBulletIndent
source: Defines the indent for the bullets in the control.
sr: Определяет отступ для маркеров абзацев в данном элементе управления.

# RichTextBoxCanRedoDescr
source: Indicates if the rich edit control can redo the previous action.
sr: Указывает, возможна ли отмена предыдущего действия элементом управления расширенного редактирования.

# RichTextBoxContentsResized
source: Occurs when the control's contents are either smaller or larger than the control's window size.
sr: Происходит, когда содержимое элемента управления отличается по размерам от размера окна элемента управления.

# RichTextBoxDetectURLs
source: Indicates whether URLs are automatically formatted as links.
sr: Включает/Отключает автоматическое выделение URL-адреса.

# RichTextBoxEnableAutoDragDrop
source: Enable drag/drop of text, pictures, and other data
sr: Включает режим перетаскивания мышью текста, рисунков и других данных.

# RichTextBoxHScroll
source: Occurs when the control's horizontal scroll bar is clicked.
sr: Происходит при щелчке кнопкой мыши на горизонтальной полосе прокрутки элемента управления.

# RichTextBoxIMEChange
source: Occurs when the control's IME conversion status changes. (East Asian versions of OS only.)
sr: Возникает при изменении состояния преобразования IME данного элемента управления. (Только в азиатских версиях ОС.)

# RichTextBoxLinkClick
source: Occurs when a hyperlink in the text is clicked.
sr: Возникает при щелчке левой кнопкой мыши гиперссылки в тексте.

# RichTextBoxProtected
source: Occurs when the user takes an action that would change a protected range of text.
sr: Происходит, когда пользователь выполняет действие, которое может изменить защищенную часть текста.

# RichTextBoxRTF
source: Defines the rich text-formatted contents of the control.
sr: Определяет содержимое элемента управления как RTF.

# RichTextBoxRedoActionNameDescr
source: The name of the action that will be performed if the user redoes a previous action.
sr: Название действия, которое выполняется, если пользователь повторяет предыдущее действие.

# RichTextBoxRightMargin
source: Defines the right margin dimensions.
sr: Определяет размеры правого поля.

# RichTextBoxScrollBars
source: Defines the behavior of the scroll bars of the control.
sr: Определяет поведение полос прокрутки данного элемента управления.

# RichTextBoxSelAlignment
source: Defines the alignment of the currently selected text.
sr: Задает выравнивание выделенного в текущий момент текста.

# RichTextBoxSelBackColor
source: Sets the text color for the currently selected text.
sr: Задает цвет для выбранного в текущий момент текста.

# RichTextBoxSelBullet
source: Turns on/off the bullets in front of the currently selected text.
sr: Включает/Отключает маркеры абзацев перед выделенным в текущий момент текстом.

# RichTextBoxSelChange
source: Occurs when the current selection has changed.
sr: Происходит после изменения текущего выбора.

# RichTextBoxSelCharOffset
source: Defines the superscript/subscript mode for the characters.
sr: Задает для текста режим верхних/нижних индексов.

# RichTextBoxSelColor
source: Sets the text color for the currently selected text.
sr: Задает цвет для выбранного в текущий момент текста.

# RichTextBoxSelFont
source: Defines the font of the currently selected text.
sr: Задает шрифт выделенного в текущий момент текста.

# RichTextBoxSelHangingIndent
source: Defines the hanging indent of the currently selected text.
sr: Задает выступ для выделенного в текущий момент текста.

# RichTextBoxSelIndent
source: Defines the indent of the currently selected text.
sr: Задает отступ для выделенного в текущий момент текста.

# RichTextBoxSelMargin
source: Turns on/off the selection margin.
sr: Включает/Отключает поле при выделении.

# RichTextBoxSelProtected
source: Turns on/off protection around the contents of the currently selected text.
sr: Включает/Отключает защиту содержимого выделенного в текущий момент текста.

# RichTextBoxSelRTF
source: Defines the rich text formatted contents of the currently selected text.
sr: Задает содержимое выделенного в текущий момент текста как RTF.

# RichTextBoxSelRightIndent
source: Defines the right-indent of the currently selected text.
sr: Задает отступ справа для выделенного в текущий момент текста.

# RichTextBoxSelTabs
source: Defines the locations of tab stops in the currently selected text.
sr: Задает конечные положения символов табуляции для выделенного в текущий момент текста.

# RichTextBoxSelText
source: Displays the currently selected text in the control.
sr: Отображает текст, выделенный в текущий момент в элементе управления.

# RichTextBoxSelTypeDescr
source: The type of selection.
sr: Тип выбора.

# RichTextBoxUndoActionNameDescr
source: The name of the action that will be performed if the user undoes a previous edit.
sr: Название действия, которое выполняется, если пользователь отменяет предыдущую операцию редактирования.

# RichTextBoxVScroll
source: Occurs when the control's vertical scroll bar is clicked.
sr: Происходит при щелчке кнопки мыши на вертикальной полосе прокрутки элемента управления.

# RichTextBoxZoomFactor
source: Defines the current scaling factor of the RichTextBox display; 1.0 is normal viewing.
sr: Задает текущий масштабный коэффициент отображения RichTextBox; 1,0 соответствует отображению без масштабирования.

# RichTextBox_IDCut
source: Cut
sr: Вырезать

# RichTextBox_IDDelete
source: Delete
sr: Удалить

# RichTextBox_IDDragDrop
source: Drag and Drop
sr: Перетаскивание

# RichTextBox_IDPaste
source: Paste
sr: Вставить

# RichTextBox_IDTyping
source: Typing
sr: Ввод с клавиатуры

# RichTextBox_IDUnknown
source: Unknown
sr: Неизвестно

# RichTextFindEndInvalid
source: Value '{0}' is not a valid value for 'end'. 'end' must be greater than or equal to 'start', or -1.
sr: Значение {0} недопустимо для параметра end. Значение end должно быть больше или равно значению start или равно -1.

# SaveFileDialogCreatePrompt
source: Controls whether to prompt the user when a new file is about to be created. It is only applicable if 'ValidateNames' is set to true.
sr: Определяет, получает ли пользователь запрос перед созданием нового файла. Действует только в том случае, если ValidateNames имеет значение true (истина).

# SaveFileDialogOverWritePrompt
source: Controls whether to prompt the user when an existing file is about to be overwritten. It is only applicable if 'ValidateNames' is set to true.
sr: Определяет, получает ли пользователь запрос перед перезаписью существующего файла. Действует только в том случае, если ValidateNames имеет значение true (истина).

# SaveTextError
source: Text is not saved.
sr: Текст не сохранен.

# ScrollBarEnableDescr
source: Gets or sets a Boolean value controlling whether the scrollbar is enabled.
sr: Получает или задает логическое значение, определяющее, будет ли данная полоса прокрутки активной.

# ScrollBarLargeChangeDescr
source: The amount by which the scroll box position changes when the user clicks in the scroll bar or presses the PAGE UP or PAGE DOWN keys.
sr: Изменение положения ползунка при щелчке мышью на полосе прокрутки или при нажатии клавиши PgUp/PgDn.

# ScrollBarMaximumDescr
source: The upper limit value of the scrollable range.
sr: Положение ползунка полосы прокрутки, соответствующее максимуму.

# ScrollBarMinimumDescr
source: The lower limit value of the scrollable range.
sr: Положение ползунка полосы прокрутки, соответствующее минимуму.

# ScrollBarOnScrollDescr
source: Occurs when the user moves the scroll box.
sr: Возникает при перемещении ползунка полосы прокрутки.

# ScrollBarSmallChangeDescr
source: The amount by which the scroll box position changes when the user clicks a scroll arrow or presses an arrow key.
sr: Изменение положения ползунка полосы прокрутки при щелчке мышью на одной из стрелок или при нажатии клавиши со стрелкой.

# ScrollBarValueDescr
source: The value that the scroll box position represents.
sr: Положение ползунка полосы прокрутки.

# ScrollBarVisibleDescr
source: Gets or sets a Boolean value controlling whether the scrollbar is showing.
sr: Получает или задает логическое значение, определяющее, будет ли отображаться данная полоса прокрутки.

# ScrollableControlHorizontalScrollDescr
source: Gets the horizontal scroll bar for this ScrollableControl.
sr: Получает горизонтальную полосу прокрутки для данного ScrollableControl.

# ScrollableControlRaiseMouseEnterLeaveEventsForScrollBarsDescr
source: Property being set to false will not raise MouseEnter and MouseLeave events until the mouse leaves the client area and the scrollbars.
sr: Если значение свойства равно false, то оно не будет порождать события MouseEnter и MouseLeave, пока указатель мыши не выйдет за пределы клиентской области и полос прокрутки.

# ScrollableControlVerticalScrollDescr
source: Gets the vertical scroll bar for this ScrollableControl.
sr: Получает вертикальную полосу прокрутки для данного ScrollableControl.

# SelTabCountRange
source: SelTabCount out of range.
sr: SelTabCount вне допустимого диапазона.

# SelectedNotEqualActual
source: Number of selected items does not match actual selected items.
sr: Число выбранных элементов не соответствует фактическому числу выбранных элементов.

# SendKeysGroupDelimError
source: Group delimiters are not balanced.
sr: Несоответствие между числом групп и разделителей.

# SendKeysHookFailed
source: Hook cannot be created.
sr: Ловушку создать нельзя.

# SendKeysKeywordDelimError
source: Keyword delimiter is missing.
sr: Разделитель ключевых слов отсутствует.

# SendKeysNestingError
source: Only three levels of nesting are supported.
sr: Поддерживается только три уровня вложенности.

# SendKeysNoMessageLoop
source: SendKeys cannot run inside this application because the application is not handling Windows messages. Either change the application to handle messages, or use the SendKeys.SendWait method.
sr: SendKeys не может выполняться в рамках этого приложения, так как приложение не обрабатывает сообщения Windows. Измените приложение, так чтобы оно обрабатывало сообщения, или используйте метод SendKeys.SendWait.

# SerializationException
source: Type {0} could not be read from the data in line {1}, position {2}. The type's internal structure may have changed. Either implement ISerializable on the type or provide a type converter that can provide a more reliable conversion format, such as text or an array of bytes. The conversion exception was: {3}
sr: Тип {0} не может быть прочитан из данных в строке {1}, позиции {2}. Внутренняя структура типа могла быть изменена. Либо примените ISerializable для данного типа, либо предоставьте преобразователь типов, обеспечивающий более надежный формат преобразования, например, текст или массив байтов. Возникло исключение при преобразовании: {3}

# ShowDialogOnDisabled
source: Forms that are not enabled cannot be displayed as a modal dialog box. Set the form's enabled property to true before calling {0}.
sr: Неактивные формы нельзя отображать, как модальные диалоговые окна. Установите свойство активности данной формы равным true перед вызовом {0}.

# ShowDialogOnModal
source: Form that is already displayed modally cannot be displayed as a modal dialog box. Close the form before calling {0}.
sr: Форму, уже отображенную модально, нельзя отобразить как модальное диалоговое окно. Закройте эту форму перед вызовом {0}.

# ShowDialogOnNonTopLevel
source: Form that is not a top-level form cannot be displayed as a modal dialog box. Remove the form from any parent form before calling {0}.
sr: Форму, не являющуюся формой верхнего уровня, нельзя отобразить как модальное диалоговое окно. Удалите эту форму из всех родительских форм перед вызовом {0}.

# ShowDialogOnVisible
source: Form that is already visible cannot be displayed as a modal dialog box. Set the form's visible property to false before calling {0}.
sr: Форму, уже отображенную, нельзя отобразить как модальное диалоговое окно. Установите свойство видимости данной формы равным false перед вызовом {0}.

# SortRequiresIBindingList
source: Sorting requires an IBindingList that supports sorting or an IBindingListView that supports advanced sorting.
sr: Для сортировки нужен элемент IBindingList, поддерживающий сортировку, или IBindingListView, поддерживающий расширенную сортировку.

# SortedAscendingAccessibleStatus
source: Sorted ascending.
sr: Отсортировано по возрастанию.

# SortedDescendingAccessibleStatus
source: Sorted descending.
sr: Отсортировано по убыванию.

# SpinnerAccessibleName
source: Spinner
sr: Вертушка

# SplitContainerFixedPanelDescr
source: Indicates that a particular SplitContainer's Panel should remain fixed in size during resize events.
sr: Указывает, что конкретная панель элемента SplitContainer должна сохранять свои размеры при изменениях размера.

# SplitContainerIsSplitterFixedDescr
source: Determines if the splitter can move.
sr: Определяет, может ли разделитель перемещаться.

# SplitContainerOrientationDescr
source: Determines if the splitter is vertical or horizontal.
sr: Определяет, будет ли разделитель вертикальным или горизонтальным.

# SplitContainerPanel1CollapsedDescr
source: This determines if Panel1 is collapsed.
sr: Определяет, свернута ли Panel1.

# SplitContainerPanel1Descr
source: The Left or Top panel in the SplitContainer.
sr: Панели Left или Top в SplitContainer.

# SplitContainerPanel1MinSizeDescr
source: Determines the minimum distance of pixels of the splitter from the left or the top edge of Panel1.
sr: Определяет минимальное расстояние в пикселях от разделителя до левого или верхнего края Panel1.

# SplitContainerPanel2CollapsedDescr
source: This determines if Panel2 is collapsed.
sr: Определяет, свернута ли Panel2.

# SplitContainerPanel2Descr
source: The Right or Bottom panel in the SplitContainer.
sr: Панели Right или Bottom в SplitContainer.
