Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# ListBoxHorizontalExtentDescr
source: The width, in pixels, by which a list box can be scrolled horizontally. Only valid if HorizontalScrollBars is true.
sr: Ширина (в пикселях), вдоль которой может осуществляться горизонтальная прокрутка окна списка. Действительно, только если HorizontalScrollBars имеет значение true.

# ListBoxHorizontalScrollbarDescr
source: Indicates whether the ListBox will display a horizontal scroll bar for items beyond the right edge of the ListBox.
sr: Указывает, должна ли в ListBox отображаться горизонтальная полоса прокрутки для элементов, выходящих за правый край ListBox.

# ListBoxIntegralHeightDescr
source: Indicates whether the list can contain only complete items.
sr: Указывает, должен ли список содержать только полные элементы.

# ListBoxInvalidSelectionMode
source: Cannot call this method when SelectionMode is SelectionMode.NONE.
sr: Вызов этого метода невозможен, если SelectionMode имеет значение SelectionMode.NONE.

# ListBoxItemHeightDescr
source: The height, in pixels, of items in a fixed-height owner-draw list box.
sr: Высота элементов (в пикселях) в отображаемом владельцем списке фиксированной высоты.

# ListBoxItemOverflow
source: List box contains too many items.
sr: Окно списка содержит слишком много элементов.

# ListBoxItemsDescr
source: The items in the list box.
sr: Элементы в данном списке.

# ListBoxMultiColumnDescr
source: Indicates if values should be displayed in columns horizontally.
sr: Указывает, должны ли значения отображаться в столбцах горизонтально.

# ListBoxPreferredHeightDescr
source: The preferred height of this control.
sr: Предпочтительная высота данного элемента управления.

# ListBoxScrollIsVisibleDescr
source: Indicates if the list box should always have a scroll bar present, regardless of how many items are in it.
sr: Указывает, должен ли список всегда содержать полосу прокрутки вне зависимости от числа элементов в нем.

source: ListBox.SelectedIndexCollection is read only.
sr: ListBox.SelectedIndexCollection предназначается только для чтения.

# ListBoxSelectedIndexDescr
source: Retrieves the index of the first selection in the list box, or -1 if there is no selection.
sr: Считывает индекс первого выбранного пункта в списке или значение -1, если выбор отсутствует.

# ListBoxSelectedIndicesDescr
source: A collection of indexes for the currently selected items in the list box.
sr: Коллекция индексов для выбранных в данный момент элементов списка.

# ListBoxSelectedItemDescr
source: The currently selected item in the list box, or null.
sr: Текущий выбранный элемент списка или неопределенное значение.

# ListBoxSelectedItemsDescr
source: A collection of currently selected items.
sr: Коллекция выбранных в данный момент элементов.

source: ListBox.SelectedObjectCollection is read only.
sr: ListBox.SelectedObjectCollection предназначается только для чтения.

# ListBoxSelectionModeDescr
source: Indicates if the list box is to be single-select, multi-select, or not selectable.
sr: Указывает, сколько элементов можно выбрать в окне списка (один, несколько или ни одного).

# ListBoxSortedDescr
source: Controls whether the list is sorted.
sr: Управляет тем, сохраняется ли список.

# ListBoxTopIndexDescr
source: The index of the first visible item in the list box.
sr: Индекс первого видимого в списке элемента.

# ListBoxUseTabStopsDescr
source: Indicates if TAB characters should be expanded into full spacing.
sr: Указывает, должны ли символы TAB расширяться до полных интервалов.

# ListBoxVarHeightMultiCol
source: ListBox cannot have variable height and be multicolumn. Either make the ListBox owner-draw fixed height, or make the ListBox single column.
sr: ListBox не может иметь переменную высоту и содержать несколько столбцов. ListBox должен быть списком фиксированной высоты, прорисовываемым владельцем, или содержать один столбец.

# ListControlDataSourceDescr
source: Indicates the list that this control will use to get its items.
sr: Указывает список, из которого данный элемент управления будет считывать элементы.

# ListControlDisplayMemberDescr
source: Indicates the property to display for the items in this control.
sr: Указывает свойство отображения элементов списка в данном элементе управления.

# ListControlEmptyValueMemberInSettingSelectedValue
source: Cannot set the SelectedValue in a ListControl with an empty ValueMember.
sr: Невозможно задать SelectedValue в ListControl с пустым ValueMember.

# ListControlFormatDescr
source: Event raised to allow you to convert the value to a value suitable for display.
sr: Событие возникает, чтобы позволить пользователю привести значение к значению, удобному для отображения.

# ListControlFormatInfoChangedDescr
source: Event raised when the value of the FormatInfo property changed.
sr: Событие возникает при изменении значения свойства FormatInfo.

# ListControlFormatStringChangedDescr
source: Event raised when the value of the FormatString property is changed.
sr: Событие возникает при изменении значения свойства FormatString.

# ListControlFormatStringDescr
source: The format specifier characters that indicate how a value is to be displayed.
sr: Символы спецификатора формата, определяющие отображение значения.

# ListControlFormattingEnabledChangedDescr
source: Event raised when the value of the FormattingEnabled property is changed.
sr: Событие возникает при изменении значения свойства FormattingEnabled.

# ListControlFormattingEnabledDescr
source: If this property is true, the value of FormatString is used to convert the value of DisplayMember into a value that can be displayed.
sr: Если данное свойство принимает значение true, значение FormatString используется для приведения значения DisplayMember к значению, удобному для отображения.

# ListControlOnDataSourceChangedDescr
source: Event raised when the value of the DataSource property is changed on ListControl.
sr: Событие возникает при изменении в ListControl значения свойства DataSource.

# ListControlOnDisplayMemberChangedDescr
source: Event raised when the value of the DisplayMember property is changed on ListControl.
sr: Событие возникает при изменении в ListControl значения свойства DisplayMember.

# ListControlOnSelectedValueChangedDescr
source: Event raised when the value of the SelectedValue property is changed on ListControl.
sr: Событие возникает при изменении в ListControl значения свойства SelectedValue.

# ListControlOnValueMemberChangedDescr
source: Event raised when the value of the ValueMember property is changed on ListControl.
sr: Событие возникает при изменении в ListControl значения свойства ValueMember.

# ListControlSelectedValueDescr
source: Indicates the actual value of the currently selected item. Setting it will cause the item whose actual value is equal to become selected.
sr: Определяет действительное значение элемента, выбранного в данный момент. При задании этого значения будет выбран элемент, действительное значение которого равно заданному.

# ListControlValueMemberDescr
source: Indicates the property to use as the actual value for the items in the control.
sr: Указывает свойство для использования в качестве фактического значения для элементов в данном элементе управления.

# ListControlWrongDisplayMember
source: Cannot bind to the new display member.
sr: Привязка к новому члену отображения невозможна.

# ListControlWrongValueMember
source: Cannot bind to the new value member.
sr: Привязка к новому члену значения невозможна.

# ListEnumCurrentOutOfRange
source: Enumerator's current position is out of the bounds of the list.
sr: Текущее положение перечислителя выходит за пределы списка.

# ListEnumVersionMismatch
source: List that this enumerator is bound to has been modified. An enumerator can only be used if the list does not change.
sr: Список, к которому привязан данный перечислитель, был изменен. Перечислитель может использоваться, только если список не изменяется.

# ListManagerBadPosition
source: Position is either less than 0 or greater than the number of items in the data source.
sr: Позиция либо меньше 0, либо превышает число элементов в источнике данных.

# ListManagerEmptyList
source: Cannot operate with an empty list.
sr: Невозможно работать с пустым списком.

# ListManagerNoValue
source: Index {0} does not have a value.
sr: Индексу {0} не присвоено значение.

# ListManagerSetDataSource
source: Data sources of type {0} are not supported.
sr: Источники данных типа {0} не поддерживаются.

# ListViewActivationDescr
source: Indicates the type of action required by the user to activate an item, and the feedback given.
sr: Указывает тип действия, запрашиваемого пользователем для активации элемента, и заданную обратную связь.

# ListViewActivationMustBeOnWhenHotTrackingIsOn
source: When HotTracking is on, activation must be ItemActivation.OneClick.
sr: Если HotTracking подключен, активация должна быть ItemActivation.OneClick.

# ListViewAddColumnFailed
source: Column cannot be added to ListView.
sr: Добавление столбца к ListView не допускается.

# ListViewAddItemFailed
source: Item cannot be added to ListView.
sr: Добавление элементов к ListView не допускается.

# ListViewAfterLabelEditDescr
source: Occurs when the text of an item has been edited by the user.
sr: Происходит после редактирования текста элемента пользователем.

# ListViewAlignmentDescr
source: Indicates how items are aligned within the ListView.
sr: Указывает способ выравнивания элементов в ListView.

# ListViewAllowColumnReorderDescr
source: Indicates whether the user can reorder columns in Details view.
sr: Указывает, может ли пользователь изменить порядок столбцов в представлении Details.

# ListViewAutoArrangeDescr
source: Indicates whether items are kept arranged automatically when in LargeIcon or SmallIcon view.
sr: Указывает, поддерживается ли автоматическое упорядочение элементов в представлении LargeIcon или SmallIcon.

# ListViewBackgroundImageTiledDescr
source: Indicates whether the background image will be tiled to fill the entire background of the control.
sr: Указывает, используется ли мозаичное заполнение фоновым изображением для полного покрытия фона элемента управления.

# ListViewBadListViewSubItem
source: Parameter must be of type ListViewSubItem.
sr: Параметр должен иметь тип ListViewSubItem.

# ListViewBeforeLabelEditDescr
source: Occurs when the text of an item is about to be edited by the user.
sr: Происходит непосредственно перед редактированием текста элемента пользователем.

# ListViewBeginEditFailed
source: BeginEdit did not succeed because the LabelEdit property is false.
sr: Ошибка BeginEdit: свойство LabelEdit имеет значение false.

# ListViewCacheVirtualItemsEventDescr
source: Notifies users of virtual ListView controls that they should prepare their cache.
sr: Оповещает пользователей виртуальных элементов управления ListView о том, что они должны подготовить кэш.

# ListViewCantAccessCheckedItemsCollectionWhenInVirtualMode
source: Cannot access the checked items collection when the ListView is in virtual mode.
sr: Если ListView находится в виртуальном режиме, доступ к коллекции элементов с установленным флажком невозможен.

# ListViewCantAccessSelectedItemsCollectionWhenInVirtualMode
source: Cannot access the selected items collection when the ListView is in virtual mode.
sr: Если ListView находится в виртуальном режиме, доступ к выбранным элементам невозможен.

# ListViewCantAddItemsToAVirtualListView
source: When the ListView is in virtual mode, you cannot add items to the ListView items collection. Use the VirtualListSize property instead to change the size of the ListView items collection.
sr: Если ListView находится в виртуальном режиме, добавление элементов в коллекцию элементов ListView невозможно. Вместо этого используйте свойство VirtualListSize, чтобы изменить размер коллекции элементов ListView.

# ListViewCantGetEnumeratorInVirtualMode
source: When the ListView is in virtual mode, you cannot enumerate through the ListView items collection using an enumerator or call GetEnumerator. Use the ListView items indexer instead and access an item by index value.
sr: Если ListView находится в виртуальном режиме, перечисление в коллекции элементов ListView с помощью перечислителя или вызова GetEnumerator невозможно. Вместо этого следует использовать индексатор элементов ListView и обращаться к элементу с помощью значения индекса.

# ListViewCantModifyTheItemCollInAVirtualListView
source: Cannot modify the items collection in a virtual ListView.
sr: Изменение коллекции элементов в виртуальном ListView невозможно.

# ListViewCantRemoveItemsFromAVirtualListView
source: When the ListView is in virtual mode, you cannot remove items from the ListView items collection. Use the VirtualListSize property instead to change the size of the ListView items collection.
sr: Если ListView находится в виртуальном режиме, удаление элементов из коллекции элементов ListView невозможно. Вместо этого используйте свойство VirtualListSize, чтобы изменить размер коллекции элементов ListView.

# ListViewCantSetViewToTileViewInVirtualMode
source: Tile view is not supported in VirtualMode.
sr: Представление Tile не поддерживается в режиме VirtualMode.

# ListViewCantSetVirtualModeWhenInTileView
source: VirtualMode is not supported in Tile view.
sr: VirtualMode не поддерживается в представлении Tile.

# ListViewCheckBoxesDescr
source: Indicates whether check boxes are displayed beside items.
sr: Указывает, отображаются ли флажки проверки рядом с элементами.

# ListViewCheckBoxesNotSupportedInTileView
source: CheckBoxes are not supported in Tile view. Choose a different view or set CheckBoxes to false.
sr: CheckBoxes не поддерживается в представлении Tile. Выберите другое представление либо установите для CheckBoxes значение false.

# ListViewColumnClickDescr
source: Occurs when a column header is clicked.
sr: Происходит при выборе заголовка столбца.

# ListViewColumnInfoSet
source: ColumnInfo cannot be set.
sr: Невозможно задать ColumnInfo.

# ListViewColumnReorderedDscr
source: Occurs when the ListView column header has been reordered.
sr: Возникает при реорганизации заголовка столбца ListView.

# ListViewColumnWidthChangedDscr
source: Occurs when the user stops dragging the column header divider. Works only in Details mode.
sr: Возникает при завершении перетаскивания разделителя заголовков столбцов. Действует только в режиме Details.

# ListViewColumnWidthChangingDscr
source: Occurs when the user drags the column header divider. Works only in Details mode.
sr: Возникает при перетаскивании разделителя заголовков столбцов. Действует только в режиме Details.

# ListViewColumnsDescr
source: The columns shown in Details view.
sr: Столбцы, отображаемые в представлении Details.

# ListViewDrawColumnHeaderEventDescr
source: Occurs in owner draw mode, when a column header needs to be drawn.
sr: Возникает в режиме прорисовки владельца, когда требуется прорисовка заголовка столбца.

# ListViewDrawItemEventDescr
source: Occurs in owner-draw mode, when an item needs to be drawn.
sr: Возникает в режиме прорисовки владельца, когда требуется прорисовка элемента.

# ListViewDrawSubItemEventDescr
source: Occurs in owner-draw mode, when a SubItem (Details view only) needs to be drawn.
sr: Возникает в режиме прорисовки владельца, когда требуется прорисовка SubItem (только в представлении Details).

# ListViewFindNearestItemWorksOnlyInIconView
source: FindNearestItem is supported only when the ListView is in SMALLICON or LARGEICON view.
sr: FindNearestItem поддерживается, только когда для ListView используется представление SMALLICON или LARGEICON.

# ListViewFocusedItemDescr
source: The ListView item that currently has the user focus.
sr: Текущий элемент ListView, на который пользователь переключил фокус.

# ListViewFullRowSelectDescr
source: Indicates whether all SubItems are highlighted along with the item when selected.
sr: Указывает, выделяются ли при выборе элемента все подэлементы.

# ListViewGetTopItem
source: Cannot get the top item in LargeIcon, SmallIcon, or Tile view.
sr: Получение верхнего элемента в представлениях LargeIcon, SmallIcon или Tile невозможно.

# ListViewGridLinesDescr
source: Displays grid lines around items and SubItems. Only shown when in Details view.
sr: Отображает линии сетки вокруг элементов и подэлементов. Действует только в представлении Details.

# ListViewGroupCollectionBadListViewGroup
source: Parameter must be of type ListViewGroup.
sr: Параметр должен иметь тип ListViewGroup.

# ListViewGroupDefaultGroup
source: Default
sr: По умолчанию

# ListViewGroupNameDescr
source: The name of this group.
sr: Имя данной группы.

# ListViewGroupsDescr
source: The groups in the ListView.
sr: Группы в ListView.

# ListViewHeaderStyleDescr
source: The style of the column headers in Details view.
sr: Стиль заголовков столбцов в представлении Details.

# ListViewHideSelectionDescr
source: Removes highlighting from the selected item when the control does not have focus.
sr: Снимает выделение выбранного элемента, когда данный элемент управления не находится в фокусе.

# ListViewHotTrackingDescr
source: Allows items to appear as hyperlinks when the mouse hovers over them.
sr: Позволяет отображение элементов в виде гиперссылок при наведении на них указателя мыши.

# ListViewHoverMustBeOnWhenHotTrackingIsOn
source: When HotTracking is on, HoverSelection must also be enabled.
sr: Если активировано HotTracking, HoverSelection также должно быть активировано.

# ListViewHoverSelectDescr
source: Allows items to be selected by hovering over them with the mouse.
sr: Позволяет выбирать элементы путем задержки над ними курсора мыши.

# ListViewIndentCountCantBeNegative
source: IndentCount property on the ListViewItem class does not accept negative values.
sr: Свойство IndentCount для класса ListViewItem не может принимать отрицательные значения.

# ListViewInsertionMarkDescr
source: Allows insertion mark attributes to be changed.
sr: Позволяет изменение атрибутов метки вставки.

# ListViewItemCheckedDescr
source: Event raised when the checked property of a ListView item changes.
sr: Событие возникает при изменении отмеченного свойства элемента ListView.

# ListViewItemClickDescr
source: Occurs when an item is activated.
sr: Происходит при активации элемента.

# ListViewItemDragDescr
source: Occurs when the user begins dragging an item.
sr: Происходит, когда пользователь начинает перетаскивать элемент с помощью мыши.

# ListViewItemImageIndexDescr
source: The ImageList index value of the image displayed when the list view item is in the unselected state.
sr: Значение индекса ImageList изображения, отображаемого при невыбранном состоянии элемента представления списка.

# ListViewItemImageKeyDescr
source: The key in the image-list value that represents the image to display. when the list view item is in the unselected state.
sr: Ключ в значении списка изображений, соответствующем изображению, отображаемому при невыбранном состоянии элемента представления списка.

# ListViewItemIndentCountDescr
source: Number of indents for a list ListViewItem
sr: Число отступов для списка ListViewItem

# ListViewItemMouseHoverDescr
source: Occurs when the mouse hovers over an item.
sr: Происходит при наведении курсора мыши на элемент.

# ListViewItemSelectionChangedDescr
source: Event raised when the selection state of an item has changed.
sr: Событие происходит при изменении выбранного состояния элемента.

# ListViewItemSorterDescr
source: The sorting comparer for this view.
sr: Блок сравнения сортировки для этого представления.

# ListViewItemStateImageIndexDescr
source: The image-list index value of the state image displayed.
sr: Значение индекса списка изображений отображаемого изображения.

# ListViewItemStateImageKeyDescr
source: The key in the image-list value that represents the image to display.
sr: Ключ в значении списка изображений, соответствующем отображаемому изображению.

# ListViewItemSubItemsDescr
source: The SubItems for this ListViewItem.
sr: Свойство SubItems для этого ListViewItem.

# ListViewItemsDescr
source: The items in the ListView.
sr: Элементы в ListView.

# ListViewLabelEditDescr
source: Allows item labels to be edited in place by the user.
sr: Позволяет пользователям редактировать подписи элементов непосредственно в их позициях.

# ListViewLabelWrapDescr
source: Determines whether label text can wrap to a new line.
sr: Определяет, разрешен ли перенос текста подписи на новую строку.

# ListViewLargeImageListDescr
source: The ImageList control used by the ListView for images in Large Icon View.
sr: Элемент управления ImageList, который ListView использует для изображений в режиме крупных значков.

# ListViewMultiSelectDescr
source: Allows multiple items to be selected.
sr: Позволяет выбирать несколько элементов.

# ListViewOwnerDrawDescr
source: Controls whether the system or the user paints items/SubItems.
sr: Управляет прорисовкой элементов/подэлементов системой или пользователем.

# ListViewRetrieveVirtualItemEventDescr
source: Retrieves the virtual item from the user.
sr: Извлекает для пользователя виртуальный элемент.

# ListViewScrollableDescr
source: Indicates whether the control will display scroll bars if it contains more items than can fit in the client area.
sr: Указывает, будут ли в элементе управления отображаться полосы прокрутки, если он содержит больше элементов, чем помещается в клиентскую область.

# ListViewSearchForVirtualItemDescr
source: Notifies the user that a search is taking place on a virtual ListView.
sr: Сообщает пользователю о поиске, производимом для виртуального ListView.

# ListViewSelectedIndexChangedDescr
source: Occurs whenever the 'SelectedIndex' property for this ListView changes.
sr: Происходит при каждом изменении свойства SelectedIndex этого ListView.

# ListViewSelectedItemsDescr
source: A collection of items that are currently selected in the ListView.
sr: Коллекция элементов, выбранных в данный момент в ListView.

# ListViewSetTopItem
source: Cannot set the TopItem in LargeIcon, SmallIcon, or Tile View.
sr: Невозможно задать TopItem в представлениях LargeIcon, SmallIcon или Tile.

# ListViewShowGroupsDescr
source: Indicates whether the control will display the items in group form.
sr: Указывает, будет ли элемент управления отображать элементы в форме группы.

# ListViewShowItemToolTipsDescr
source: Allows ListViewItems to display ToolTips.
sr: Позволяет ListViewItems отображать подсказки.

# ListViewSmallImageListDescr
source: The ImageList control used by the ListView for images in all views except for the large icon view.
sr: Элемент управления ImageList, который ListView использует для изображений во всех представлениях, кроме представления в режиме крупных значков.

# ListViewSortNotAllowedInVirtualListView
source: Sorting is not allowed in a virtual ListView.
sr: Сортировка в виртуальном ListView не допускается.

# ListViewSortingDescr
source: Indicates the manner in which items are to be sorted.
sr: Указывает, каким образом должны быть отсортированы элементы.

# ListViewStartIndexCannotBeLargerThanEndIndex
source: The startIndex value cannot be larger than the endIndex value.
sr: Значение startIndex не может превышать значение endIndex.

# ListViewStateImageListDescr
source: The ImageList control used by the ListView for custom states.
sr: Элемент управления ImageList, который ListView использует для особых состояний.

# ListViewSubItemCollectionInvalidArgument
source: Argument must be of type ListViewSubItem.
sr: Аргумент должен иметь тип ListViewSubItem.

# ListViewTileSizeDescr
source: The size of the tile in Tile view.
sr: Размер элемента мозаичного изображения в представлении Tile.

# ListViewTileSizeMustBePositive
source: TileSize must be positive.
sr: Значение TileSize должно быть положительным.
