Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# WebBrowserNavigateAbsoluteUri
source: Navigation to a relative URL unsuccessful.
sr: Переход по соответствующему адресу URL невозможен.

# WebBrowserNavigatedDescr
source: Occurs after WebBrowser navigation occurs.
sr: Возникает после навигации в веб-браузере.

# WebBrowserNavigatingDescr
source: Occurs before WebBrowser navigation occurs.
sr: Возникает перед навигацией в веб-браузере.

# WebBrowserNewWindowDescr
source: Occurs when a new window is created for the WebBrowser.
sr: Возникает при создании нового окна для веб-браузера.

# WebBrowserNoCastToIWebBrowser2
source: IWebBrowser2 get from the native ActiveX control did not succeed.
sr: Не удалось получить IWebBrowser2 от собственного элемента управления ActiveX.

# WebBrowserObjectForScriptingComVisibleOnly
source: ObjectForScripting's class must be visible to COM. Verify that the object is public, or consider adding the ComVisible attribute to your class.
sr: Класс ObjectForScripting должен быт виден для COM. Проверьте, открыт ли данный объект, или добавьте атрибут ComVisible к вашему классу.

# WebBrowserProgressChangedDescr
source: Occurs when an update to the progress of a download occurs.
sr: Происходит при изменении состояния процесса скачивания.

# WebBrowserRightToLeftNotSupported
source: The WebBrowser control does not support the RightToLeft property.
sr: Элемент управления "Веб-браузер" не поддерживает свойство RightToLeft.

# WebBrowserScriptErrorsSuppressedDescr
source: Specifies whether the WebBrowser control shows script errors in dialogs boxes.
sr: Определяет, будет ли элемент управления "Веб-браузер" показывать диалоговые окна с сообщениями об ошибках скриптов.

# WebBrowserScrollBarsEnabledDescr
source: Specifies whether the WebBrowser control should have scrollbars or not.
sr: Определяет, будут ли у элемента управления "Веб-браузер" полосы прокрутки.

# WebBrowserSecurityLevelDescr
source: The level of security permissions the hosted documents are granted.
sr: Уровень прав доступа, предоставляемый запрошенным документам.

# WebBrowserStatusTextChangedDescr
source: Occurs whenever the status text changes.
sr: Происходит при изменении текста состояния.

# WebBrowserTextNotSupported
source: The WebBrowser control does not support the Text property.
sr: Элемент управления "Веб-браузер" не поддерживает свойство Text.

# WebBrowserUrlDescr
source: Specifies the URL that the Web browser control has navigated to.
sr: Задает адрес URL, на который перешел элемент управления "Веб-браузер".

# WebBrowserUseWaitCursorNotSupported
source: The WebBrowser control does not support the UseWaitCursor property.
sr: Элемент управления WebBrowser не поддерживает свойство UseWaitCursor.

# WebBrowserWebBrowserShortcutsEnabledDescr
source: Specifies whether some accelerator keys are enabled in the WebBrowser control.
sr: Задает некоторые сочетания клавиш для элемента WebBrowser.

# WidthGreaterThanMinWidth
source: Width must be greater than MinWidth.
sr: Значение ширины должно быть больше MinWidth.

# Win32WindowAlreadyCreated
source: SetCompatibleTextRenderingDefault must be called before the first IWin32Window object is created in the application.
sr: До создания первого объекта IWin32Window в приложении необходимо вызвать SetCompatibleTextRenderingDefault.

# WindowsFormsSetEvent
source: Setting event '{0}'
sr: Задание события '{0}'

# borderStyleDescr
source: The border style of the control.
sr: Стиль границы элемента управления.

# collectionChangedEventDescr
source: Occurs whenever this collection's membership changes.
sr: Происходит при каждом изменении принадлежности этой коллекции.

# collectionChangingEventDescr
source: Occurs whenever this collection's membership is about to change.
sr: Возникает перед изменением состава коллекции.

# drawItemEventDescr
source: Occurs whenever a particular item/area needs to be painted.
sr: Происходит при необходимости прорисовать определенный элемент/область.

# measureItemEventDescr
source: Occurs whenever a particular item's height needs to be calculated.
sr: Происходит при необходимости расчета высоты определенного элемента.

# selectedIndexChangedEventDescr
source: Occurs when the value of the SelectedIndex property changes.
sr: Возникает при изменении свойства SelectedIndex.

# selectedIndexDescr
source: The index of the currently selected item.
sr: Индекс выбранного в данный момент элемента.

# selectionChangeCommittedEventDescr
source: Occurs when an item is chosen from the drop-down list and the drop-down list is closed.
sr: Возникает при выборе элемента из раскрывающегося списка и закрытии этого списка.

# toStringBack
source: Back
sr: Назад

# toStringDefault
source: (default)
sr: (по умолчанию)

# toStringDelete
source: Del
sr: DELETE

# toStringEnd
source: End
sr: Конец

# toStringEnter
source: Enter
sr: ВВОД

# toStringHome
source: Home
sr: Главная

# toStringInsert
source: Ins
sr: INSERT

# toStringNone
source: (none)
sr: (нет)

# toStringPageDown
source: PgDn
sr: PAGE DOWN

# toStringPageUp
source: PgUp
sr: PAGE UP

# valueChangedEventDescr
source: Occurs when the value of the control changes.
sr: Происходит при изменении значения данного элемента управления.

# ComboBoxEditDefaultAccessibleName
source: ComboBox
sr: Cuadro combinado

# ExDlgOk
source: OK
sr: Aceptar

# toStringShift
source: Shift
sr: Mayúsculas

# DataGridView_AccNullValue
source: (null)
sr: (なし)

# toStringControl
source: Ctrl
sr: Strg
