Repository: dotnet/winforms
Catalog: src/System.Windows.Forms/src/Resources/xlf/*.*.xlf
Languages: sr

# FormOnDeactivateDescr
source: Occurs whenever the form is deactivated.
sr: Происходит при каждой деактивации данной формы.

# FormOnDpiChangedDescr
source: Occurs when form is moved to a monitor with a different resolution and scaling level, or when form's monitor scaling level is changed in the Windows settings.
sr: Происходит, когда форма перемещается на монитор с другим разрешением и уровнем масштабирования или когда уровень масштабирования монитора формы изменен в параметрах Windows.

# FormOnFormClosedDescr
source: Occurs whenever the user closes the form, after the form has been closed and specifies the close reason.
sr: Возникает при каждом завершении работы с формой после того, как форма была закрыта, и определяет причины этого закрытия.

# FormOnFormClosingDescr
source: Occurs whenever the user closes the form, before the form has been closed and specifies the close reason.
sr: Возникает при каждом завершении работы с формой до того, как форма была закрыта, и определяет причины этого закрытия.

# FormOnInputLangChangeDescr
source: Occurs whenever the language used for input for this form changes.
sr: Происходит при каждом изменении языка, используемого для заполнения этой формы.

# FormOnInputLangChangeRequestDescr
source: A request by the system to change the input language for this form. This request can be refused.
sr: Запрос от системы на изменение языка заполнения этой формы. Может быть отклонен.

# FormOnLoadDescr
source: Occurs whenever the user loads the form.
sr: Происходит при каждой загрузке данной формы пользователем.

# FormOnMDIChildActivateDescr
source: Occurs when an MDI Child window is activated.
sr: Происходит при активации дочернего MDI-окна.

# FormOnMaximizedBoundsChangedDescr
source: Event raised when the value of the MaximizedBounds property is changed on Form.
sr: Событие возникает при изменении в Form значения свойства MaximizedBounds.

# FormOnMaximumSizeChangedDescr
source: Event raised when the value of the MaximumSize property is changed on Form.
sr: Событие возникает при изменении в Form значения свойства MaximumSize.

# FormOnMenuCompleteDescr
source: Occurs when menu selection is completed and menu modal message loop has exited.
sr: Происходит при завершении выбора из меню и выходе из модального цикла обработки сообщений меню.

# FormOnMenuStartDescr
source: Occurs when any menu is displayed and menu modal message loop is entered.
sr: Происходит при отображении любого меню и входе в модальный цикл обработки сообщений меню.

# FormOnMinimumSizeChangedDescr
source: Event raised when the value of the MinimumSize property is changed on Form.
sr: Событие возникает при изменении в Form значения свойства MinimumSize.

# FormOnResizeBeginDescr
source: Occurs when the form enters the sizing modal loop.
sr: Возникает, когда форма входит в модальный цикл задания размеров.

# FormOnResizeEndDescr
source: Occurs when the form exits the sizing modal loop.
sr: Возникает, когда форма выходит из модального цикла задания размеров.

# FormOnShownDescr
source: Occurs whenever the form is first shown.
sr: Возникает при первом отображении формы.

# FormOpacityDescr
source: The opacity percentage of the control.
sr: Степень прозрачности элемента управления (в процентах).

# FormOwnedFormsDescr
source: Array of forms owned by this form.
sr: Массив форм, принадлежащих этой форме.

# FormOwnerDescr
source: The owner of this form.
sr: Владелец этой формы.

# FormShowIconDescr
source: Indicates whether an icon is displayed in the title bar of the form.
sr: Указывает, отображается ли значок в строке заголовка формы.

# FormShowInTaskbarDescr
source: Determines whether the form appears in the Windows Taskbar.
sr: Определяет, отображается ли данная форма на панели задач Windows.

# FormSizeGripStyleDescr
source: Determines when the SizeGrip will be displayed for the form.
sr: Определяет, когда для данной формы отображается SizeGrip.

# FormStartPositionDescr
source: Determines the position of a form when it first appears.
sr: Определяет первоначальное положение формы при ее отображении.

# FormTopMostDescr
source: Indicates whether the form always appears above all other forms that do not have this property set to true.
sr: Определяет, отображается ли данная форма поверх других форм, для которых данное свойство не имеет значение true.

# FormTransparencyKeyDescr
source: A color which will appear transparent when painted on the form.
sr: Цвет, который отображается прозрачным при закраске этой формы.

# FormWindowStateDescr
source: Determines the initial visual state of the form.
sr: Определяет исходное видимое состояние данной формы.

# FormatControlFormatDescr
source: Indicates the Format object that this control is currently using to format its values.
sr: Указывает объект Format, который используется в текущий момент этим элементом управления для форматирования своих значений.

# Formatter_CantConvert
source: Value '{0}' cannot be converted to type '{1}'.
sr: Значение '{0}' невозможно привести к типу '{1}'.

# Formatter_CantConvertNull
source: Null value cannot be converted to type '{1}'.
sr: Пустое значение невозможно привести к типу '{1}'.

# GridItemDisposed
source: The GridItem has been disposed and is no longer usable.
sr: GridItem ликвидирован и не может использоваться в дальнейшем.

# GridItemNotExpandable
source: The GridItem cannot be expanded.
sr: Невозможно расширить GridItem.

# GridPanelCellPositionDescr
source: Specifies the Row and Column position of the control.
sr: Определяет положение Row и Column элемента управления.

# GridPanelColumnDescr
source: The column position of the specified child control.
sr: Положение столбцов указанного дочернего элемента управления.

# GridPanelColumnStylesDescr
source: The column styles of the table.
sr: Стиль столбцов таблицы.

# GridPanelColumnsDescr
source: The number of columns on the table.
sr: Число столбцов в таблице.

# GridPanelGetAlignmentDescr
source: The alignment of the control.
sr: Выравнивание элемента управления.

# GridPanelGetBoxStretchDescr
source: The box stretch of the control.
sr: Растягивание окна элемента управления.

# GridPanelGetColumnSpanDescr
source: The column span of the control.
sr: Зона контроля столбца.

# GridPanelGetRowSpanDescr
source: The row span of the control.
sr: Зона контроля строки.

# GridPanelRowDescr
source: The row position of the absolutely positioned element.
sr: Положение строки элемента, положение которого определено в абсолютных координатах.

# GridPanelRowStylesDescr
source: The row styles of the table.
sr: Стили строк таблицы.

# GridPanelRowsDescr
source: The number of rows on the table.
sr: Число строк в таблице.

# HandleAlreadyExists
source: Window handle already exists.
sr: Дескриптор окна уже существует.

# HelpCaption
source: Help
sr: Справка

# HelpInvalidURL
source: Help URL '{0}' is not valid.
sr: Недопустимый адрес справки URL '{0}'.

# HelpProviderHelpKeywordDescr
source: Determines the Help keyword associated with this control.
sr: Определяет ключевое слово Help, связанное с этим элементом управления.

# HelpProviderHelpNamespaceDescr
source: The Help namespace (for example HTML 1.0 Help file) that will be used. It is only used for controls that have the HelpKeyword set.
sr: Пространство имен справки (например, файл Справки HTML 1.0), которое будет использоваться. Используется только для элементов управления с заданным свойством HelpKeyword.

# HelpProviderHelpStringDescr
source: Determines the Help string associated with this control.
sr: Определяет строку справки, связанную с этим элементом управления.

# HelpProviderNavigatorDescr
source: Determines the kind of Help associated with this control.
sr: Определяет вид справки, связанной с этим элементом управления.

# HelpProviderShowHelpDescr
source: Determines if Help should be displayed for this control.
sr: Определяет, должна ли отображаться справка для этого элемента управления.

# HtmlDocumentInvalidDomain
source: Argument for the Domain property must be a fully qualified domain name using Domain Name System (DNS) conventions.
sr: Аргументом свойства Domain должно быть полное имя домена, соответствующее требованиям службы доменных имен (DNS).

# HtmlElementAttributeNotSupported
source: The attribute you specified is not supported on this element.
sr: Указанный атрибут не поддерживается для данного элемента.

# HtmlElementMethodNotSupported
source: Method is not supported on this type of HtmlElement.
sr: Метод не поддерживается для данного типа HtmlElement.

# HtmlElementPropertyNotSupported
source: Property is not supported on this type of HtmlElement.
sr: Свойство не поддерживается для данного типа HtmlElement.

# ICurrencyManagerProviderDescr
source: Provides custom binding management for components.
sr: Обеспечивает управление связыванием для компонентов.

# ISupportInitializeDescr
source: Specifies support for transacted initialization.
sr: Определяет поддержку для инициализации транзакции.

# IllegalCrossThreadCall
source: Cross-thread operation not valid: Control '{0}' accessed from a thread other than the thread it was created on.
sr: Недопустимая операция в нескольких потоках: попытка доступа к элементу управления '{0}' не из того потока, в котором он был создан.

# IllegalCrossThreadCallWithStack
source: Cross-thread operation not valid: Control '{0}' accessed from a thread other than the thread it was created on. Stack trace where the illegal operation occurred was: {1}"
sr: Недопустимая операция в нескольких потоках: попытка доступа к элементу управления '{0}' не из того потока, в котором он был создан. Трассировка стека, в котором произошла недопустимая операция: {1}"

# IllegalState
source: Internal state of the {1} class is not valid.
sr: Недопустимое внутреннее состояние класса {1}.

# ImageListAddFailed
source: Image cannot be added to the ImageList.
sr: Добавление изображения к ImageList невозможно.

# ImageListAllowMirroringDescr
source: Indicates whether the images in the list should be mirrored.
sr: Указывает, требуется ли зеркальное отображение изображений списка.

# ImageListBadImage
source: Parameter must be of type Image.
sr: Параметр должен иметь тип Image.

# ImageListBitmap
source: Image must be a Bitmap.
sr: Изображение должно быть растровым.

# ImageListColorDepthDescr
source: The number of colors to use to render images.
sr: Число цветов, используемых для отрисовки изображений.

# ImageListCreateFailed
source: Creation of the ImageList handle did not succeed.
sr: Не удалось создать дескриптор ImageList.

# ImageListEntryType
source: Image added to an ImageList must either derive from Image or be an Icon.
sr: Изображение, добавляемое к ImageList, должно иметь тип, производный от Image, либо тип Icon.

# ImageListGetFailed
source: Retrieval of the image from ImageList did not succeed.
sr: Не удалось извлечь изображение из ImageList.

# ImageListHandleCreatedDescr
source: Indicates if the native handle has been created for this ImageList.
sr: Показывает, был ли создан собственный дескриптор для ImageList.

# ImageListHandleDescr
source: The native handle of the ImageList.
sr: Собственный дескриптор ImageList.

# ImageListImageStreamDescr
source: Retrieves an ImageList streamer for persisting images.
sr: Извлекает диспетчер потока ImageList для хранимых изображений.

# ImageListImageTooShort
source: Image strip shorter than the ImageSize property cannot be added.
sr: Невозможно добавить полосу изображения, длина которой меньше значения свойства ImageSize.

# ImageListImagesDescr
source: The images stored in this ImageList.
sr: Изображения, записанные в ImageList.

# ImageListOnRecreateHandleDescr
source: Occurs when the ImageList needs to recreate its handle.
sr: Возникает, когда для ImageList требуется восстановить дескриптор.

# ImageListRemoveFailed
source: Removal of the image from ImageList did not succeed.
sr: Не удалось удалить изображение из ImageList.

# ImageListReplaceFailed
source: Replacement of the image in ImageList did not succeed.
sr: Не удалось заменить изображение в ImageList.

# ImageListRightToLeftInvalidArgument
source: 'Inherit' is not a valid value for this property. Must be set to 'Yes' or 'No'.
sr: Inherit не является допустимым значением для данного свойства. Ожидается Yes или No.

# ImageListSizeDescr
source: The size of individual images in the ImageList.
sr: Размер отдельных изображений в ImageList.

# ImageListStreamerLoadFailed
source: Loading of the ImageList did not succeed.
sr: Не удалось загрузить ImageList.

# ImageListStreamerSaveFailed
source: Saving of the ImageList did not succeed.
sr: Не удалось сохранить ImageList.

# ImageListStripBadWidth
source: Width of the image strip must be a positive multiple of ImageSize.Width.
sr: Значение ширины полосы изображения должно быть положительным и кратным значению ImageSize.Width.

# ImageListTransparentColorDescr
source: The color that is treated as transparent.
sr: Цвет, который считается прозрачным.

# IndexOutOfRange
source: Index {0} is out of range.
sr: Индекс {0} вне допустимого диапазона.

# InvalidArgument
source: InvalidArgument=Value of '{1}' is not valid for '{0}'.
sr: InvalidArgument=Значение '{1}' недопустимо для '{0}'.

# InvalidBoundArgument
source: Value of '{1}' is not valid for '{0}'. '{0}' should be between {2} and {3}.
sr: Значение '{1}' недопустимо для '{0}'. '{0}' должно лежать в диапазоне от {2} до {3}.

# InvalidCrossThreadControlCall
source: Action being performed on this control is being called from the wrong thread. Marshal to the correct thread using Control.Invoke or Control.BeginInvoke to perform this action.
sr: Действие, выполняющееся для данного элемента управления, вызвано из неверного потока. Для выполнения данного действия перейдите в правильный поток с помощью Control.Invoke или Control.BeginInvoke.

# InvalidExBoundArgument
source: Value of '{1}' is not valid for '{0}'. '{0}' should be greater than {2} and less than {3}.
sr: Значение '{1}' недопустимо для '{0}'. '{0}' должно быть больше {2} и меньше {3}.

# InvalidFileFormat
source: File format is not valid.
sr: Недопустимый формат файла.

# InvalidFileType
source: File type is not valid.
sr: Недопустимый тип файла.

# InvalidGDIHandle
source: Win32 handle passed to {0} is not valid or is the wrong type.
sr: Дескриптор Win32, переданный в {0}, является недопустимым либо имеет неверный тип.

# InvalidHighBoundArgument
source: Value of '{1}' is not valid for '{0}'. '{0}' must be less than {2}.
sr: Значение '{1}' недопустимо для '{0}'. '{0}' должно быть меньше {2}.

# InvalidHighBoundArgumentEx
source: Value of '{1}' is not valid for '{0}'. '{0}' must be less than or equal to {2}.
sr: Значение '{1}' недопустимо для '{0}'. '{0}' должно быть меньше или равно {2}.

# InvalidLowBoundArgument
source: Value of '{1}' is not valid for '{0}'. '{0}' must be greater than {2}.
sr: Значение '{1}' недопустимо для '{0}'. '{0}' должно быть больше {2}.

# InvalidLowBoundArgumentEx
source: Value of '{1}' is not valid for '{0}'. '{0}' must be greater than or equal to {2}.
sr: Значение '{1}' недопустимо для '{0}'. '{0}' должно быть больше или равно {2}.

# InvalidNullArgument
source: Null is not a valid value for '{0}'.
sr: Для '{0}' неопределенное значение недопустимо.

# InvalidNullItemInCollection
source: One or more items in the collection are null.
sr: Один или несколько элементов коллекции имеют пустое значение.

# InvalidPictureFormat
source: Image format is not valid. The image file may be corrupted.
sr: Недопустимый формат изображения. Возможно, поврежден файл изображения.

# InvalidPictureType
source: Argument '{0}' must be a picture that can be used as a {1}.
sr: Аргумент '{0}' должен быть рисунком, который можно использовать как {1}.

# InvalidResXBasePathOperation
source: Property can be changed only before the enumeration.
sr: Изменение свойства возможно только до перечисления.

# InvalidResXFile
source: ResX file {0} cannot be parsed.
sr: Разбор файла ResX {0} невозможен.

# InvalidResXFileReaderWriterTypes
source: ResX input is not valid. Cannot find valid "resheader" tags for the ResX reader and writer type names.
sr: Недопустимый ввод ResX. Не удается найти допустимые теги "resheader" для имен типа чтения и записи ResX.

# InvalidResXNoType
source: Could not find a type for a name. The type name was '{0}'.
sr: Не удалось найти тип для имени. Имя типа: '{0}'.

# InvalidResXResourceNoName
source: Cannot find a name for the resource with the value '{0}'.
sr: Не удается найти имя ресурса со значением '{0}'.

# InvalidSendKeysKeyword
source: Keyword "{0}" is not valid.
sr: Недопустимое ключевое слово "{0}".

# InvalidSendKeysRepeat
source: Specified repeat count is not valid.
sr: Указан недопустимый счетчик повторов.

# InvalidSendKeysString
source: SendKeys string '{0}' is not valid.
sr: Недопустимая строка SendKeys '{0}'.

# InvalidSingleMonthSize
source: MonthCalendar size information cannot be retrieved.
sr: Не удается извлечь информацию о размере MonthCalendar.

# InvalidWndClsName
source: Window class name is not valid.
sr: Недопустимое имя класса Window.

# Invalid_boolean_attribute
source: Attribute {0} must be set to true or false.
sr: Атрибут {0} должен иметь значение true или false.

# InvocationException
source: Type {0} in the data at line {1}, position {2}, cannot be loaded because it threw the following exception during construction: {3}
sr: Невозможно загрузить тип {0} для данных в строке {1}, позиция {2}. Во время построения сгенерировано следующее исключение: {3}

# IsMirroredDescr
source: Indicates whether the control is mirrored.
sr: Определяет, отображается ли элемент управления в зеркальном отображении.

# KeyboardToolTipDisplayBehaviorRequiresAccessibilityImprovementsLevel3
source: ToolTips display on keyboard focus requires the following AppContextSwitchOverrides: 'Switch.UseLegacyAccessibilityFeatures.3' and 'Switch.System.Windows.Forms.UseLegacyToolTipDisplay'
sr: Для отображения подсказок при передаче фокуса клавиатуры требуются следующие переопределения AppContextSwitchOverrides: "Switch.UseLegacyAccessibilityFeatures.3" и "Switch.System.Windows.Forms.UseLegacyToolTipDisplay"

# KeysConverterInvalidKeyCombination
source: Key combination is not valid.
sr: Недопустимая комбинация ключа.

# KeysConverterInvalidKeyName
source: Key name is not valid.
sr: Недопустимое имя ключа.

# LabelAutoEllipsisDescr
source: Enables the automatic handling of text that extends beyond the width of the label control.
sr: Включает автоматическую обработку текста, выходящего за пределы ширины элемента управления с подписью.

# LabelAutoSizeDescr
source: Enables automatic resizing based on font size. Note that this is only valid for label controls that do not wrap text.
sr: Включает автоматическое изменение размера в соответствии с размером шрифта. Эта функция действует только в отношении элементов управления с подписями, в которых текст не переносится на другую строку.

# LabelBackgroundImageDescr
source: The background image of this control.
sr: Фоновое изображение этого элемента управления.

# LabelBorderDescr
source: Determines if the label has a visible border.
sr: Определяет, имеет ли подпись видимую границу.

# LabelOnTextAlignChangedDescr
source: Event raised when the value of the TextAlign property is changed on Label.
sr: Событие создается, когда для Label изменяется значение свойства TextAlign.

# LabelPreferredHeightDescr
source: The preferred height of this control.
sr: Предпочтительная высота данного элемента управления.

# LabelPreferredWidthDescr
source: The preferred width of this control.
sr: Предпочтительная ширина данного элемента управления.

# LabelTextAlignDescr
source: Determines the position of the text within the label.
sr: Определяет положение текста в границах подписи.

# LabelUseMnemonicDescr
source: If true, the first character preceded by an ampersand (&&) will be used as the label's mnemonic key.
sr: При значении true первый знак, перед которым стоит амперсант (&&), будет использоваться как мнемоническая клавиша этой метки.

# LayoutEngineUnsupportedType
source: LayoutEngine cannot arrange objects of type '{0}'.
sr: LayoutEngine не может упорядочить объекты типа '{0}'.

# LinkLabelActiveLinkColorDescr
source: Determines the color of the hyperlink when the user clicks the link.
sr: Определяет цвет гиперссылки при щелчке ссылки.

# LinkLabelAreaLength
source: LinkArea length cannot be negative.
sr: Длина LinkArea не может быть отрицательной.

# LinkLabelAreaStart
source: LinkArea start cannot be negative.
sr: Начальная позиция LinkArea не может быть отрицательной.

# LinkLabelBadLink
source: Parameter must be of type Link.
sr: Параметр должен иметь тип Link.

# LinkLabelDisabledLinkColorDescr
source: Determines the color of the hyperlink when disabled.
sr: Определяет цвет отключенной гиперссылки.

# LinkLabelLinkAreaDescr
source: Portion of the text in the label to render as a hyperlink.
sr: Часть текста в подписи, которая должна отображаться как гиперссылка.

# LinkLabelLinkBehaviorDescr
source: Determines the underline behavior of the hyperlink.
sr: Определяет использование подчеркивания для гиперссылки.

# LinkLabelLinkClickedDescr
source: Occurs when the link is clicked.
sr: Происходит при выборе данной ссылки.

# LinkLabelLinkColorDescr
source: Determines the color of the hyperlink in its default state.
sr: Определяет цвет данной гиперссылки в состоянии по умолчанию.

# LinkLabelLinkVisitedDescr
source: Determines if the hyperlink should be rendered as visited.
sr: Определяет, должна ли данная гиперссылка отображаться как посещенная.

# LinkLabelOverlap
source: Overlapping link regions.
sr: Перекрывающиеся области ссылок.

# LinkLabelVisitedLinkColorDescr
source: Determines the color of the hyperlink when the LinkVisited property is set to true.
sr: Определяет цвет гиперссылки при присвоении свойству LinkVisited значения true (истина).

# ListBindingBindField
source: Cannot bind to the property or column {0} on the DataSource.
sr: Привязка к свойству или столбцу {0} для DataSource невозможна.

# ListBindingBindProperty
source: Cannot bind to the property '{0}' on the target control.
sr: Привязка к свойству '{0}' конечного элемента управления невозможна.

# ListBindingBindPropertyReadOnly
source: Cannot bind to property '{0}' because it is read-only.
sr: Не удается выполнить привязку к свойству '{0}', так как оно доступно только для чтения.

# ListBindingFormatFailed
source: Cannot format the value to the desired type.
sr: Приведение значения к указанному типу невозможно.

# ListBoxBorderDescr
source: Controls what type of border is drawn around the ListBox.
sr: Задает тип границы, отображаемой вокруг ListBox.

# ListBoxCantInsertIntoIntegerCollection
source: ListBox.IntegerCollection is sorted, and items cannot be inserted into it.
sr: ListBox.IntegerCollection отсортирован. Вставка элементов невозможна.

# ListBoxColumnWidthDescr
source: Indicates how wide each column should be in a multicolumn ListBox.
sr: Указывает, какой должна быть ширина каждого столбца в ListBox с несколькими столбцами.

# ListBoxCustomTabOffsetsDescr
source: The collection of pixel offsets each corresponding TAB character will be placed from the near edge of the client area.
sr: Коллекция смещений пикселей, каждое из которых соответствует символу TAB, будет размещена у ближнего края клиентской области.

# ListBoxDrawModeDescr
source: Controls list box painting. Either the system [NORMAL] or the user [OWNERDRAW] paints each item.
sr: Управляет закрашиванием списка. Каждый элемент прорисовывается системой [NORMAL] или пользователем [OWNERDRAW].
